{
  "courses": [
    {
      "index": 136,
      "title": "Learning Redis",
      "instructor": "Emmanuel Henri",
      "date_completed": "2022-02-04",
      "date": [
        {
          "$date": "2022-02-04T19:19:00.000Z"
        }
      ],
      "synopsis": "Redis—an in-memory data structure store—differs from relational databases like MySQL, and NoSQL databases like MongoDB. In this course, learn what Redis is and how it works as you discover how to build a client implementation using an ioredis client and a Node.js server. Emmanuel Henri explains how to install and set up Redis, and covers basic Redis tools and concepts, including persistence and replication. Plus, he reviews the different data types available, and demonstrates what you can do with strings, hashes, and lists. To wrap up, he goes over security options and best practices for securing a Redis instance.",
      "objectives": [
        "Installing and setting up Redis",
        "Reviewing the basics of data types",
        "Setting up persistence and replication",
        "Exploring strings and lists",
        "The hash data structure",
        "Securing a Redis instance",
        "Publishing and subscribing with Redis"
      ],
      "skills": ["Redis"],
      "comments": "Along with the learning objectives listed above, we also covered sets and sorted sets, and had a brief intro to Redis Sentinel and Redis Cluster.<br />We used the command line Redis client, and coded in Node.js, importing the <i>ioredis</i> Redis client package.<br />I wrote Windows batch files to start the main and replication servers, and the client, passing authorization. <br />And I found a GUI client for Windows, <a href=\"https://www.redinav.com/\" target=\"_blank\"><i>RediNav</i></a>.<br />I also installed and configured Redis on an Ubuntu instance of WSL (Windows Subsystem for Linux). And I installed it on one of my Hyper-V VMs of Ubuntu (Kubuntu), set up persistence, replication and security, and installed a GUI (<i>Another Redis Desktop Manager</i>) for it there. I also wrote shell scripts to start the replication server, and the client, passing authorization.<br />And I downloaded Docker images/containers of Redis and of the <i>Redis-Commander</i> GUI client.<br />I also created a Redis Cloud account.<br /><br />UPDATE (the next day): As the Windows version of Redis is just a port, and the instructor used a Mac, I went back and installed and configured it on my Mac. I also went and set the PATHs there, and in WSL and Kubuntu, which I hadn't done, so that I could run my shell scripts from anywhere in the terminal on those platforms.<br />I changed the bindings in the Redis config files on my Mac and Ubuntu VM, so that I was allowed to connect to those instances from the RediNav GUI in Windows. I then created connections to those in RediNav.<br />WSL already acted as 127.0.0.1, so I changed the config files there to use different ports (for the main and replication servers), so I could have and access distinct databases in Windows and WSL.<br />I also created connections to the WSL servers in RediNav.<br />And I wrote a Windows batch file to connect to the different port of the WSL main server with the Redis command line client from Windows at the same time.",
      "url": "https://www.linkedin.com/learning/learning-redis",
      "certs": ["CertificateOfCompletion_LearningRedis_LI.pdf"]
    },
    {
      "index": 135,
      "title": "Python 3.10 First Look",
      "instructor": "Claire Burn",
      "date_completed": "2022-02-01",
      "date": [
        {
          "$date": "2022-02-01T19:19:00.000Z"
        }
      ],
      "synopsis": "If you’re a regular user of Python, you’ve probably noticed that Python is frequently updated with new features, improvements, and applications. It can be hard to keep up with all the changes, but it’s important to stay current with the Python language. In this short course, Claire Burn walks you through the newest Python enhancement proposals in Python 3.10, as well as the module improvements and the deprecations introduced in this new version. She also demonstrates how to port to Python 3.10 from an older version, no matter what operating system you're using. If you’re looking for a quick look at Python 3.10 and don’t want to spend time wading through all the documentation, join Claire in this course.",
      "objectives": null,
      "skills": ["Python (Programming Language)"],
      "comments": null,
      "url": "https://www.linkedin.com/learning/python-3-10-first-look",
      "certs": ["CertificateOfCompletion_Python3.10FirstLook_LI.pdf"]
    },
    {
      "index": 134,
      "title": "Python Tools: Jupyter vs. PyCharm",
      "instructor": "Madecraft and Sam Pettus",
      "date_completed": "2022-01-30",
      "date": [
        {
          "$date": "2022-01-30T19:19:00.000Z"
        }
      ],
      "synopsis": "As Python has risen in popularity, there are many tools and repositories that have also become increasingly important. Of the many that are available, Jupyter and PyCharm have emerged as leading tools. In this course, software engineer and instructor Sam Pettus provides you with the baseline knowledge you need to work effectively with both Jupyter and PyCharm, as well as determine which option works best for you. Sam begins by detailing the difference between integrated development environments (IDEs) and open-source web applications, as well as how each of these tools function. Sam then walks through the key differences between each tool when working on a data science project, including topics such as debugging and integrating data. He then goes over the user profiles that most commonly leverage each program, giving you the ability to make a decision between the two depending on the project or task at hand. After watching this course, you'll be familiar with the pros, cons, and use cases for each programming tool.  This course was created by Madecraft. We are pleased to host this training in our library.",
      "objectives": null,
      "skills": ["Jupyter", "Pycharm"],
      "comments": "I've used Jupyter Notebook and Visual Studio Code (and other tools) for programming Python, but not PyCharm. I'd seen mention of PyCharm, and this course has inspired me to queue up a PyCharm course here.<br />The instructor thew in some things about debugging in Jupyter that I hadn't learned yet.<br />He also mentioned <i>nbextensions</i> for Jupyter Notebooks.<br />PyCharm has a nice built-in (in the Professional Edition) code profiler feature.",
      "url": "https://www.linkedin.com/learning/python-tools-jupyter-vs-pycharm",
      "certs": ["CertificateOfCompletion_PythonTools-JupyterVsPyCharm_LI.pdf"]
    },
    {
      "index": 133,
      "title": "Postman Essential Training",
      "instructor": "Kristin Jackvony",
      "date_completed": "2022-01-27",
      "date": [
        {
          "$date": "2022-01-27T19:19:00.000Z"
        }
      ],
      "synopsis": "Automated API testing is one of the most efficient ways to ensure that an API is behaving as expected—faster and far superior to automated UI testing. For testers and developers responsible for API testing, Postman is a popular and free solution. It offers a rich interface for writing test cases and features for automation, such as the ability to reuse tests and integrate collections into a CI build system like Jenkins. This course introduces the process of writing, running, and automating API tests with Postman. Instructor Kristin Jackvony shows how to create a complete test collection; create easy and advanced assertions, including nested JSON assertions; run collections with the built-in collection runner and the command-line runner, Newman; and configure automatic runs in Jenkins projects.",
      "objectives": [
        "Creating collections",
        "Creating GET, POST, PUT, and DELETE requests",
        "Using environment variables",
        "Easy Postman assertions",
        "Advanced Postman assertions",
        "Running collections with the collection runner and Newman",
        "Automating test collections as Jenkins projects"
      ],
      "skills": ["Postman API", "API Testing"],
      "comments": "An excellent course! And a good follow-up course that expands on the <i>Introducing Postman</i> course I completed here.<br />Here, we used a different way to organize our Requests - in the <i>Introducing Postman</i> course, we created valid and invalid Examples under a Request. Here, we used a separate Folder for Negative Requests, which helped for our automated testing runs.<br />We learned about saving Response data as a Variable, using JavaScript and the Postman API.<br />We also added Tests, via assertions, checking response Status, and values in the returned Body.<br />We used the Collection Runner, to run through all (or just selected) tests from within Postman.<br />Then we exported our Collection and our Environment to run with Newman, from the command line.<br />We also installed and configured Jenkins, for scheduling our Newman tests.<br />I had problems starting the service when running the Jenkins MSI, so after some online research on the problem, I ran the Java .war file after copying out the Jenkins folder mid-installation, then cancelled the installation.<br />Then I opened the generated local Web site, and installed the Windows service from there, as well as adding the NodeJS plugin.<br />I also went ahead and generated and published the <a href=\"https://documenter.getpostman.com/view/15092439/UVe9TAMw\" target=\"_blank\"><i>Contact List</i> API Documentation</a>, as I learned to do in the prior course.",
      "url": "https://www.linkedin.com/learning/postman-essential-training",
      "certs": ["CertificateOfCompletion_PostmanEssentialTraining_LI.pdf"]
    },
    {
      "index": 132,
      "title": "Introducing Postman",
      "instructor": "David Fancher",
      "date_completed": "2022-01-23",
      "date": [
        {
          "$date": "2022-01-23T19:19:00.000Z"
        }
      ],
      "synopsis": "Postman is essentially like a graphical cURL. But if you’re only using it as such, then you’re missing out on some of the API development environment’s most interesting and useful features. In this course, instructor Dave Fancher highlights some of this key functionality as he shares how to best leverage Postman to enhance your API development experience. Dave shows how to work with a sample API to compose and authenticate requests, how to view and publish documentation, how to manage environments and variables, and more.",
      "objectives": [
        "Composing requests",
        "Managing cookies",
        "Viewing and publishing documentation",
        "Managing environments",
        "Using variables in requests",
        "Authorization with variables"
      ],
      "skills": ["API Development", "Postman API"],
      "comments": "I'd used Postman before, but mainly just running/testing ad-hoc Requests. This course covers the Postman UI, with a focus on using the features to organize and document APIs.<br />We covered the following:<br /><br />* Collections and Folders &mdash; to organize and save Requests<br /><br />* Setting up Authorization &mdash; at a Collection level, so that it applies to every Request in that Collection<br /><br />* History &mdash; to save and name Requests already used<br /><br />* Saving examples &mdash; e.g., of valid and invalid Requests, and their Responses<br /><br />* Adding Documentation<br /><br />* Publishing Documentation &mdash; so that it displays as a Web page<br /><br />&nbsp;&nbsp;&nbsp;I made a slight change to the styling (for the code background color):<br />&nbsp;&nbsp;&nbsp;<a href=\"https://documenter.getpostman.com/view/15092439/UVXqEYaU\" target=\"_blank\"><i>LinkedIn - Introducing Postman</i> Course API Documentation</a><br /><br />* Variables &mdash; can be used in Requests, as well as elsewhere throughout Postman<br /><br />NOTE: The Postman UI has changed since this course was published, so you get to some things a bit differently now than as shown.",
      "url": "https://www.linkedin.com/learning/introducing-postman",
      "certs": ["CertificateOfCompletion_IntroducingPostman_LI.pdf"]
    },
    {
      "index": 131,
      "title": "Agile Testing",
      "instructor": "Ash Coleman",
      "date_completed": "2022-01-15",
      "date": [
        {
          "$date": "2022-01-15T19:19:00.000Z"
        }
      ],
      "synopsis": "Learn how to create higher-quality software at a faster clip by implementing agile testing in your organization. Throughout this course, instructor Ash Coleman helps you boost your understanding of the role and methods of software testers, as well as how testing can enhance your agile workflow. To kick things off, Ash goes over the role of the tester in agile teams, detailing how testers govern, monitor, and encourage quality practices. Next, she steps through the agile testing approach and pinpoints where testers can add value. She also helps to acquaint you with key testing processes and responsibilities, including bug tracking; explores both manual testing and test automation; and discusses how continuous integration can be incorporated into the mix.",
      "objectives": [
        "Testing in the agile context",
        "The role of the agile tester",
        "Backlog grooming",
        "Sprint planning",
        "Tracking bugs",
        "Manual testing",
        "Test automation",
        "Continuous integration"
      ],
      "skills": ["Agile Testing"],
      "comments": "A good overview of the Agile process(es), focusing on a Tester role.",
      "url": "https://www.linkedin.com/learning/agile-testing-2",
      "certs": ["CertificateOfCompletion_AgileTesting_LI.pdf"]
    },
    {
      "index": 130,
      "title": "How Blockchains Will Change Business",
      "instructor": "Alison McCauley",
      "date_completed": "2022-01-12",
      "date": [
        {
          "$date": "2022-01-12T19:19:00.000Z"
        }
      ],
      "synopsis": "Blockchains are poised to disrupt entrenched industries and shatter conventional business models. Train your brain to see the opportunities and challenges of this next wave of digital change, before the way we do business is again reshaped by new technology. This jargon-free course can help you get up to speed. Join Alison McCauley, the best-selling author of Unblocked: How Blockchains Will Change Your Business (and What to Do about It), as she goes over what blockchains offer companies, as well as how this technology will impact everything from finance to HR.  Alison begins by explaining what blockchains accomplish, how they make it safer for everyone to work together, and where they do—and do not—deliver value. Then, she details the new tools that blockchains offer business, including how they can help you discern what's real from what's false in your digital world. Plus, learn how blockchains can impact different departments within your business, from finance to HR.",
      "objectives": null,
      "skills": ["Business Innovation", "Blockchain"],
      "comments": "This course was more recent than the other blockchain-related courses I have taken here, and provided some examples of how businesses are already using blockchains, and a lot of good ideas and examples of how blockchains could be used in the future.",
      "url": "https://www.linkedin.com/learning/how-blockchains-will-change-business",
      "certs": [
        "CertificateOfCompletion_HowBlockchainsWillChangeBusiness_LI.pdf",
        "CertificateOfCompletion_HowBlockchainsWillChangeBusiness_PMI.pdf"
      ]
    },
    {
      "index": 129,
      "title": "Tips for Better Business Writing",
      "instructor": "Natasha Terk",
      "date_completed": "2022-01-12",
      "date": [
        {
          "$date": "2022-01-12T19:19:00.000Z"
        }
      ],
      "synopsis": "Want to advance your communication skills? Improve your writing. Clear and concise writing is the key to helping your audience understand your message—whether it’s delivered in an email, report, memo, or white paper. This course, designed by Adcom Designs and Write It Well managing director, Natasha Terk, provides relevant, actionable tips to improve the quality and impact of your writing. Learn how to plan a message, format it for easy reading, and use the right words to communicate clearly. Plus, learn how to reduce or eliminate errors to maintain your professional image and credibility.",
      "objectives": [
        "Describe the two fundamental purposes of business writing.",
        "Define a key message, and explain how and where to use it.",
        "Explain how to generate a list of points for discussion and logically organize that list.",
        "Quantify appropriate sentence lengths for ease of understanding.",
        "Identify redundant words and jargon.",
        "Describe the importance of proofreading and list strategies for identifying errors."
      ],
      "skills": ["Business Writing"],
      "comments": "I saw that some former coworkers had taken this course, and although I think that I'm already pretty good at this, I figure that I can always improve.<br />As in another writing course that I'm taking here, this one emphasizes the fact that readers of such communication tend to scan more than engage in close reading, and offers ways to facilitate that for them.<br />It also offers advice on how to be more concise, and since I can sometimes suffer from what Mark Twain was referring to in a letter to a friend, I appreciated his line:<br />\"I didn't have time to write a short letter, so I wrote a long one instead.\"",
      "url": "https://www.linkedin.com/learning/tips-for-better-business-writing",
      "certs": [
        "CertificateOfCompletion_TipsForBetterBusinessWriting_LI.pdf",
        "CertificateOfCompletion_TipsForBetterBusinessWriting_NASBA.pdf"
      ]
    },
    {
      "index": 128,
      "title": "Blockchain: Learning Solidity",
      "instructor": "Emmanuel Henri",
      "date_completed": "2022-01-07",
      "date": [
        {
          "$date": "2022-01-07T19:19:00.000Z"
        }
      ],
      "synopsis": "Blockchain is a buzzword, but it's also a very powerful technology that allows everyday users to exchange sensitive data without a middleman. Programmers can leverage the blockchain in their applications using Solidity, a programming language for the Ethereum platform. This course teaches you how to build a simple contract-based application with Solidity. Emmanuel Henri starts with the basics of blockchain and smart contracts: self-executing transactions written directly in code. You can then learn all about the Solidity ecosystem, including syntax and advanced concepts such as source mappings, then apply them to build your very first contract.",
      "objectives": [
        "Installing Solidity",
        "Solidity programming basics: types, variables, functions, and conditionals",
        "Creating a smart contract in Solidity",
        "Setting variables",
        "Adding modifiers",
        "Finalizing functions",
        "Testing your contract"
      ],
      "skills": ["Solidity", "Blockchain"],
      "comments": "Solidity is a programming language for the Ethereum platform.<br />We used the <a href=\"https://remix.ethereum.org/\" target=\"_blank\"><i>Remix</i> online IDE/compiler</a>, where we coded and tested a Smart Contract (having to do with payouts from an inheritance).",
      "url": "https://www.linkedin.com/learning/blockchain-learning-solidity",
      "certs": ["CertificateOfCompletion_Blockchain-LearningSolidity_LI.pdf"]
    },
    {
      "index": 127,
      "title": "Blockchain: Beyond the Basics",
      "instructor": "Jonathan Reichental, Ph.D.",
      "date_completed": "2022-01-07",
      "date": [
        {
          "$date": "2022-01-07T19:19:00.000Z"
        }
      ],
      "synopsis": "Blockchain is an exciting new technology that is redefining how we store, update, and move data. Learn about the blockchain and the implications of decentralized, encrypted data storage for business and society, in this course with Dr. Jonathan Reichental. He begins by explaining exactly how the blockchain works, including the concepts of cryptography, mining, distribution, and smart contracts. Next, he describes how the blockchain enables the most popular cryptocurrency, bitcoin. Learn how new bitcoin is generated, how it is transacted, and the requirements for participating as either an exchange, a trader, or a miner. The course also covers other popular technology manifestations of blockchain, such as Hyperledger and Ripple. Dr. Reichental then puts blockchain technology in context in several different industries, including energy and security, and helps learners understand how to think about the blockchain in ways that can be applied in any field.",
      "objectives": [
        "Explain how the relationship between blockchain and Bitcoin is similar to the relationship of the internet and FTP.",
        "List specific qualities of a blockchain database.",
        "Describe how transactions are updated in a distributed ledger.",
        "Explain how the price of Bitcoin is derived.",
        "Assess the core benefits of altcoins.",
        "Recall how blockchain relates to the energy sector."
      ],
      "skills": ["Blockchain"],
      "comments": "A followup to this instructor's <i>Blockchain Basics</i> course.<br />Like that course, this one is a bit dated. He has a recent update to the prior course, but not yet for this one. But this course is still relevant, and most of the Blockchain-related Web sites he references still exist (although they may have evolved).",
      "url": "https://www.linkedin.com/learning/blockchain-beyond-the-basics",
      "certs": [
        "CertificateOfCompletion_Blockchain-BeyondTheBasics_LI.pdf",
        "CertificateOfCompletion_Blockchain-BeyondTheBasics_NASBA.pdf"
      ]
    },
    {
      "index": 126,
      "title": "Using Docker and .NET Core",
      "instructor": "Shayne Boyer, Microsoft .NET , and Lisa Guthrie",
      "date_completed": "2022-01-02",
      "date": [
        {
          "$date": "2022-01-02T19:19:00.000Z"
        }
      ],
      "synopsis": "Why use containers with your .NET Core applications? When you write an application, you have to consider the application code, frameworks, packages, and the underlying operating system itself. Using Docker allows you to encapsulate everything you need to run an application, with all its dependencies, in one nice, neat package that you can replicate on any machine or workstation, as many times as you need. In this course, Shayne Boyer and Lisa Guthrie start with the very basics of Docker, covering the concepts and practical uses, then move on to integrating Docker with Visual Studio to help you containerize your apps with just a few clicks. Finally, Shayne and Lisa show you a simple way to publish your containerized web app.",
      "objectives": null,
      "skills": [".NET Core", "Application Development", "Docker Products"],
      "comments": null,
      "url": "https://www.linkedin.com/learning/using-docker-and-dot-net-core",
      "certs": ["CertificateOfCompletion_UsingDockerAnd.NETCore_LI.pdf"]
    },
    {
      "index": 125,
      "title": "Fundamentals of Dynamic Programming",
      "instructor": "Avik Das",
      "date_completed": "2021-12-30",
      "date": [
        {
          "$date": "2021-12-30T19:19:00.000Z"
        }
      ],
      "synopsis": "Having a clearer picture of dynamic programming (DP) can take your coding to the next level. It's a technique that makes it possible to adeptly solve difficult problems, which is why it comes up in interviews and is used in applications like machine learning. In this course, learn about the uses of DP, how to determine when it’s an appropriate tactic, how it produces efficient and easily understood algorithms, and how it's used in real-world applications. Compare different approaches to computing the Fibonacci Sequence and learn how to visualize the problem as a directed acyclic graph. Explore the different variations of DP that you’re likely to encounter by working through a series of increasingly complex challenges. Plus, build a content-aware image resizing application with these new concepts at its core.",
      "objectives": null,
      "skills": ["Dynamic Programming"],
      "comments": "I hadn't had the need to use Dynamic Programming techniques since learning about them at Cal State Fullerton. I find them interesting, so while taking this course, I dug up a couple of my text books from courses on algorithms from Fullerton, to refresh myself on what we learned there.<br />At Fullerton, we implemented some algorithms in C++, and in this course we used Python, so I was able to compare the differences in implementation between the two languages.<br />In this course, we coded a couple of DP algorithms to generate Fibonacci sequences, comparing their performance.<br />Along with solving a couple of other problems, we also implemented an application for content-aware image resizing, where instead of merely cropping an image, we removed \"uninteresting\" parts (\"low energy\" seams) from within an image.<br />I reworked our solution so that the program is called with a command line argument for the desired final percentage of the image width, rather than for how many low energy seams to remove, so that one doesn't need to know anything about the width in pixels of the original image.<br />We also implemented an application using the <i>Viterbi algorithm</i> with Hidden Markov Models to \"predict\" the next syllable, for use, for example, in speech recognition. ",
      "url": "https://www.linkedin.com/learning/fundamentals-of-dynamic-programming",
      "certs": [
        "CertificateOfCompletion_FundamentalsOfDynamicProgramming_LI.pdf"
      ]
    },
    {
      "index": 124,
      "title": "UX Design: 7 Implementation Planning",
      "instructor": "Chris Nodder",
      "date_completed": "2021-12-24",
      "date": [
        {
          "$date": "2021-12-24T19:19:00.000Z"
        }
      ],
      "synopsis": "User-centered design (UCD) artifacts aren't just for the visual aspect of design. In this final installment of \"UX Design Techniques\"—a series designed to teach you how to make your development process more user centered—learn how to use artifacts from each of the UCD techniques to help plan the implementation of your design.  Implementation planning happens at the end of the initial UCD cycle. First, you observe users, and then you create an experience map to extract pain points, goals, and personas. This gives you the information needed to do ideation exercises. After ideation, bring things back to reality by creating scenarios, which you use to build a prototype UI for planning purposes. By investing time in these UCD activities, you'll enter the development phase of your project with a much better understanding of what you need to build to delight your users. Having a set of measurable goals and a prototype interface makes it easier to plan your implementation and set interim deliverables that you know will deliver value to your users.",
      "objectives": [
        "Utilizing user-centered design (UCD) artifacts",
        "Creating an implementation plan",
        "Creating a story map",
        "Laying out the interface",
        "Prioritizing items on the story map",
        "Setting metrics for story map items"
      ],
      "skills": ["User Experience Design (UED)"],
      "comments": null,
      "url": "https://www.linkedin.com/learning/ux-design-7-implementation-planning-2",
      "certs": [
        "CertificateOfCompletion_UX Design-7_ImplementationPlanning_LI.pdf"
      ]
    },
    {
      "index": 123,
      "title": "UX Design: 6 Paper Prototyping",
      "instructor": "Chris Nodder",
      "date_completed": "2021-12-22",
      "date": [
        {
          "$date": "2021-12-22T19:19:00.000Z"
        }
      ],
      "synopsis": "In this installment of \"UX Design Techniques,\" learn how to make paper prototypes so you can validate your ideas before you write any code. This method of prototyping is fast and inexpensive, allowing you to test design ideas early using simple materials: paper, Post-it notes, index cards, and Sharpies. Chris Nodder takes you through the process, including making separate sketches of each interface element, highlighting areas where there would be interaction between a system and a user, and then running through user testing so you can observe the user's experience, reposition elements, and make adjustments.",
      "objectives": [
        "Paper prototyping in user-centered design (UCD)",
        "Making paper prototypes",
        "Observing user interactions",
        "Adjusting designs based on feedback",
        "Testing using paper prototypes of interfaces"
      ],
      "skills": ["Paper Prototyping", "User Experience Design (UED)"],
      "comments": null,
      "url": "https://www.linkedin.com/learning/ux-design-6-paper-prototyping",
      "certs": ["CertificateOfCompletion_UXDesign-6_PaperPrototyping_LI.pdf"]
    },
    {
      "index": 122,
      "title": "UX Design: 5 Creating Scenarios and Storyboards",
      "instructor": "Chris Nodder",
      "date_completed": "2021-12-19",
      "date": [
        {
          "$date": "2021-12-19T19:19:00.000Z"
        }
      ],
      "synopsis": "Scenarios and storyboards provide a reality check for your designs, helping you identify design gaps and articulate exactly what features you need to build to make users happy. This course shows how to use these tools to map the concepts generated during the ideation phase of UX design to a user's real-world tasks. Author Chris Nodder explains how to write scenarios and transform them into visual storyboards that show elements that are hard to describe with words alone, such as emotion, action, detail, and progression.  By the end, you'll have clear documentation to lead you through prototyping and implementation. Explore these phases and more in \"UX Design Techniques\" series on Chris's author page.",
      "objectives": null,
      "skills": ["User Experience Design (UED)"],
      "comments": null,
      "url": "https://www.linkedin.com/learning/ux-design-5-creating-scenarios-and-storyboards-2",
      "certs": [
        "CertificateOfCompletion_UXDesign-5_CreatingScenariosAndStoryboards_LI.pdf"
      ]
    },
    {
      "index": 121,
      "title": "UX Design: 4 Ideation",
      "instructor": "Chris Nodder",
      "date_completed": "2021-12-16",
      "date": [
        {
          "$date": "2021-12-16T19:19:00.000Z"
        }
      ],
      "synopsis": "Ideation helps your team generate a lot of different design ideas in a short amount of time. In UX design, your first idea is seldom your best. A broad set of ideas is more likely to lead to a more creative, more satisfactory solution for your users. The ideation phase of UX design is where you consider all the different ways you could possibly fix your users' pain points, and then narrow down to some practical, viable alternatives.  In this installment of UX Design Techniques, Chris Nodder explores a variety of ideation techniques. Chris explains how to brainstorm in a way that lets all members of a team, not just the designers, contribute to a product's overall direction.",
      "objectives": null,
      "skills": ["Creative Ideation", "User Experience Design (UED)"],
      "comments": null,
      "url": "https://www.linkedin.com/learning/ux-design-4-ideation",
      "certs": ["CertificateOfCompletion_UXDesign-4_Ideation_LI.pdf"]
    },
    {
      "index": 120,
      "title": "Service Metrics for Customer Service",
      "instructor": "Brad Cleveland",
      "date_completed": "2021-12-14",
      "date": [
        {
          "$date": "2021-12-14T19:19:00.000Z"
        }
      ],
      "synopsis": "Establishing the right metrics to support effective customer service requires a solid understanding of how metrics work, how metrics are interrelated, and what the uses and limitations of metrics are. Wisely employed, the right metrics help guide decisions, support collaboration, and encourage better performance. But metrics that are incomplete, unfair, or misapplied can send the wrong messages, negatively impact customers and employees, and lead to inefficiencies.  This course covers, in a step-by-step fashion, why metrics are important, which metrics matter the most, how to interpret results, and examples of how successful organizations leverage metrics to improve decisions and performance. Whether your service operation includes face-to-face services, contact centers, social media, self-service, or any combination, this course provides practical know-how, real-life examples, and guidance for implementing and using the right metrics and establishing meaningful goals.",
      "objectives": [
        "Identifying customer expectations",
        "Avoiding pitfalls",
        "Essential metrics for the service operation",
        "Identifying alternatives for measuring engagement",
        "Engaging support that drives the right behaviors",
        "Key areas of focus for individuals",
        "Assessing service interactions",
        "Calibration and coaching",
        "Clarifying responsibilities"
      ],
      "skills": [
        "Metrics Driven",
        "Customer Service Management",
        "Key Metrics"
      ],
      "comments": null,
      "url": "https://www.linkedin.com/learning/service-metrics-for-customer-service",
      "certs": [
        "CertificateOfCompletion_ServiceMetricsForCustomerService_LI.pdf"
      ]
    },
    {
      "index": 119,
      "title": "UX Design: 3 Creating Personas",
      "instructor": "Chris Nodder",
      "date_completed": "2021-12-08",
      "date": [
        {
          "$date": "2021-12-08T19:19:00.000Z"
        }
      ],
      "synopsis": "Who are you developing for? How will they use your design? Building user personas can answer these important questions. In this course, Chris Nodder shows you how to create personas using information about the users most relevant to your business. He shows you how to gather and use data from interactions and site visits to define groups that represent a picture of your user types. These personas can help drive development and make sure your team is designing your product, application, or website with the same customer in mind, resulting in coherent, focused goals and an optimal user experience.",
      "objectives": null,
      "skills": [
        "User Experience Design (UED)",
        "Content Strategy",
        "User Personas"
      ],
      "comments": null,
      "url": "https://www.linkedin.com/learning/ux-design-3-creating-personas",
      "certs": ["CertificateOfCompletion_UXDesign-3_CreatingPersonas_LI.pdf"]
    },
    {
      "index": 118,
      "title": "UX Design: 2 Analyzing User Data",
      "instructor": "Chris Nodder",
      "date_completed": "2021-12-06",
      "date": [
        {
          "$date": "2021-12-06T19:19:00.000Z"
        }
      ],
      "synopsis": "Who are your users? What are their challenges? How can your design solve their needs? UX research can help you answer these questions, and many more. In this installment of \"UX Design Techniques,\" Chris Nodder walks through the process of acquiring user data and transforming that data into actionable project ideas. Learn how to observe users interacting with a prototype or simply performing tasks, build experience maps that depict those interactions, analyze the data, and extract ideas for new products and features.",
      "objectives": [
        "Getting data to analyze",
        "Observing users",
        "Building an experience map",
        "Setting goals",
        "Developing metrics"
      ],
      "skills": [
        "User Experience Design (UED)",
        "Interaction Design",
        "User Analysis"
      ],
      "comments": null,
      "url": "https://www.linkedin.com/learning/ux-design-2-analyzing-user-data",
      "certs": ["CertificateOfCompletion_UXDesign-2_AnalyzingUserData_LI.pdf"]
    },
    {
      "index": 117,
      "title": "UX Design: 1 Overview",
      "instructor": "Chris Nodder",
      "date_completed": "2021-12-04",
      "date": [
        {
          "$date": "2021-12-04T19:19:00.000Z"
        }
      ],
      "synopsis": "Following a user-centered design technique puts you more in touch with your users' true needs, which helps you develop solutions that really work for your intended audience. The approaches described in this course help development teams pool their diverse perspectives and collaborate to understand how to turn thoughts, feelings, frustrations, and desires of users into the design for a product.  Join Chris Nodder as he provides a road map to his series, \"UX Design Techniques.\" Each technique in this series builds on the data and output from the previous techniques. The user data from observations is used to identify user pain points and create personas. The pain points and personas are used during the ideation phase to create multiple possible solutions. Scenarios and storyboards take these multiple possible solutions and narrow them down to a working set, from which you build a paper prototype that you can usability test with some more representative users. At any point, you can follow the trail all the way back to data you gathered from your initial observations.",
      "objectives": [
        "Understanding the benefits of user-centered design",
        "Following the data trail",
        "Getting your team on board",
        "Analyzing user data",
        "Creating personas",
        "Understanding ideation",
        "Working with scenarios and storyboards",
        "Creating paper prototypes",
        "Building products with user-centered design"
      ],
      "skills": ["User Experience Design (UED)", "Interaction Design"],
      "comments": null,
      "url": "https://www.linkedin.com/learning/ux-design-1-overview-2",
      "certs": ["CertificateOfCompletion_UXDesign-1_Overview_LI.pdf"]
    },
    {
      "index": 116,
      "title": "Python Object-Oriented Programming",
      "instructor": "Joe Marini",
      "date_completed": "2021-12-03",
      "date": [
        {
          "$date": "2021-12-03T19:19:00.000Z"
        }
      ],
      "synopsis": "The object-oriented programming (OOP) features in Python make it easier to build programs of increasing complexity and modularity. In this course, you can learn how to apply core OOP principles like inheritance and composition along with some Python-specific features like “magic” methods and data classes to build programs that are extensible and efficient. Begin by brushing up on some object-oriented basics, and then use Python features like magic methods to make your classes integrate tightly with the Python language and data classes to dramatically reduce the amount of boilerplate code needed to build data-centric objects.",
      "objectives": [
        "Defining classes",
        "Checking instance types",
        "Using multiple inheritance",
        "Creating objects with composition",
        "Leveraging magic methods",
        "Calling objects like functions",
        "Defining data classes",
        "Creating immutable data classes"
      ],
      "skills": [
        "Python (Programming Language)",
        "Object-Oriented Programming (OOP)"
      ],
      "comments": null,
      "url": "https://www.linkedin.com/learning/python-object-oriented-programming",
      "certs": [
        "CertificateOfCompletion_PythonObject-OrientedProgramming_LI.pdf"
      ]
    },
    {
      "index": 115,
      "title": "Java Object-Oriented Programming",
      "instructor": "Kathryn Hodge",
      "date_completed": "2021-11-27",
      "date": [
        {
          "$date": "2021-11-27T19:19:00.000Z"
        }
      ],
      "synopsis": "Are you familiar with Java but want to get the most out of your Java programs? In this course, Kathryn Hodge teaches the basics of object-oriented programming in Java, so you can write code that’s secure, scalable, and easier to troubleshoot. Kathryn begins by showing how object-oriented principles are embedded into the Java language from the first code file you create. She looks at how classes, instances, and constructors embody the idea of representing real-life objects in code. Kathryn not only shows how to apply object-oriented principles in your own programs, but also explains how Java leverages these principles behind the scenes. While many resources about object-oriented programming focus on abstract examples, the goal of this course is to get away from the abstract and focus more on practical examples of these principles in Java. Along with deep dives into the source code, this course also provides several challenges and solutions to help you apply what you’ve learned.",
      "objectives": null,
      "skills": ["Object-Oriented Programming (OOP)", "Java"],
      "comments": "I wanted a refresher on OOP with Java. I have more experience with OOP in C++, which unlike Java, allows for multiple inheritance.<br />We used the IntelliJ IDEA, and studied classes/objects, encapsulation and inheritance.<br />This course has a very good chapter on polymorphism, where we coded several examples, including both run-time and compile-time polymorphism.<br />There is also a very good chapter on abstraction, using interfaces, and abstract classes.<br />We also explored Java's own source code, to see how Java uses object-oriented programming behind the scenes. <br />Each chapter ends with a challenge/solution, demonstrating/implementing the concepts above.",
      "url": "https://www.linkedin.com/learning/java-object-oriented-programming-2",
      "certs": ["CertificateOfCompletion_JavaObject-OrientedProgramming_LI.pdf"]
    },
    {
      "index": 114,
      "title": "Introducing Maven",
      "instructor": "Frank P Moley III",
      "date_completed": "2021-11-22",
      "date": [
        {
          "$date": "2021-11-22T19:19:00.000Z"
        }
      ],
      "synopsis": "Apache Maven is a powerful build system used by thousands of Java developers on enterprise, freelance, and open-source projects. But it can do so much more. This course focuses on the basics of using Maven for dependency management, builds, and reporting. Instructor Frank Moley starts with the foundations: the project object model (POM) and POM elements, including properties and dependencies. He then reviews the build life cycle, showing how to leverage the Core and Tools plugins to automate tasks like cleanup and compile. He also shows how to manage dependencies, including creating uber JAR files to package executables with their dependencies. Finally, he covers reporting with Maven sites and popular plugins. By the end of the course, you should be familiar enough with Maven to use it to meet the needs of almost any Java project, from simple components to unique customized builds.",
      "objectives": [
        "Exploring POM files",
        "The build life cycle",
        "Using build plugins",
        "Dependency management with Maven",
        "Maven reporting",
        "Working with Maven sites"
      ],
      "skills": ["Maven"],
      "comments": "I'd used Maven in Java projects in other courses I've taken here, but those were already-created projects, and although I did notice the project structure, I wasn't aware that it was a Maven thing, per se.<br />I was taking another course here where we created a Java/Maven project in the Eclipse IDE. We were led to making/modifying entries in the project's pom.xml file. Due to the age of that course, along with the differences between the versions used when the course was created and current versions, I ran into some issues matching up compatible versions/settings to use in the pom.xml file.<br />So I hoped that this course would help me figure out how to properly configure the pom.xml file used in the other course. It looks like it may do that, and I will try that now that I've learned some things in this course.<br /><br />In this course, we did not create the Java/Maven project(s) from scratch, but (again) used/modified already-created projects. We did, however, learn about the various sections in the pom.xml file(s).<br />We used the IntelliJ IDEA here, and some student feedback in the other course I started mentioned that they had resorted to using IntelliJ instead of Eclipse, because the configuration was more straightforward. So I may find myself also resorting to using IntelliJ instead of Eclipse to finish that course.",
      "url": "https://www.linkedin.com/learning/introducing-maven",
      "certs": ["CertificateOfCompletion_IntroducingMaven_LI.pdf"]
    },
    {
      "index": 113,
      "title": "Customer Success Management Fundamentals",
      "instructor": "PracticalCSM — Rick Adams",
      "date_completed": "2021-11-21",
      "date": [
        {
          "$date": "2021-11-21T19:19:00.000Z"
        }
      ],
      "synopsis": "New to customer success management (CSM)? This course can help you get up to speed with the fundamentals. This course address what CSM is and why it's important; what types of situations CSM applies to; and how CSM can help increase a company’s sales revenues and profitability. The course then reviews the 14 tenets (or guiding principles) of customer success. Collectively, these tenets outline the role of the CSM in ensuring that customer success occurs and that its benefits are realized by both the CSM's own company and its customers. This course can be taken on its own as an introduction to the topic, or as one in a series of courses from PracticalCSM.com that build upon each other to cover the entirety of CSM best practices in greater detail.",
      "objectives": null,
      "skills": ["Customer Service Management", "Customer Success"],
      "comments": null,
      "url": "https://www.linkedin.com/learning/customer-success-management-fundamentals",
      "certs": [
        "CertificateOfCompletion_CustomerSuccessManagementFundamentals_LI.pdf"
      ]
    },
    {
      "index": 112,
      "title": "CSS: Display",
      "instructor": "Jen Kramer",
      "date_completed": "2021-11-13",
      "date": [
        {
          "$date": "2021-11-13T19:19:00.000Z"
        }
      ],
      "synopsis": "Every CSS layout relies on the display property to tell it basic rules for how to present content. In this course, instructor Jen Kramer explains why the display property is so important and walks you through basic display values and newer display values that you need to understand to make effective use of this property. Jen discusses inline-level elements and the inline display value. She covers block-level elements, the block display value, and how to nest inline and block elements in HTML. Jen describes how to use “display: none” and “visibility: hidden” to hide content. Then she goes into newer display values, such as inline flex and grid values, the flow-root property, inline-block, tables, and list items. Jen concludes with recommendations on further HTM and CSS learning.",
      "objectives": null,
      "skills": [
        "Markup Languages",
        "Cascading Style Sheets (CSS)",
        "Web Design"
      ],
      "comments": "Even more CSS training...<br />This turned out to be a good companion course to the <i>Making Sense of the CSS Box Model</i> course here that I completed before this one.<br />In this course, we used the <a href=\"https://codepen.io\" target=\"_blank\">CodePen</a> site, where you can supply/modify HTML and CSS (and JavaScript, which we didn't use) and quickly see the results.",
      "url": "https://www.linkedin.com/learning/css-display",
      "certs": ["CertificateOfCompletion_CSS-Display_LI.pdf"]
    },
    {
      "index": 111,
      "title": "Making Sense of the CSS Box Model",
      "instructor": "Morten Rand-Hendriksen",
      "date_completed": "2021-11-11",
      "date": [
        {
          "$date": "2021-11-11T19:19:00.000Z"
        }
      ],
      "synopsis": "Based on old-school typography blocks, the CSS box model is the key to modern web design. Once you master it, you can build any layout you want—and troubleshoot most of the common CSS alignment and positioning woes. In this course, Morten Rand-Hendriksen offers a \"four course meal\" approach to the CSS box model, breaking it down into easily digestible chunks. He covers techniques such as styling text and images, floating content, using display properties, and positioning elements. He also explores the brave new world of modern layout modules, discussing Float, Flex, and Grid and how they can work together. Each lesson is supported by real-world demonstrations of the concepts in action, and Morten closes with a \"nightcap\" that will get you thinking about going further with CSS.",
      "objectives": [
        "Designing with boxes",
        "The origin of the box in typography",
        "What is the CSS box model?",
        "Changing the contents within the box",
        "Floating and clearing content",
        "Using the clearfix",
        "Working with Float, Flex, and Grid",
        "CSS shapes"
      ],
      "skills": ["Cascading Style Sheets (CSS)", "Web Design"],
      "comments": "More CSS training...",
      "url": "https://www.linkedin.com/learning/making-sense-of-the-css-box-model-2",
      "certs": ["CertificateOfCompletion_MakingSenseOfTheCSSBoxModel_LI.pdf"]
    },
    {
      "index": 110,
      "title": "Customer Service: Managing Customer Expectations",
      "instructor": "Jeff Toister",
      "date_completed": "2021-11-08",
      "date": [
        {
          "$date": "2021-11-08T19:19:00.000Z"
        }
      ],
      "synopsis": "Today's customers expect a lot. Customer service expert Jeff Toister helps frontline employees identify where they can manage the expectations of customers to avoid upsetting them down the line. Specifically, how to avoid situations where unreasonable expectations might develop, and how to choose the right language to educate customers and explain potential areas of confusion. Despite your best efforts, customers may still develop inappropriate expectations, so Jeff also suggests tactics to counteract this problem. Finally, he provides tips for implementing the lessons learned in this course into your everyday customer service routine.",
      "objectives": null,
      "skills": ["Expectations Management", "Customer Service"],
      "comments": null,
      "url": "https://www.linkedin.com/learning/customer-service-managing-customer-expectations",
      "certs": [
        "CertificateOfCompletion_CustomerService-ManagingCustomerExpectations_LI.pdf"
      ]
    },
    {
      "index": 109,
      "title": "Test Automation Foundations",
      "instructor": "Meaghan Lewis",
      "date_completed": "2021-11-05",
      "date": [
        {
          "$date": "2021-11-05T19:19:00.000Z"
        }
      ],
      "synopsis": "Automated testing relies on scripting and frameworks like Selenium to prove that products work as expected. Test automation is an enormous time-saver, and it's crucial to continuous integration, continuous delivery, and agile software development. If you're employed in QA, DevOps, and IT, you need to know the basics. This course covers the foundations of test automation, as well as different strategies for implementation. QA engineer Meaghan Lewis explains what kinds of tests to use, how to choose the right test tools, and how to plan and execute test automation projects. She also describes strategies to maintain automation over time: adding new tests, updating old tests, and resolving failures.",
      "objectives": [
        "The test pyramid",
        "Unit, integration, and UI tests",
        "Creating an automation strategy",
        "Choosing test tools",
        "Deciding what to automate",
        "Identifying the risks and cost of automation",
        "Implementing test automation",
        "Using continuous integration",
        "Measuring code coverage"
      ],
      "skills": ["Test Automation"],
      "comments": "A foundations course that covers some of the same things covered in other courses here by this instructor, such as testing quadrants, the test pyramid, test types (unit, integration, and UI).<br />There wasn't much coding in this course, but for what there was, we coded in Node.js using the Atom text editor, and stored product data in MongoDB.<br />We ran the unit and integration tests from the terminal, and the UI tests using Selenium. <br />We learned about some Frameworks and Assertion libraries. We also learned how to configure and use <i>Travis CI,</i> tied into GitHub repositories.<br />And we learned how to decide what to automate, and used the <i>Istanbul</i> code coverage tool.",
      "url": "https://www.linkedin.com/learning/test-automation-foundations",
      "certs": ["CertificateOfCompletion_TestAutomationFoundations_LI.pdf"]
    },
    {
      "index": 108,
      "title": "Software Testing Foundations: Continuous Testing and DevOps",
      "instructor": "Jain Waldrip",
      "date_completed": "2021-10-30",
      "date": [
        {
          "$date": "2021-10-30T19:19:00.000Z"
        }
      ],
      "synopsis": "The next step beyond agile testing and test automation is continuous testing. Continuous testing means having your test automation run regularly and give code changes the green light before moving on in the development process. It can speed up the development life cycle and contribute to more stable and reliable software deliveries. DevOps provides you with the infrastructure to start running your automation in a continuous integration pipeline—this course can provide you with the skills. Join instructor and developer Jain Waldrip to learn the essential concepts of continuous testing and what DevOps means for QA. Discover methods for running automated tests in a continuous integration pipeline and explore common tools you will encounter in the process of implementing continuous testing. Jain also provides tips for running tests in containers and generating reports from your test results.",
      "objectives": [
        "Continuous testing concepts",
        "Continuous integration solutions",
        "Making independent tests",
        "Types of continuous tests",
        "Running tests in containers",
        "Reporting solutions for test results"
      ],
      "skills": ["DevOps", "Software Testing", "Agile Testing"],
      "comments": null,
      "url": "https://www.linkedin.com/learning/software-testing-foundations-continuous-testing-and-devops",
      "certs": [
        "CertificateOfCompletion_SoftwareTestingFoundationsContinuousTestingAndDevOps_LI.pdf"
      ]
    },
    {
      "index": 107,
      "title": "Selenium Essential Training",
      "instructor": "Meaghan Lewis",
      "date_completed": "2021-10-28",
      "date": [
        {
          "$date": "2021-10-28T19:19:00.000Z"
        }
      ],
      "synopsis": "Take your Selenium framework skills to the next level. In this course, Meaghan Lewis takes you past the basics covered in Learning Selenium, on to intermediate and advanced options. First, Meaghan reviews the fundamentals and shows you how to get the most out of WebDriver. Next, she takes you into the mechanics of advanced locators and interacting with components. Then she shares how to overcome common synchronization issues. She wraps up by covering workflows and integrations.",
      "objectives": [
        "Using browser drivers and WebDriver",
        "Inspecting elements",
        "Executing JavaScript commands",
        "Selecting a locator",
        "Combining multiple CSS attributes",
        "Using common components",
        "Implicit and explicit waits",
        "Automating workflows",
        "Testing behaviors",
        "Using page objects",
        "Connecting to GitHub",
        "Running on the grid",
        "Using cloud-based testing tools"
      ],
      "skills": ["Selenium WebDriver", "Selenium"],
      "comments": "This is a longer companion/follow-up course expanding on this instructor's <i>Learning Selenium</i> course here.<br />We coded in Java (instead of in Ruby) this time, using the IntelliJ IDEA, and we installed and used ChromeDriver, instead of GeckoDriver, which we used for Firefox in the prior course.<br />We created tests against pages at <a href=\"https://formy-project.herokuapp.com/\" target=\"_blank\">FORMY</a>.<br />As in the prior course, we progressed from coding a series of statements for testing a Web page app, to cleaning up the code by extracting those statements into functions, then broke those functions out into Java Classes, to conform to the Page Object Pattern.<br />We then created a Git Repository locally, and remotely on GitHub, then pushed our code to GitHub.<br />The instructor finished up by introducing us to various CI (Continuous Integration) servers, and the Sauce Labs cloud-based testing tool.",
      "url": "https://www.linkedin.com/learning/selenium-essential-training",
      "certs": ["CertificateOfCompletion_SeleniumEssentialTraining_LI.pdf"]
    },
    {
      "index": 106,
      "title": "Docker on AWS",
      "instructor": "Robert Starmer",
      "date_completed": "2021-10-21",
      "date": [
        {
          "$date": "2021-10-21T19:19:00.000Z"
        }
      ],
      "synopsis": "Docker is the next step beyond virtualization. When deployed with Amazon Elastic Container Service (AWS ECS), you have a solid foundation for monitoring and managing Docker containers, including starting containers and scheduling tasks. This frees up developers to concentrate on your container-based applications—instead of your hosting platform. In this course, Robert Starmer demonstrates how to use Docker and the powerful features in AWS to build and manage container-based applications. Learn how to create containerized applications, set up AWS ECS, mange container scale and network models, troubleshoot issues, and more.",
      "objectives": [
        "Creating an Elastic Container Registry (ECR)",
        "Automatically building new containers",
        "Fargate vs. EC2 for containers",
        "Configuring ECS for EC2 and Fargate",
        "Deploying an app into ECS",
        "Managing container scale",
        "Adding an ECS service and task",
        "Networking and storage",
        "ECS metrics"
      ],
      "skills": [
        "Amazon Web Services (AWS)",
        "Cloud Development",
        "Software Deployment",
        "Docker Products"
      ],
      "comments": null,
      "url": "https://www.linkedin.com/learning/docker-on-aws",
      "certs": ["CertificateOfCompletion_DockerOnAWS_LI.pdf"]
    },
    {
      "index": 105,
      "title": "Learning NuGet",
      "instructor": "Microsoft .NET and Christopher Gill",
      "date_completed": "2021-10-16",
      "date": [
        {
          "$date": "2021-10-16T19:19:00.000Z"
        }
      ],
      "synopsis": "This course is an introduction to NuGet, the official package manager for .NET. Packages are essentially compiled libraries packed together with descriptive metadata into an easily shareable unit, meaning NuGet lets developers leverage a massive ecosystem and utilize existing solutions as a foundation instead of building everything from scratch.  Instructor Christopher Gill covers NuGet essentials like package management, the tools and resources NuGet provides, and how to use those tools to leverage and contribute to the extensive .NET ecosystem. He also covers the ins and outs of NuGet.org, the central repository for .NET developers to find and publish .NET packages.",
      "objectives": null,
      "skills": ["NuGet", ".NET Framework"],
      "comments": "I'd had to research and then use NuGet to get things working in Visual Studio for the <i>ASP.NET Web Forms Essential Training</i> course I took here. This course provided a good overall view on what NuGet is all about.<br /><br />We covered installing and using a NuGet package with Visual Studio, and with the .NET CLI, after using Visual Studio Code for the coding.<br />We also created and published a NuGet package to <a href=\"https://www.nuget.org/\" target=\"_blank\">nuget.org</a> with Visual Studio, and with the .NET CLI, after using Visual Studio Code for the coding. ",
      "url": "https://www.linkedin.com/learning/learning-nuget",
      "certs": ["CertificateOfCompletion_LearningNuGet_LI.pdf"]
    },
    {
      "index": 104,
      "title": "AWS Security Best Practices for Developers",
      "instructor": "Carlos Rivas",
      "date_completed": "2021-10-14",
      "date": [
        {
          "$date": "2021-10-14T19:19:00.000Z"
        }
      ],
      "synopsis": "Security matters to everyone, but solid security practices start with the developer of an application. In this developer-centered course, instructor and AWS Certified Solutions Architect Carlos Rivas shows how to build stronger, more secure applications for deployment on Amazon Web Services. Learn core AWS security development principles around Identity and Access Management (IAM), S3 storage, and Key Management Service (KMS), to ensure your users, systems, and data are secure on the cloud. Plus, learn how to use Cognito to establish user identity without maintaining unique login credentials for each application.",
      "objectives": [
        "Identity and Access Management security",
        "S3 security policies, encryption, and version control",
        "KMS encryption",
        "User authentication with Cognito"
      ],
      "skills": [
        "Cloud Security",
        "Cloud Computing",
        "Amazon Web Services (AWS)"
      ],
      "comments": null,
      "url": "https://www.linkedin.com/learning/aws-security-best-practices-for-developers",
      "certs": [
        "CertificateOfCompletion_AWSSecurityBestPracticesForDevelopers_LI.pdf"
      ]
    },
    {
      "index": 103,
      "title": "Learning Selenium",
      "instructor": "Meaghan Lewis",
      "date_completed": "2021-10-09",
      "date": [
        {
          "$date": "2021-10-09T19:19:00.000Z"
        }
      ],
      "synopsis": "Selenium is one of the most popular tools for testing web-based applications. It allows QA engineers to write and automate tests across many different browsers and operating systems, without a special scripting language. This course introduces Selenium to new users, covering installation and basic use cases. Find out how to set up the test-writing framework, WebDriver, and Selenium Grid, which allows you to distribute the testing load and run tests against a remote server. Learn best practices to write effective tests using variables and functions, and to organize tests into suites that can scale over time. Instructor Meaghan Lewis—a QA engineer at GitHub—also explains the test pyramid paradigm, which details an ideal way to balance unit, integration, and UI testing.",
      "objectives": [
        "Setting up Selenium WebDriver",
        "Distributing the testing load with Selenium grid",
        "Setting up a hub and nodes",
        "Writing clean test code",
        "Organizing a test suite"
      ],
      "skills": ["Selenium"],
      "comments": "A good starting course about using Selenium for automating testing on Web page apps &mdash;<br />We installed and used Ruby to code the tests, using the Sublime Text text editor. It was good for me to get some more Ruby practice.<br />We installed the Selenium WebDriver and the <i>RSpec</i> Ruby Gem.<br />We also installed and used Selenium Grid, setting up the hub and configuring nodes, to distribute and run tests against remote browser instances.<br />And we learned about the Page Object Pattern, creating classes for each page of a Web page app.",
      "url": "https://www.linkedin.com/learning/learning-selenium",
      "certs": ["CertificateOfCompletion_LearningSelenium_LI.pdf"]
    },
    {
      "index": 102,
      "title": "Programming Foundations: Software Testing/QA",
      "instructor": "Meaghan Lewis",
      "date_completed": "2021-10-06",
      "date": [
        {
          "$date": "2021-10-06T19:19:00.000Z"
        }
      ],
      "synopsis": "Quality assurance (QA) engineering can mean many different things to different people. In this course, learn about QA practices within the context of a software engineering project. Instructor Meaghan Lewis demonstrates the different kinds of testing QA focuses on and how QA fits into the software development life cycle (SDLC). Meaghan explores the areas you'll likely want to test and continuously monitor to ensure increasing improvements to your product. Plus, she goes over some of the mechanisms used to communicate the overall health of a product. Upon wrapping up this course, you'll be able to look at whatever you're working on, think critically about how the pieces fit together, and identify ways to help your team meet quality goals with every release.",
      "objectives": [
        "How QA fits into the software development life cycle (SDLC)",
        "Setting expectations and goals",
        "Making a test plan",
        "Incorporating box testing into your process",
        "Executing manual testing",
        "Leveraging UI automation testing",
        "Identifying, reporting, and prioritizing bugs"
      ],
      "skills": ["Software Quality Assurance"],
      "comments": null,
      "url": "https://www.linkedin.com/learning/programming-foundations-software-testing-qa",
      "certs": [
        "CertificateOfCompletion_ProgrammingFoundations-SoftwareTesting_QA_LI.pdf"
      ]
    },
    {
      "index": 101,
      "title": "Improve Cognitive Flexibility at Work",
      "instructor": "Andrea Bonior",
      "date_completed": "2021-10-05",
      "date": [
        {
          "$date": "2021-10-05T19:19:00.000Z"
        }
      ],
      "synopsis": "The ability to switch mental gears quickly and efficiently isn't just a boon for workers needing to pivot after a setback. This facility—also known as cognitive flexibility—is critical to everyone’s mental and physical health. Employees of all stripes need the ability to pivot, adapt, and challenge their automatic assumptions in order to increase their adaptability, resilience, and creativity. In this course, clinical psychologist and best-selling author Andrea Bonior teaches science-backed techniques for improving cognitive flexibility. Discover how to build daily mental habits to increase adaptability and clear-thinking, as well as practice incorporating innovation into your daily life. Tune in to nudge yourself beyond your comfort zone and learn how to build and maintain cognitive flexibility over the long term.",
      "objectives": null,
      "skills": ["Cognitive Flexibility"],
      "comments": "I saw that a former coworker, who frequently finds interesting, informative courses here, had taken this one.",
      "url": "https://www.linkedin.com/learning/improve-cognitive-flexibility-at-work",
      "certs": [
        "CertificateOfCompletion_ImproveCognitiveFlexibilityAtWork_LI.pdf"
      ]
    },
    {
      "index": 100,
      "title": "Statistics Foundations: 2",
      "instructor": "Eddie Davila",
      "date_completed": "2021-10-04",
      "date": [
        {
          "$date": "2021-10-04T19:19:00.000Z"
        }
      ],
      "synopsis": "Statistics are a core skill for many careers. Basic stats are critical for making decisions, new discoveries, investments, and even predictions. But sometimes you need to move beyond the basics. Statistics Fundamentals – Part 2 takes business users and data science mavens into practical, example-based learning of the intermediate skills associated with statistics: samples and sampling, confidence intervals, and hypothesis testing.  Eddie Davila first provides a bridge from Part 1, reviewing introductory concepts such as data and probability, and then moves into the topics of sampling, random samples, sample sizes, sampling error and trustworthiness, the central unit theorem, t-distribution, confidence intervals (including explaining unexpected outcomes), and hypothesis testing. This course is a must for those working in data science, business, and business analytics—or anyone else who wants to go beyond means and medians and gain a deeper understanding of how statistics work in the real world.",
      "objectives": [
        "List the three primary issues addressed in Statistics Foundations: 2.",
        "Recognize two key characteristics associated with simple random samples.",
        "Apply the Central Limit Theorem to find the average of sample means.",
        "Analyze random samples during hypothesis testing.",
        "Assess individual situations to determine whether a one-tailed or two-tailed test is necessary.",
        "Define acceptance sampling."
      ],
      "skills": ["Statistics"],
      "comments": "Yet another one in my run of Statistics refresher courses here.<br />We covered sampling, sample size (and the effects it has), and confidence intervals.<br />And we finished up with a whole chapter on Hypothesis Testing, which was really good, since we did it repeatedly, which drilled the process in.",
      "url": "https://www.linkedin.com/learning/statistics-foundations-2",
      "certs": [
        "CertificateOfCompletion_StatisticsFoundations-2_LI.pdf",
        "CertificateOfCompletion_StatisticsFoundations-2_NASBA.pdf"
      ]
    },
    {
      "index": 99,
      "title": "Learning R",
      "instructor": "Barton Poulson",
      "date_completed": "2021-09-25",
      "date": [
        {
          "$date": "2021-09-25T19:19:00.000Z"
        }
      ],
      "synopsis": "If you want to participate in the data revolution, you need the right tools and skills. R is a free, open-source language for data science that is among the most popular platforms for professional analysts. Learn the basics of R and get started finding insights from your own data, in this course with professor and data scientist Barton Poulson. The lessons explain how to get started with R, including installing R, RStudio, and code packages that extend R’s power. You also see first-hand how to use R and RStudio for beginner-level data modeling, visualization, and statistical analysis. By the end of the course, you’ll have a thorough introduction to the power and flexibility of R, and understand how to leverage this tool to explore and analyze a wide variety of data.",
      "objectives": [
        "Installing R and RStudio",
        "Navigating the RStudio environment",
        "Importing data from a spreadsheet",
        "Working with the tidyverse",
        "Piping commands with %>%",
        "Visualizing data with R base graphics and ggplot2",
        "Visualizing hierarchical clusters",
        "Selecting cases and subgroups",
        "Recoding variables",
        "Calculating frequencies",
        "Calculating descriptives",
        "Calculating correlations",
        "Computing a linear regression"
      ],
      "skills": ["R (Programming Language)"],
      "comments": "A good companion starting course to the <i>R Programming in Data Science: Setup and Start</i> course I took earlier here for R.<br />We got into the language a bit more than in that prior course, but we didn't get into loops, conditionals, etc., mainly just using statements for manipulating/processing dataframes.<br />The instructor gave us a tour of RStudio (which we used throughout the course), including some of the settings.<br />We used the <i>pacman</i> package manager package to load and unload packages, and as in the earlier course, we also used the <i>tidyverse</i> package, which among other things, provides the handy piping command.<br />We also covered data visualization, data wrangling, and data analysis.",
      "url": "https://www.linkedin.com/learning/learning-r-2",
      "certs": ["CertificateOfCompletion_LearningR_LI.pdf"]
    },
    {
      "index": 98,
      "title": "Learning Network Troubleshooting",
      "instructor": "Robert McMillen, MBA, MCT, MCSE",
      "date_completed": "2021-09-19",
      "date": [
        {
          "$date": "2021-09-19T19:19:00.000Z"
        }
      ],
      "synopsis": "Troubleshooting network issues is a key skill for a wide range of IT professionals and network professionals. In this course, instructor Robert McMillen teaches you the skills and tools that you need to start network troubleshooting. Robert begins with an overview on how to triage network problems, including basic TCP/IP issues and causes, then steps you through some common home networking and wireless issues. He covers the most common issues with corporate wireless networks and how to troubleshoot Wi-Fi interference. Robert explains different types of VPN, common errors you may encounter, and how to fix them. After showing you some network tools that administrators need to know, he discusses how to fix problems you may run into with routing, switching, and firewalls.",
      "objectives": null,
      "skills": ["Network Troubleshooting", "Network Administration"],
      "comments": "I wanted a refresher on using Wireshark and Fiddler, so I looked here for videos and/or courses on them.<br />I saw that there was a video on Wireshark in this course, and that the rest of this course would also be a good refresher for me, so I completed it.<br />I already knew a lot of it, but appreciated being reminded. And I hadn't much used the PowerShell cmdlets. It was nice that the instructor compared them to their command line counterparts, pointing out differences between them.<br />I also wasn't familiar with most of what we learned in the chapter on VPNs.<br />And the lesson/video on Wireshark was good - we used Nmap/Zenmap on the \"black hat\" computer to scan to the \"white hat\" computer, where we used Wireshark to peruse what was scanned. It was good to get refreshed on this, since it's been a while since I used it.<br />We used the Windows Defender Firewall in the <i>Troubleshooting open firewall ports</i> lesson, which was also a good refresher for me, since I'd more recently used the McAfee Firewall to control ports.",
      "url": "https://www.linkedin.com/learning/learning-network-troubleshooting-2021",
      "certs": ["CertificateOfCompletion_LearningNetworkTroubleshooting_LI.pdf"]
    },
    {
      "index": 97,
      "title": "R Programming in Data Science: Setup and Start",
      "instructor": "Mark Niemann-Ross",
      "date_completed": "2021-09-15",
      "date": [
        {
          "$date": "2021-09-15T19:19:00.000Z"
        }
      ],
      "synopsis": "R is powerful, but not intuitive. There is a strong and diverse R ecosystem, and data scientists are expected to mix and match from the different versions and packages. Before you can even begin programming, you have to choose, install, and set up R to work for you.  In this course, Mark Niemann-Ross provides a direct and efficient introduction to the many flavors of the R programming language, including base R, tidyverse R, R Open from Microsoft, and Bioconductor R. He also provides a peek at programming with R interactively and via the command line, and introduces some helpful packages for working with SQL, 3D graphics, data, and clusters in R. At the end of this short course, you will have installed a version of R along with a few core libraries and an optimized IDE.",
      "objectives": [
        "Explain why Base R is a unique programming language.",
        "Summarize how to install R for Macintosh, Windows, Linux, or Unix.",
        "Name the IDE that does not have support for R.",
        "Describe two ways to set up R Tools for Visual Studio.",
        "Identify the three ways R programs can be executed.",
        "List two functions that sqldf adds to Base R."
      ],
      "skills": ["Big Data", "R (Programming Language)", "RStudio"],
      "comments": "This is a good starting course for R, as it covers different versions/flavors of R - what is unique about that version, installing/using it, and what IDE is recommended for that version.<br />We mainly used the RStudio IDE, with the main exception being using Visual Studio for Microsoft Open R. We also used R Tools for Visual Studio, but since Microsoft changed how R is implemented in VS 2019, I had problems opening the provided Solution/Project files, and ended up just opening the R source code files themselves.<br />We covered the same task in the different versions, to see how the coding differed between them, and also a task that was optimal for each particular version.<br />We covered using R interactively, and from the command line, with arguments, and finished up with common R packages:<br />* sqldf<br />* rgl &mdash; for 3D plots - interactive, and with animations!<br />* data.table &mdash; streamlined syntax<br />* cluster",
      "url": "https://www.linkedin.com/learning/r-programming-in-data-science-setup-and-start",
      "certs": [
        "CertificateOfCompletion_RProgrammingInDataScience-SetupAndStart_LI.pdf",
        "CertificateOfCompletion_RProgrammingInDataScience-SetupAndStart_NASBA.pdf"
      ]
    },
    {
      "index": 96,
      "title": "Statistics Foundations: Probability",
      "instructor": "Eddie Davila",
      "date_completed": "2021-09-07",
      "date": [
        {
          "$date": "2021-09-07T19:19:00.000Z"
        }
      ],
      "synopsis": "Not sure if you need statistics? Think again! Statistics help with making decisions, new discoveries, investments, and predictions. For subjects ranging from political races to healthcare advancements, statistics can improve your understanding of your favorite topic. In this course, Professor Eddie Davila teaches common terms, formulas, and techniques related to probability, the area of statistics where this course focuses.  Eddie explains that probability is used to make decisions about future outcomes and to understand past outcomes. He covers permutations, combinations, and percentiles, and goes into how to describe and calculate them. Eddie introduces multiple event probabilities and discusses when to add and subtract probabilities. He describes probability trees, Bayes’ Theorem, binomials, and so much more. You can learn to understand your data, prove theories, and save valuable resources—all by understanding the numbers.",
      "objectives": null,
      "skills": ["Statistics", "Probability"],
      "comments": "Another one in my run of Statistics refresher courses here.<br />This was a good course for me - the Chapter Quizzes made me calculate, and...think!<br />We covered permutations and combinations, for determining possible outcomes.<br />We also covered Probability Trees, for multiple events, and Bayes Theorem (for doing away with drawing the trees).<br />When discussing normal and bell-shaped curves, we stopped short of using Calculus to calculate the area under a curve, as of course we did in my Statistics course at CSUF, but were still able to estimate for ranges.",
      "url": "https://www.linkedin.com/learning/statistics-foundations-probability",
      "certs": [
        "CertificateOfCompletion_StatisticsFoundations-Probability_LI.pdf"
      ]
    },
    {
      "index": 95,
      "title": "Customer Service Foundations",
      "instructor": "Jeff Toister",
      "date_completed": "2021-09-07",
      "date": [
        {
          "$date": "2021-09-07T19:19:00.000Z"
        }
      ],
      "synopsis": "Do your customers feel valued? When they do, they keep coming back. When they don't, your business suffers. In this course, writer and customer service consultant Jeff Toister teaches you the three crucial skill sets needed to deliver outstanding customer service and increase customer loyalty. Learn how to build winning relationships, provide the right assistance at the right times, and effectively handle angry customers. He also shares ways to find out what your customers really think about your service, and use their feedback to improve.",
      "objectives": [
        "Explore how you can use customer surveys to build rapport.",
        "Name three ways you can use active listening to serve your customers more effectively.",
        "Identify the different types of needs that must be addressed in order to solve problems.",
        "Explain the benefits of taking ownership of a problem.",
        "Define “preemptive acknowledgment” and recognize its impact on customer service.",
        "List three types of attitude anchors and explain their differences."
      ],
      "skills": ["Customer Loyalty", "Customer Service"],
      "comments": "I saw that multiple former co-workers had taken this course. That made me think that maybe it was evaluation-time there. ;^) Or that their manager had directed them to take this course. (Or both/neither?)<BR />This course would be great for someone starting out in Customer Service, but is also good for those with plenty of experience. This excellent instructor, who has several great courses on Customer Service here on LinkedIn Learning, provides good tips and techniques, which can also serve as good reminders for even those experienced with Customer Service.",
      "url": "https://www.linkedin.com/learning/customer-service-foundations-2018",
      "certs": [
        "CertificateOfCompletion_CustomerServiceFoundations_LI.pdf",
        "CertificateOfCompletion_CustomerServiceFoundations_NASBA.pdf",
        "CertificateOfCompletion_CustomerServiceFoundations_PMI.pdf"
      ]
    },
    {
      "index": 94,
      "title": "Statistics Foundations: The Basics",
      "instructor": "Eddie Davila",
      "date_completed": "2021-09-01",
      "date": [
        {
          "$date": "2021-09-01T19:19:00.000Z"
        }
      ],
      "synopsis": "Statistics is not just the realm of data scientists. All types of jobs use statistics. Statistics are important for making decisions, new discoveries, investments, and predictions. Whether the subject is political races, sports rankings, shopping trends, or healthcare advancements, statistics is an instrument for understanding your favorite topic at a deeper level. In this course, Professor Eddie Davila offers beginner-level lessons, so you too can master the terms, formulas, and techniques needed to perform the most common types of statistics.  Eddie covers several examples of data and charts. He explains how to find the middle of your data set, as well as the mean and median. He introduces range, then goes into standard deviation and what to do with outliers. These techniques help you understand your data, prove theories, and save time, money, and other valuable resources—all by understanding the numbers.",
      "objectives": null,
      "skills": ["Statistics"],
      "comments": "It's been years since my Statistics course at CSU Fullerton, where I had an excellent professor (Dr. Hromodka).<br />So I thought that I could use some refresher Statistics courses from here at LinkedIn Learning, of which this is my first.<br />I remembered most of the things covered, such as the mean, median, mode, range and standard deviation.<br />I didn't quite remember the Z-Score (I remembered what it was, but had forgotten the name) and the Empirical Rule (I recalled the gist of it, but not the specifics).",
      "url": "https://www.linkedin.com/learning/statistics-foundations-the-basics",
      "certs": [
        "CertificateOfCompletion_StatisticsFoundations-TheBasics_LI.pdf"
      ]
    },
    {
      "index": 93,
      "title": "Learning Amazon Web Services Lambda",
      "instructor": "Marcia Villalba",
      "date_completed": "2021-08-31",
      "date": [
        {
          "$date": "2021-08-31T19:19:00.000Z"
        }
      ],
      "synopsis": "Ready to go serverless? Learn the essentials of working with AWS Lambda, a compute service that handles administration for you, so you're only responsible for your code. In this course, Marcia Villalba helps beginners get up and running with Lambda. To begin, she explains the basics of securing an AWS account and creating IAM users. From there, she moves on to the main concepts of the Lambda programming model and shows how to create Lambda functions and add API Gateway as a trigger. She steps through how to do everything from the AWS console to solidify your baseline knowledge before showing how to create lambda functions with the AWS Serverless Application Framework (SAM), which uses the paradigm of infrastructure as code—the recommended way to develop serverless applications.",
      "objectives": [
        "Creating IAM users",
        "The Lambda programming model",
        "Creating AWS Lambda functions",
        "Popular triggers for AWS Lambda",
        "Add API Gateway as a trigger to Lambda",
        "Testing functions with Postman",
        "Creating Lambda functions with SAM",
        "Deploying your application"
      ],
      "skills": [
        "Amazon Web Services (AWS)",
        "Cloud Development",
        "AWS Lambda"
      ],
      "comments": "An excellent course!<br />I've used AWS Lambda in other courses here, but this is a course dedicated to that (although we did use API Gateway, and other AWS services as well).<br />We used IAM, creating a non-Root user with Admin privileges to use in this course.<br />We created a Lambda function (using Node.js) with an API Gateway Trigger, and used Postman for testing the API.<br />We learned about \"infrastructure as code,\" and then then we installed the AWS Serverless Application Model (SAM) Framework and the SAM CLI, using it to package another application (another Lambda function with an API Gateway) with CloudFormation, and then deploy it.<br />We then added another Lambda function with an API Gateway to that app, and redeployed it to the same S3 bucket where it resided, using the SAM CLI.<br />Repeating this process a few times helped to drill it in for me.",
      "url": "https://www.linkedin.com/learning/learning-amazon-web-services-lambda-2",
      "certs": [
        "CertificateOfCompletion_LearningAmazonWebServicesLambda_LI.pdf"
      ]
    },
    {
      "index": 92,
      "title": "Customer Service: Serving Customers Through Chat and Text",
      "instructor": "Leslie O'Flahavan",
      "date_completed": "2021-08-27",
      "date": [
        {
          "$date": "2021-08-27T19:19:00.000Z"
        }
      ],
      "synopsis": "Customers are demanding more ways to connect with companies when they need help. Live chat and text are the fastest growing and most popular channels. While you may be a pro at writing emails, you need a whole new set of skills to handle live, rapid-fire chat and text conversations. You’ll need to be able to handle multiple conversations at one time, and may even be required to sell or recommend products. This course walks through each of these situations, and more, using real-world chats and texts. Instructor Leslie O’Flahavan also explains how to incorporate templates and empathy statements and add your own authentic spin—all while maintaining your company’s brand. Learn all the writing skills you’ll need to provide top-notch live chat and text customer service.",
      "objectives": [
        "Asking questions that solve problems",
        "Switching channels with ease",
        "Handling delays",
        "Managing your response length",
        "Blending templates and free text",
        "Writing in your company’s brand voice",
        "Pushing content that boosts sales"
      ],
      "skills": ["Customer Service Systems"],
      "comments": "While composing hypothetical Support responses for an assessment that I was taking while looking for a new position, I may have tended too much towards an email style, instead of the chat/text style that was expected(?). (It was a bit hard to tell from the given scenarios, because the questions just used the word \"message.\"  And since I was also expected to base my replies on the company's documentation, it seemed that shorter replies (as expected in a chat/text channel), would not have demonstrated that. It was a bit confusing. (Suffice it to say - I did not advance to the next step...)<br />I hadn't used chat/text in a Support role (except with internal customers), so I thought that I should get up to speed.<br />So now, if it's clear that I'm in a chat/text situation, I am better prepared.<br /><br />This instructor provided good advice, and as a side-effect, also taught me how to better uphold my end of the chat/text when I'M the one seeking assistance.",
      "url": "https://www.linkedin.com/learning/customer-service-serving-customers-through-chat-and-text",
      "certs": [
        "CertificateOfCompletion_CustomerServiceServingCustomersThroughChatAndText_LI.pdf"
      ]
    },
    {
      "index": 91,
      "title": "Vue.js for Web Designers",
      "instructor": "Joe Chellman",
      "date_completed": "2021-08-23",
      "date": [
        {
          "$date": "2021-08-23T19:19:00.000Z"
        }
      ],
      "synopsis": "Vue.js is a popular JavaScript framework that can be used to build interactive components or entire single-page apps. It's a powerful and flexible framework for the modern web designer—whether you use a little of it or a lot. In this course, Joe Chellman offers practical ways to incorporate Vue.js in real-world web designs. He introduces three small projects that benefit from Vue: a real-time updating product customizer that shows how to manage data and respond to events with Vue; an employee directory using Vue forms and animation; and a status board that makes external API calls and uses a third-party Vue component. Each project demonstrates what makes Vue most interesting and useful to web designers and provides solutions for dealing with the few unique challenges.",
      "objectives": [
        "Installing Vue.js and Vue devtools",
        "Creating interactive components",
        "Adding data to components",
        "Listening for events",
        "Scaffolding components",
        "Building and wiring forms",
        "Animating transitions",
        "Incorporating live data via REST APIs",
        "Adding third-party Vue components"
      ],
      "skills": ["Vue.js", "JavaScript"],
      "comments": "We installed the Vue.js devtools extension in Chrome and Firefox, and I also installed a beta extension for Edge.<br />We then worked on 3 projects:<br />- Customizer, for sneaker shopping - select a size and a color, and the sneaker image changes color and size.<br />- Directory Browser, for browsing and searching a personnel directory, with live search and filtering.<br />and<br />- Status Updater, for posting various types of update messages to a hotel's Web site.<br />This project used MySQL via a PHP Web site, and Axios, a promise-based HTTP Client.<br />We finished up by adding a third-party Vue component (vue-simple-spinner).<br /><br />Now that I've taken first courses on 3 popular JavaScript frameworks (React, Angular, and now Vue) and liked working with all of them, I can go forth and take follow-up courses. I'm hoping that another Angular course will help me with my modifications to the Media Watch List app that we did in the <i>Angular Essential Training</i> course here, that I'm adding to for my own use.<br />I've also started modifying the Directory Browser app from this course, for another presentation of my LinkedIn Learning courses data.",
      "url": "https://www.linkedin.com/learning/vue-js-for-web-designers",
      "certs": ["CertificateOfCompletion_Vue.jsForWebDesigners_LI.pdf"]
    },
    {
      "index": 90,
      "title": "Software Design: Modeling with UML",
      "instructor": "Neelam Dwivedi",
      "date_completed": "2021-08-21",
      "date": [
        {
          "$date": "2021-08-21T19:19:00.000Z"
        }
      ],
      "synopsis": "Modeling with the Unified Modeling Language (UML)—a visual design language for object-oriented programming—is a critical skill for all team members in a software development project. These models are a cost-effective way for collaborators to analyze, communicate, and document their product's characteristics. In this course, learn how to use UML diagrams to create important artifacts at each stage of the software development life cycle. Instructor Neelam Dwivedi shares best practices and tools as she goes over 13 different types of UML models, explaining what you need to know to develop static and dynamic models of software systems.",
      "objectives": [
        "How UML differs from other modeling techniques",
        "Types of UML models",
        "UML modeling tools",
        "Use case, activity, and class diagrams",
        "Capturing real-time state of your system in action",
        "Using component diagrams",
        "Interaction overview diagrams",
        "Modeling time-constrained interactions"
      ],
      "skills": ["Unified Modeling Language (UML)", "Object Oriented Design"],
      "comments": "I saw a job posting that mentioned UML, so thought that I should learn about it...<br />The instructor covered 13 types of UML models, their key components and the notations.<br />I've used Visio, but since I don't have it now, I downloaded the PlantUML.jar file, and installed Graphviz, setting its Environment Variable, so that I could use PlantUML (a tool for creating diagrams from a plain text language) from the Command Line, as well as from MS Word.<br />I added a PlantUML Word Add-In Template file, placing it and PlantUML.jar in the Word STARTUP folder.<br />I also added a PlantUML Extension to VS Code.",
      "url": "https://www.linkedin.com/learning/software-design-modeling-with-uml",
      "certs": ["CertificateOfCompletion_SoftwareDesignModelingWithUML_LI.pdf"]
    },
    {
      "index": 89,
      "title": "XML Essential Training",
      "instructor": "Joe Marini",
      "date_completed": "2021-08-15",
      "date": [
        {
          "$date": "2021-08-15T19:19:00.000Z"
        }
      ],
      "synopsis": "Extensible Markup Language (XML) was designed to make information sharing and data interpretation easier. Having a solid grasp of what XML is and how to work with it is essential for any developer. In this course, Joe Marini takes you through the basic rules of XML, explains its syntax, and covers more advanced topics such as styling your XML with CSS and manipulating XML content using XPath and XSLT. From integrating XML into your site to using document type definitions and XML schema, this course covers what you need to know to not only get started with XML, but also master it.",
      "objectives": [
        "What is XML?",
        "Advantages and drawbacks of XML",
        "Proper XML syntax",
        "Working with XML namespaces",
        "Styling XML tags",
        "Discovering and creating document content",
        "Manipulating XML content using XPath and XSLT",
        "Document type definitions and XML schema"
      ],
      "skills": ["XML"],
      "comments": "Another refresher course, but it included some new things for me, such as styling XML code with XSLT and CSS - I had only used XML as straight data, either from/to Web APIs, or for software configuration, or in Custom Modules (for Ascent/Kofax Capture).<br />We manipulated XML with the DOM, using JavaScript.<br />We also learned about XPath, and about enforcing rules and constraints on XML data with Document Type Definitions (DTDs), and XML Schema. We used an online tool to validate our XML data against a DTD and against an XML Schema, at <a href=\"https://www.xmlvalidation.com/\" target=\"_blank\">Validate XML files</a>.",
      "url": "https://www.linkedin.com/learning/xml-essential-training-2",
      "certs": ["CertificateOfCompletion_XMLEssentialTraining_LI.pdf"]
    },
    {
      "index": 88,
      "title": "Customer Service: Problem Solving and Troubleshooting",
      "instructor": "Noah Fleming",
      "date_completed": "2021-08-13",
      "date": [
        {
          "$date": "2021-08-13T19:19:00.000Z"
        }
      ],
      "synopsis": "Customer service care costs organizations billions of dollars each year. As a result, it's critical that employees are equipped with the skills needed to handle a variety of different customer service problems. In this course, learn critical problem-solving and troubleshooting processes for common sense customer service in a wide variety of applications. Discover how to effectively deal with issues, while maintaining a positive relationship with your customers (and your own sanity). Plus, learn how to identify and resolve larger systemic issues within your company.",
      "objectives": [
        "Identify the first step to take with an invalid complaint.",
        "Recognize the importance of always listening to the customer.",
        "Explain how to deal with a customer who is rude and making you uncomfortable."
      ],
      "skills": ["Troubleshooting", "Problem Solving", "Customer Service"],
      "comments": "This instructor puts a lot of emphasis on judging whether a customer's complaint is valid or invalid. (And then he DOES expand on how to deal with BOTH kinds.)<br />In my support roles, I'd have to say that the vast majority of complaints, or more likely, issues/problems, were in fact valid, and thus, mostly assumed to be.<br />However, many years ago, I did work at a hotel (in a public-facing role), where a greater percentage of the complaints were in fact invalid, so I do understand the need for such an initial judgement in some scenarios.",
      "url": "https://www.linkedin.com/learning/customer-service-problem-solving-and-troubleshooting",
      "certs": [
        "CertificateOfCompletion_CustomerServiceProblemSolvingAndTroubleshooting_LI.pdf",
        "CertificateOfCompletion_CustomerServiceProblemSolvingAndTroubleshooting_NASBA.pdf"
      ]
    },
    {
      "index": 87,
      "title": "ASP.NET Web Forms Essential Training",
      "instructor": "Tiberiu Covaci",
      "date_completed": "2021-08-08",
      "date": [
        {
          "$date": "2021-08-08T19:19:00.000Z"
        }
      ],
      "synopsis": "Web Forms are a simple way to build web pages. In this course, discover how to build simple Web Forms applications in ASP.NET. Instructor Tiberiu Covaci shows how to create your first Web Forms page, debug it, create reusable code, and work with data. After stepping through how to create your first Visual Studio project, he shows how to work with Web Forms controls, shares tips for writing maintainable code, and covers different options for debugging ASP.NET applications. To wrap up, he discusses how to work with data and Microsoft SQL Server.",
      "objectives": [
        "Working with ASP.NET Web Forms controls",
        "Creating ASP.NET Web Forms pages",
        "Designing maintainable code",
        "Debugging ASP.NET Web Forms applications",
        "Creating reusable code",
        "Working with SQL Server",
        "Presenting datasets",
        "ASP.NET Web Forms apps"
      ],
      "skills": ["ASP.NET", "Back-End Web Development"],
      "comments": "A good refresher course for me -<br />I hadn't taken an ASP.NET course in a decade, and haven't dug into the code (for the ASP.NET/SQL Server-based Support Knowledge Base that I managed) for more than a couple of years.<br />The instructor went over creating a Web Forms page, and the lifecycle of an ASP.NET page.<br />We covered debugging and tracing, and also exception handling. The instructor was too brief, in my opinion, on exception handling, and I'll give him a \"C\" on that part. (Fortunately, I've had prior good instruction and experience on/with this topic.)<br />We learned about creating Web Controls, exposing public properties of them, and registering and using them.<br />In the <i>Working with Data</i> chapter, the instructor used a <i>LocalDB</i> SQL Server database, but I wanted to use my own SQL Server instance. So I attached the provided database files to my SQL Server, and used Connection Strings to that. I had to fiddle with the Application Pool settings in IIS to use Integrated Security for the database access, so I decided to create a new Application Pool for the app and used that. But I also created a database user (using SQL Server Authentication), granting it the minimum rights necessary, and created a Connection String for that user. I then coded the app both ways (to be able to use either user).<br />We finished up with adding our User (Web) Control to the ListView (that we used to display the data), using it to insert and update data (instead of the built-in functionality).",
      "url": "https://www.linkedin.com/learning/asp-dot-net-web-forms-essential-training",
      "certs": [
        "CertificateOfCompletion_ASP.NETWebFormsEssentialTraining_LI.pdf"
      ]
    },
    {
      "index": 86,
      "title": "Learning Amazon Web Services (AWS) for Developers",
      "instructor": "Bear Cahill",
      "date_completed": "2021-08-04",
      "date": [
        {
          "$date": "2021-08-04T19:19:00.000Z"
        }
      ],
      "synopsis": "Amazon Web Services (AWS) is the leading cloud service provider today, ahead of competitors such as Microsoft Azure and Google Cloud Platform. It is seen by many as the standard for functional, reliable, interoperable, and affordable cloud services. Developers need to understand what it means to develop on and migrate to the cloud—and comprehend the overall landscape of AWS before diving into the platform. This course provides a high-level overview just for developers, focusing on the AWS features and services of the most interest to them. Instructor Bear Cahill introduces AWS Lambda, DynamoDB, ElastiCache, Elastic Beanstalk, S3, SQS, SNS, and many more key features and services.",
      "objectives": [
        "Evaluating AWS pricing and services",
        "Setting up security: users, roles, groups, and policies",
        "Developing with the AWS SDK",
        "Adding storage with S3 and DynamoDB",
        "Using AWS for messaging",
        "Deploying to AWS",
        "Monitoring AWS"
      ],
      "skills": [
        "Cloud Administration",
        "Amazon Web Services (AWS)",
        "Cloud Development"
      ],
      "comments": "A good course that surveys many of the AWS services that a developer would use.<br />We covered Security - Users, Permissions, Roles, etc. using IAM. We also learned about Cognito (which I hadn't used before) for Identity and User Pools.<br />As in other courses I have taken here, we used Lambda - this time we created one using a blueprint. We also used the Simple Queue Service (SQS) and the Simple Notification Service (SNS), configuring them to communicate with each other and the Lambda. And we created a DynamoDB Trigger to our Lambda.<br />We used CloudWatch - for checking logs, and for setting alarms for such things as latency above a certain threshold, for costs, etc.<br />We also learned about Elastic Beanstalk, CloudFormation, ElastiCache, and CloudFront.<br />And we finished up with the instructor leading us through how to clean up by deleting all of the things we built in AWS for this course. ",
      "url": "https://www.linkedin.com/learning/learning-amazon-web-services-aws-for-developers-2",
      "certs": [
        "CertificateOfCompletion_LearningAmazonWebServicesAWSForDevelopers_LI.pdf"
      ]
    },
    {
      "index": 85,
      "title": "Advanced Pandas",
      "instructor": "Madecraft and Brett Vanderblock",
      "date_completed": "2021-07-31",
      "date": [
        {
          "$date": "2021-07-31T19:19:00.000Z"
        }
      ],
      "synopsis": "If you've worked in Python, you're likely familiar with the basic of pandas. In this advanced course, instructor Brett Vanderblock shares how you can take advantage of the advanced functions of pandas—such as working with dates, dealing with missing data, merging DataFrames, and more—to work more effectively with your data. First, Brett introduces you to DataFrames, identifies the top functions in pandas, and shows you how to configure your pandas workspace efficiently. He walks you through converting data types, working with strings, and using the apply map and applymap functions effectively. He shows you how to combine Groupby and multiple aggregate functions in pandas and how to use the merge, join, and concat functions. Brett steps through plotting and statistical functions with pandas. He concludes by explaining how you can use pandas-profiling and Geopandas to get the most out of your functions and data.  This course was created by Madecraft. We are pleased to host this training in our library.",
      "objectives": null,
      "skills": ["Pandas (Software)", "Data Management", "Data Visualization"],
      "comments": "This course used the Jupyter Notebook platform.<br />I got some more practice with <i>stack</i> and <i>unstack,</i> and learned about functions I hadn't used, such as <i>pivot, pivot_table,</i> and <i>melt.</i><br />We learned about merging, joining and concatenating dataframes, as well as categorizing and correlation.<br />I learned more about plotting, and pandas Profiling, which is a nice tool.<br />We also used <i>geopandas</i> - We had to go to mapbox's site for a free API token, then we turned our dataframe consisting of location names and latitude and longitude values into a GeoDataFrame, creating an interactive map (using <i>plotly</i>) showing the locations of 5 mountain peaks west of Boulder, CO.",
      "url": "https://www.linkedin.com/learning/advanced-pandas",
      "certs": ["CertificateOfCompletion_AdvancedPandas_LI.pdf"]
    },
    {
      "index": 84,
      "title": "PostgreSQL Essential Training",
      "instructor": "Adam Wilbert",
      "date_completed": "2021-07-29",
      "date": [
        {
          "$date": "2021-07-29T19:19:00.000Z"
        }
      ],
      "synopsis": "PostgreSQL is one of the world’s most popular open-source database platforms. This highly flexible and scalable relational database management system (RDBMS) supports everything from general purpose databases to machine learning applications and geospatial map servers. In this course, instructor Adam Wilbert helps you get up and running with PostgreSQL. Adam covers the essential first steps of setting up a PostgreSQL server and working with the graphical interface, pgAdmin. He then shows how to work with pgAdmin to create new database objects, populate them with data, and retrieve records from the database. If you're new to the platform (or relational databases in general), this course serves as an entry point and provides a solid foundation for further exploration in database administration.",
      "objectives": null,
      "skills": [
        "PostgreSQL",
        "Relational Databases",
        "Database Administration"
      ],
      "comments": "I used a containerized (using Docker) PostgreSQL database in the <i>Learning JDBC</i> course I took here, and I also used that in a <i>Data Engineering Foundations</i> course (also here).<br />After the latter course, I decided that it was time to take this course, that I had queued up after the former course.<br />I had taken a sneak peek at this course because it has a lesson about using a graphical interface, so I had gone ahead and installed pgAdmin 4 and used it with the containerized PostgreSQL database in both of those earlier courses.<br />In this course, we installed PostgreSQL locally (not in a container), and the installation also included pgAdmin 4. I went ahead and used my prior installation of it, since I had recently updated it (to a newer version than was included in this local installation).<br />In this local installation, I had taken care to specify a different port than was used in the container, to avoid conflicts. And pgAdmin 4 still showed the server in the container (running or not), and when I connected to this new (local) server, I was able to see and use both.<br />As with other \"Essential...\" courses here, this course started out very basic, in this case, regarding SQL and relational database concepts such as foreign keys, and joins, etc. It did pick up, and we got into constraints and indexes, accounts, roles and privileges, and backing up and restoring databases.<br />I mostly appreciated being reminded of the differences in the flavor of SQL used here and other flavors I have used, as well as learning more about what is available in pgAdmin 4 and how it works.",
      "url": "https://www.linkedin.com/learning/postgresql-essential-training",
      "certs": ["CertificateOfCompletion_PostgreSQLEssentialTraining_LI.pdf"]
    },
    {
      "index": 83,
      "title": "Creativity at Work: A Short Course from Seth Godin",
      "instructor": "Seth Godin",
      "date_completed": "2021-07-27",
      "date": [
        {
          "$date": "2021-07-27T19:19:00.000Z"
        }
      ],
      "synopsis": "You are a creative person. Despite what your inner critic may have told you, you absolutely can solve complex business problems without a roadmap. The potential is there; whether or not you tap into it is up to you. In this concise course, Seth Godin—the author of 20 best-selling books, including The Dip, Linchpin, Purple Cow, and The Practice—lays out how to help your team let go of the fears that hinder your creative progress and start creating work that matters. Learn how to combat preconceived notions about creativity, including the idea that creativity is a gift bestowed upon a select few. (Spoiler alert: it's not.) Discover how to tap into your team’s creativity by embracing the possibility of failure, cultivating practical empathy, and exploring the root causes of writer's block and impostor syndrome. Plus, get tips for making creative problem-solving a habit that sticks.",
      "objectives": null,
      "skills": ["Creative Ideation", "Creative Problem Solving"],
      "comments": "The instructor has very interesting and out-of-the-ordinary ways of looking at some things.",
      "url": "https://www.linkedin.com/learning/creativity-at-work-a-short-course-from-seth-godin",
      "certs": [
        "CertificateOfCompletion_CreativityAtWork-AShortCourseFromSethGodin_LI.pdf"
      ]
    },
    {
      "index": 82,
      "title": "Data Engineering Foundations",
      "instructor": "Harshit Tyagi",
      "date_completed": "2021-07-24",
      "date": [
        {
          "$date": "2021-07-24T13:00:00.000Z"
        }
      ],
      "synopsis": "Data science can be generally defined as the process of making data useful, and data engineering is a key part of how and why. If you think of data science like a race car, the data engineers are the pit crew. They’re not driving the car, but they make the car much easier to drive. Data engineers make sure the data flow is running smoothly, monitor systems, anticipate problems, and repair the data pipeline whenever problems arise. They extract and gather data from multiple sources and load it into a single, easy-to-query database. In short, data engineers make data scientists’ lives easier.  In this course, Harshit Tyagi explains the fundamentals of data engineering. He covers key topics like data wrangling, database schema, and developing ETL pipelines. He also details several data engineering tools like Hive, Hadoop, Spark, and Airflow. By the end of this course, it should be abundantly clear why the data engineer is one of the most valuable people in a data-driven organization.",
      "objectives": null,
      "skills": ["Data Engineering"],
      "comments": null,
      "url": "https://www.linkedin.com/learning/data-engineering-foundations",
      "certs": ["CertificateOfCompletion_DataEngineeringFoundations_LI.pdf"]
    },
    {
      "index": 81,
      "title": "AWS for Developers: DynamoDB",
      "instructor": "Robby Millsap",
      "date_completed": "2021-07-21",
      "date": [
        {
          "$date": "2021-07-21T13:00:00.000Z"
        }
      ],
      "synopsis": "DynamoDB is a fully managed NoSQL database solution hosted on the AWS cloud. It allows developers quickly scale to support millions of requests without having to worry about provisioning, clustering, patching, and replication. DynamoDB is also known for being an ideal solution for web APIs due to its robust support of JSON. In this course, learn how to leverage this solution so you can reap the high-performance benefits. Robby Millsap covers planning, database fundamentals, coding, and support. He takes you through the process of modeling data, creating tables, using Node.js, indexing, fetching, searching, scanning, querying, authentication, monitoring, and more.",
      "objectives": [
        "NoSQL vs. relational DBs",
        "DynamoDB vs. MongoDB",
        "Data modeling in DynamoDB",
        "Working with composite keys and sort keys",
        "Pricing and planning for capacity",
        "Creating secondary indexes",
        "Provisioning a DynamoDB table",
        "Scanning data and querying data",
        "Defining data types in JSON",
        "Working with client libraries",
        "Using Node.js with DynamoDB",
        "Monitoring"
      ],
      "skills": [
        "Amazon Web Services (AWS)",
        "Cloud Development",
        "Amazon DynamoDB"
      ],
      "comments": "An excellent course!<br /><br />After I took the <i>Angular Essential Training</i> course here, I saw an article about hosting an Angular app on GitHub, then I also discovered that there is on issue with GitHub Pages with Angular apps that use Routing. I found some articles about getting around those issues, but for the time being I settled with just hosting the project from the course, with some of my own modifications (with more to come), on my local Apache and IIS Web servers.<br />After taking the <i>Building Serverless Apps on AWS</i> course here, I stored the Angular app in an S3 bucket, and it worked.<br />In that Angular project, we used a mock API back end, and didn't persist the data, but after taking that <i>Building Serverless Apps on AWS</i> course, I foresaw using a DynamoDB database and an API Gateway for the Angular project. So I thought that I needed to learn more about DynamoDB databases, and this course definitely fit the bill.<br /><br />We covered data modeling for maximum performance, and cost considerations, as well as installing and using the AWS CLI, scanning and querying data.<br />We also covered coding to the database using Node.js - to create a table, insert data (also using transactions) and query the data.<br />We learned about and enabled Streams, to track when data was changed and what the changes were and coded a script to output that info.<br />We also installed and used DynamoDB locally, so as not to rack up charges on AWS while developing.<br />The table that the instructor had us create was pretty cool, dealing with a small bit of baseball team stats, and mostly focusing on the Angels.",
      "url": "https://www.linkedin.com/learning/aws-for-developers-dynamodb",
      "certs": ["CertificateOfCompletion_AWSForDevelopersDynamoDB_LI.pdf"]
    },
    {
      "index": 80,
      "title": "Building Serverless Apps on AWS",
      "instructor": "Emmanuel Henri",
      "date_completed": "2021-07-18",
      "date": [
        {
          "$date": "2021-07-08T18:00:00.000Z"
        }
      ],
      "synopsis": "Learn how to develop a NodeJS serverless app on Amazon Web Services (AWS). First, get introduced to several services: Lambda, DynamoDB, S3, Postman, and the API gateway. Then, see how to install Postman, set up an Amazon account, implement an S3 storage bucket with static content, and set up serverless Lambda compute. Next, find out how to create a table on the DynamoDB AWS service and create a POST function. Additionally, discover how to code and test final endpoint functions.",
      "objectives": [
        "Getting started with AWS",
        "Building a serverless app",
        "Exploring Lambda and DynamoDB",
        "Working with S3",
        "Setting up a base client app",
        "Working with APIs and gateways",
        "Coding endpoint GET functions",
        "Using Postman for testing",
        "Testing an AWS serverless app"
      ],
      "skills": [
        "Cloud Computing",
        "Amazon Web Services (AWS)",
        "Cloud Development"
      ],
      "comments": "Although the <i>Serverless and Microservices for AWS</i> course I took here was good, with the instructor explaining the architecture and the decision-making when implementing, and transitioning an existing application to AWS, we didn't actually DO any of it. So I got a feel for what the pieces were, and how they fit together, but not how each piece actually worked.<br />In THIS course, we actually USED some of the AWS services -<br />We put a static Web site up in an S3 storage bucket, and set the permissions appropriately. So I then put up my LinkedIn Learning Courses Web site that I have on GitHub onto AWS (<a href=\"http://rtcourses.s3-website-us-west-1.amazonaws.com/\" target=\"_blank\">Courses on AWS</a>).<br />We set up a table in DynamoDB, and wrote some Lambda compute functions for POST and GET to/from it, and tested those functions in Lambda. We then set up an API Gateway for those functions, and tested our API externally using Postman.<br />This course also had some issues with being a little old - the Node.js versions available on AWS had changed some, so that we had to modify the provided code a bit. Other students helped out with this in the Q&A section. And the AWS interface had changed, so I had to poke around a bit to find the current location of a key setting to get my Lambda compute functions to work.<br />As always, if any of you take this course and need help with those two issuess, I am happy to help...",
      "url": "https://www.linkedin.com/learning/building-serverless-apps-on-aws-2018",
      "certs": [
        "CertificateOfCompletion_BuildingServerlessAppsOnAWS_LI.pdf",
        "CertificateOfCompletion_BuildingServerlessAppsOnAWS_CompTIA.pdf"
      ]
    },
    {
      "index": 79,
      "title": "Build a Google Maps App with JavaScript",
      "instructor": "Mark Lassoff and Framework Tech",
      "date_completed": "2021-07-16",
      "date": [
        {
          "$date": "2021-07-16T13:00:00.000Z"
        }
      ],
      "synopsis": "Build a quick and compelling app that uses the Google Places library and JavaScript to implement geolocation. In this short, hands-on course, Mark Lassoff helps you create a simple Google Maps integrated application using vanilla JavaScript: Feed Me, a restaurant locator. This project can help you hone your JavaScript skills and add a much-needed feature—an interactive map—to your existing sites and applications. Plus, learn how to add extra information to Google Maps markers, such as the price and rating for the featured restaurants.  This course was created by Framework Tech. We are pleased to host this training in our library.",
      "objectives": null,
      "skills": [
        "Web Application Development",
        "JavaScript",
        "Google Maps API"
      ],
      "comments": "A refresher for me of the content of some other courses I've taken here that covered mapping -<br />I'm disappointed that Google no longer supports keyless use of the Google Maps API, and since I didn't want to go through the rigmarole of registering for an API Key, and providing credit card info, etc., I wasn't able to use all of the features used in our app. But enough to follow along with, and learn a few things. For instance, the instructor clued me in to <i>Sensors</i> in a Web browser's Web Developer Tools, where one can change the Location, for testing, and the <i>Device Toolbar</i>, where one can test out the display for various mobile devices.",
      "url": "https://www.linkedin.com/learning/build-a-google-maps-app-with-javascript",
      "certs": [
        "CertificateOfCompletion_BuildAGoogleMapsAppWithJavaScript_LI.pdf"
      ]
    },
    {
      "index": 78,
      "title": "Angular Essential Training",
      "instructor": "Justin Schwartzenberger",
      "date_completed": "2021-07-15",
      "date": [
        {
          "$date": "2021-07-15T13:00:00.000Z"
        }
      ],
      "synopsis": "Angular was designed by Google to address challenges programmers face building complex, single-page applications. This JavaScript platform provides a solid core of web functionality, letting you take care of the design and implementation details. In this course, Justin Schwartzenberger introduces you to the essentials of this \"superheroic\" platform, including powerful features such as two-way data binding, comprehensive routing, and dependency injection. Justin steps through the platform one feature at a time, focusing on the component-based architecture of Angular. Learn what Angular is and what it can do, as Justin builds a full-featured web app from start to finish. After mastering the essentials, you can tackle the other project-based courses in our library and create your own Angular app.",
      "objectives": [
        "What is Angular?",
        "Working with components",
        "Binding events and properties",
        "Getting data to components",
        "Using directives and pipes",
        "Creating Angular forms",
        "Validating form data",
        "How Angular does dependency injection",
        "Making HTTP calls",
        "Routing",
        "Styling components"
      ],
      "skills": ["Angular"],
      "comments": "Angular is a very complex client-side framework for JavaScript, but is very powerful, and it actually makes some things simpler to manage.<br />We learned about creating Components, using Angular Forms (using built-in and custom validation) along with HTTP calls and Routing (to different (API) URLs).<br />We used the Web Developer Tools in a Web browser to see what Angular turned into the page's HTML, to help understand what Angular is doing, and we finished up with a whole chapter on styling Components.",
      "url": "https://www.linkedin.com/learning/angular-essential-training-2",
      "certs": ["CertificateOfCompletion_AngularEssentialTraining_LI.pdf"]
    },
    {
      "index": 77,
      "title": "Python GUI Development with Tkinter",
      "instructor": "Barron Stone",
      "date_completed": "2021-07-12",
      "date": [
        {
          "$date": "2021-07-12T13:00:00.000Z"
        }
      ],
      "synopsis": "Put an end to writing command-line interfaces for your programs. Use Tkinter, the Python package for creating themed interface elements with the Tk GUI toolkit. Join Barron Stone in this course as he walks through the most popular Tk widgets and shows you how to customize their appearance and behavior to fit your application. Learn how to manage the placement of those widgets on the GUI and make them react to user behavior with event-driven code. The final chapter takes you through the entire start-to-finish process of building the user interface for an application, so you can see how all of these techniques work in a real-world development scenario.",
      "objectives": [
        "Installing Python 3 and Tcl/Tk for Mac or Windows",
        "Creating and configuring themed Tk widgets",
        "Decorating the GUI with text labels and images",
        "Capturing input from buttons, menus, and entry fields",
        "Presenting choices with check boxes and radio buttons",
        "Using geometry managers to lay out the GUI",
        "Organizing widgets inside of frames and windows",
        "Handling user actions with event-driven programming",
        "Creating a simple drawing tool with the Canvas",
        "Prompting users with pop-up dialog boxes"
      ],
      "skills": ["Python (Programming Language)", "Tkinter"],
      "comments": "This one took me probably about twice as long as it normally would have, because as I was going through it, I started working on my own Python GUI program, to somewhat replicate the contents of my <a href=\"https://gist.github.com/rogert8/f87563e2836aa5911754f40622030ce3\" target=\"_blank\">Courses Jupyter Notebook</a>, but with Menus and Treeviews, etc., using the <i>Tkinter</i> (pronounced \"tee-kay-inter\") module's widgets, along with <i>pandas.</i><br />I'm about halfway done with what I want to do with that program, and will make it available, likely on GitHub or GitHub Gist, when completed.",
      "url": "https://www.linkedin.com/learning/python-gui-development-with-tkinter-2",
      "certs": [
        "CertificateOfCompletion_PythonGUIDevelopmentWithTkinter_LI.pdf"
      ]
    },
    {
      "index": 76,
      "title": "Learn Emotional Intelligence, the Key Determiner of Success",
      "instructor": "Big Think - Daniel Goleman, Amy Cuddy, Susan David, Alan Alda, Angie McArthur",
      "date_completed": "2021-06-30",
      "date": [
        {
          "$date": "2021-06-30T13:00:00.000Z"
        }
      ],
      "synopsis": "Explore the four domains of emotional intelligence—self-awareness, self-management, social awareness, and relationship management—as defined by psychologist and author Daniel Goleman. The domains build on one another, starting with a greater awareness of self and others, and ending with the management of relationships that are critical to your personal and professional life. Learn how to become more mindful of your strengths, limitations, and the values that define them; explore ways to create space between yourself, your thoughts, and your emotions; develop awareness of how people see the world differently based on individual preferences, as well as social and environmental factors; and use awareness of self and others to work toward collaboration, innovation, and mutually beneficial relationships. This course includes videos from: Daniel Goleman, psychologist, lecturer, and science journalist Amy Cuddy, social psychologist and associate professor at Harvard Business School Susan David, psychologist at Harvard Medical School and cofounder of the Institute of Coaching Alan Alda, Emmy-winning actor, writer, and director Angie McArthur, CEO of Professional Thinking Partners Note: This course was produced by Big Think. We are pleased to host this content in our library. ",
      "objectives": null,
      "skills": ["Interpersonal Communication", "Emotional Intelligence"],
      "comments": null,
      "url": "https://www.linkedin.com/learning/learn-emotional-intelligence-the-key-determiner-of-success",
      "certs": [
        "CertificateOfCompletion_LearnEmotionalIntelligence-TheKeyDeterminerOfSuccess_LI.pdf"
      ]
    },
    {
      "index": 75,
      "title": "WordPress 5 Essential Training: Site Administration",
      "instructor": "Morten Rand-Hendriksen",
      "date_completed": "2021-06-29",
      "date": [
        {
          "$date": "2021-06-29T13:00:00.000Z"
        }
      ],
      "synopsis": "WordPress is an easy way to get a website up and running, but sometimes you want to take a WordPress site further. This course shows how to administer a self-hosted WordPress site. Learn how to work with the settings, including important privacy settings, and configure your site's style, menus, widgets, and theme with the Customizer. Find out how to extend WordPress with plugins, add and manage users, and manage comments and spam. Instructor Morten Rand-Hendriksen also provides tips for keeping your WordPress site secure and up to date—and troubleshoot it when something goes wrong.",
      "objectives": [
        "Adjusting settings",
        "Changing discussion and privacy settings",
        "Using the Customizer to adjust site identity and visuals",
        "Creating and customizing menus",
        "Installing and activating themes",
        "Extending WordPress with plugins",
        "Adding and managing users",
        "Managing comments and spam",
        "WordPress security and maintenance"
      ],
      "skills": [
        "Content Management Systems (CMS)",
        "Blogging Software",
        "WordPress"
      ],
      "comments": "This is a good companion course to this same instructor's <i>WordPress 5 Essential Training</i> course. Whereas that course covered content creation/management, this one went through every part/setting on a site's Admin page/Settings section.<br />We covered managing Users, their Privacy, and handling Spam, along with using Themes and other things. We ended with an excellent lesson on recovering from a site crash.<br />And I created a site template for myself, configuring the settings on it to his recommendations (or deciding from his explanations).",
      "url": "https://www.linkedin.com/learning/wordpress-5-essential-training-site-administration",
      "certs": [
        "CertificateOfCompletion_WordPress5EssentialTraining-SiteAdministration_LI.pdf"
      ]
    },
    {
      "index": 74,
      "title": "WordPress 5 Essential Training",
      "instructor": "Morten Rand-Hendriksen",
      "date_completed": "2021-06-27",
      "date": [
        {
          "$date": "2021-06-27T19:00:00.000Z"
        }
      ],
      "synopsis": "WordPress powers millions of blogs and websites. Available in 180 languages, WordPress can be hosted on any server, accessed in any browser, and built into almost anything you imagine: blog, portfolio, website, or online store. Learn how to create your own web experiences with this powerful and open-source publishing platform. Instructor Morten Rand-Hendriksen helps you get the most out of WordPress and create feature-rich blogs and websites. Morten explains how to create and publish posts and pages; create and edit blocks; and define reusable content blocks to take full advantage of the new block editor codenamed \"Gutenberg.\"  Note: This course covers WordPress 5. The training will be updated as WordPress evolves.",
      "objectives": [
        "Installing WordPress",
        "Creating posts and pages",
        "Formatting text",
        "Publishing and scheduling posts",
        "Adding images, audio, and video",
        "Bulk editing posts and pages",
        "Working with reusable blocks"
      ],
      "skills": ["Blogging Software", "Content Management", "WordPress"],
      "comments": "This is a good course, focusing on content management, using the powerful Gutenberg Block Editor.<br />I appreciated the Reusable Blocks feature, and the ability to use them to create templates, which I can envision being useful for creating Knowledge Base content.<br />Now on to the <i>WordPress 5 Essential Training: Site Administration</i> course...",
      "url": "https://www.linkedin.com/learning/wordpress-5-essential-training",
      "certs": ["CertificateOfCompletion_WordPress5EssentialTraining_LI.pdf"]
    },
    {
      "index": 73,
      "title": "Installing and Running WordPress: Local by FlyWheel",
      "instructor": "Morten Rand-Hendriksen",
      "date_completed": "2021-06-25",
      "date": [
        {
          "$date": "2021-06-25T19:00:00.000Z"
        }
      ],
      "synopsis": "Whether you’re just learning to use WordPress or busy developing new WordPress websites and themes, having a local version is essential. Installing WordPress on your computer gives you full control for experimentation, development, and testing. You see the changes you make immediately—no need to upload and download files. Local by FlyWheel is a free application that makes it easy to get a local WordPress environment up and running fast. In this course, instructor Morten Rand-Hendriksen helps you install and run WordPress locally on both Windows and Mac using Local. He then shows how to take advantage of all its benefits, including Live Link, local file access, cloning, and Blueprints, a special Local feature that makes launching your next WordPress site even easier.",
      "objectives": [
        "Downloading and installing Local",
        "Configuring SSL",
        "Turning on and off local sites",
        "Enabling and using Live Link",
        "Accessing and editing local files and databases",
        "Cloning and export sites",
        "Creating and using Blueprints"
      ],
      "skills": ["Content Management", "WordPress"],
      "comments": "Although I have experience managing Web sites on various platforms, I didn't have experience with WordPress. So I started taking the WordPress.com Essential Training course here. Then I realized that I should take the WordPress 5 Essential Training course, using the version from WordPress.org, which allows for more control, and which would likely be the platform in use at a place that I would work using/supporting it, instead.  So I started taking that course, where the instructor recommended this course, to get a local installation of WordPress to work with.<br />Local by FlyWheel is pretty cool - you can creae WordPress sites that run in their own containers. And when creating the sites, you can choose between a couple of Web Servers, some PHP and some MySQL versions.<br />We learned how to turn on and off sites, clone and export them, and use a site as a Blueprint to create future sites from. We also learned about accessing the command line interface for WordPress.<br />Now back to the WordPress 5 Essential Training course...",
      "url": "https://www.linkedin.com/learning/installing-and-running-wordpress-local-by-flywheel",
      "certs": [
        "CertificateOfCompletion_InstallingAndRunningWordPressLocalByFlyWheel_LI.pdf"
      ]
    },
    {
      "index": 72,
      "title": "Serverless and Microservices for AWS",
      "instructor": "Aileen Smith",
      "date_completed": "2021-06-21",
      "date": [
        {
          "$date": "2021-06-21T19:00:00.000Z"
        }
      ],
      "synopsis": "The benefit of serverless architectures are well-defined. Serverless helps developers focus on what they do best—building solutions—without the difficulty of managing and scaling infrastructure. However, when it comes to implementation, the instructions are much less clear. In this course, developer and AWS Community Hero Aileen Smith explores both the how and the why of serverless microservices architectures in AWS. Learn how to leverage Lambda functions and Elastic Container Service (ECS) components, choose the right integration technology, configure an API for access, and coordinate serverless workflows with Step Functions. Aileen also shows how to transition an existing application to serverless and solve common deployment and management challenges.",
      "objectives": [
        "Serverless technologies on AWS",
        "What are microservices?",
        "Building serverless components on AWS",
        "Hybrid architectures",
        "Serverless machine learning",
        "Transitioning an existing application to serverless",
        "Serverless challenges and solutions"
      ],
      "skills": [
        "Microservices",
        "Cloud Computing",
        "Serverless Computing",
        "Amazon Web Services (AWS)"
      ],
      "comments": null,
      "url": "https://www.linkedin.com/learning/serverless-and-microservices-for-aws",
      "certs": [
        "CertificateOfCompletion_ServerlessAndMicroservicesForAWS_LI.pdf"
      ]
    },
    {
      "index": 71,
      "title": "Advanced Python",
      "instructor": "Joe Marini",
      "date_completed": "2021-06-17",
      "date": [
        {
          "$date": "2021-06-17T19:00:00.000Z"
        }
      ],
      "synopsis": "Develop your Python programming skills. Python is a great choice for building all kinds of applications, but to fully take advantage of its power and flexibility, you need to master all its advanced functionality. In this course, you can learn how to leverage next-level Python features such as object-oriented special class methods, use logging to track performance and user activity, see how to port code from Python 2 to 3, and make your code more efficient and easier to read and maintain. Instructor Joe Marini also shows how to manipulate data, build custom classes and functions, create lists, and write more elegant, optimized code.",
      "objectives": [
        "Truth value testing",
        "Template strings",
        "Iterators",
        "Transforms",
        "Advanced Python functions",
        "Advanced collections",
        "Advanced classes and objects",
        "Logging",
        "Python comprehensions: list, dictionary, and set"
      ],
      "skills": ["Python (Programming Language)", "Coding Practices"],
      "comments": "A very good course.<br />We learned about advanced collections, such as a namedtuple, Counters, and OrderedDict and Deque objects.<br />And we learned about adding object operations and comparisons to classes, and using the logging module.<br />We also learned about comprehensions - using a special syntax to derive a new list of values from an existing list of values. This syntax shortens the code (compared to using map), and can also be applied to dictionaries and sets.",
      "url": "https://www.linkedin.com/learning/advanced-python",
      "certs": ["CertificateOfCompletion_AdvancedPython_LI.pdf"]
    },
    {
      "index": 70,
      "title": "Learning React.js",
      "instructor": "Eve Porcello",
      "date_completed": "2021-06-10",
      "date": [
        {
          "$date": "2021-06-10T19:00:00.000Z"
        }
      ],
      "synopsis": "React.js is designed to make the process of building modular, reusable user interface components simple and intuitive. In this course, Eve Porcello guides you through the foundations of React development, including the use of React hooks—a new feature starting in React 16.8 that allows developers to add functionality to components without writing classes. Eve shows how to create components, display dynamic data with properties, and render components using JSX syntax. Eve also manages the state of components with hooks; uses powerful React enhancements, such as the useEffect hook for loading remote data; and leverages cloud deployment options for apps created with create-react-app.  This course was created by Eve Porcello. We are pleased to offer this training in our library.",
      "objectives": [
        "What is React.js?",
        "Creating and rendering React elements",
        "Introducing JSX",
        "Creating a React component",
        "Rendering",
        "Managing state with hooks",
        "Using multi-state variables",
        "Fetching data",
        "Deploying a React app"
      ],
      "skills": [
        "Web Development",
        "Application Frameworks",
        "JavaScript",
        "React.js"
      ],
      "comments": "This is a nice course on using React.js, an open-source JavaScript library used for building user interfaces.<br />And Create React App (create-react-app) is pretty cool, generating a React project structure. You can then modify the index.html, index.js and other files to create your app.<br />We learned about creating React Elements and React Components.<br />We finished up by generating a production build of our app, and putting it up on Netlify for hosting.<br />And now I have some React Native and GraphQL courses queued up...",
      "url": "https://www.linkedin.com/learning/learning-react-js-5",
      "certs": ["CertificateOfCompletion_LearningReact.js_LI.pdf"]
    },
    {
      "index": 69,
      "title": "Introducing Entity Framework",
      "instructor": "Cam Soper and Microsoft .NET",
      "date_completed": "2021-06-06",
      "date": [
        {
          "$date": "2021-06-06T19:00:00.000Z"
        }
      ],
      "synopsis": "Instructor Cam Soper introduces Entity Framework (EF) Core. EF Core is an object-relational mapper (ORM) that simplifies working with relational databases using strongly typed .NET objects. Cam shows you how to reverse engineer an existing database for use with EF Core. He explains that ASP.NET and EF Core are a perfect match to accelerate your web app development. He demonstrates how to use SQLite and Azure Cosmos database providers with EF Core. Cam concludes by exploring several ways you can optimize your EF Core code.  This course was created by Microsoft.NET. We are pleased to host this training in our library.",
      "objectives": null,
      "skills": [
        "Entity Framework (EF) Core",
        "Relational Databases",
        ".NET Framework"
      ],
      "comments": "In a prior course I took here, Building Web APIs with ASP.NET Web API 2.2, we used the Entity Framework (to work with/model databases). I wanted to learn more about it, and see why things were as they were in the Exercise Files we were provided with in that course.<br />Again, we used C#, this time for a Console app, and again using the Nuget Package Manager, this time to add the Entity Framework Core packages. Using that, we created a database and tables programmatically.<br />We learned how to use the Scaffold-DbContext NuGet Package Manager Console command to reverse-engineer an existing database, auto-creating classes for the tables, etc.<br />Then we used ASP.NET Core scaffolding with Entity Framework to auto-create Web pages to handle CRUD operations on the database. <br />We then covered other (than SQL Server) database providers - for SQLite and Azure Cosmos DB.<br />To get a SQLite database file of the SQL Server database we were using, I had to go find the SQL Server database files, attach them into my SQL Server instance, and find a converter that connected to that instance and converted the database to a SQLite .db file.<br />For the Azure Cosmos database Solution, I was barely able to see all of the connection properties (to his Azure DB) on screen, but did get it to connect and display our Create Product screen. But even after several attempts, I didn't get the Save to work, as he glossed over that, merely telling us that he already had the Models classes set up in his Solution.<br />We then learned some performance tips.",
      "url": "https://www.linkedin.com/learning/introducing-entity-framework",
      "certs": ["CertificateOfCompletion_IntroducingEntityFramework_LI.pdf"]
    },
    {
      "index": 68,
      "title": "SQL Code Challenges",
      "instructor": "Scott Simpson",
      "date_completed": "2021-06-05",
      "date": {
        "$date": ["2021-06-05T13:00:00.000Z"]
      },
      "synopsis": "Want to assess your SQL skills? These concise challenges let you stretch your brain and test your talents. Get hands-on practice querying and retrieving data, adding new tables to existing databases, updating data in multiple tables and multiple records, and presenting summary data. LinkedIn Learning staff instructor Scott Simpson structures each challenge in real-world scenarios: a restaurant website that takes reservations and online orders, and a library lending system. After each challenge, Scott shares his own solution. You can see how a professional programmer creates personalized, data-driven documents; handles sign-up data; deletes records; prepares reports; and more.",
      "objectives": [
        "Composing SELECT statements to retrieve data",
        "Searching records by date ranges",
        "Adding tables to existing databases",
        "Adding data to more than one table",
        "Updating multiple records simultaneously",
        "Generating summary reports"
      ],
      "skills": ["Database Queries", "SQL"],
      "comments": "I intentionally took a while to complete this course, working on a query or two here and there (while I was working on other courses) to stay sharp over time.<br />Even the most difficult challenges weren't too difficult, but I did learn about some of the differences in syntax between SQLite's SQL and other SQL flavors.<br />We used DB Browser for SQLite, and worked in databases for a restaurant and for a library. The challenge scenarios were interesting, as they would be typical for those entities.",
      "url": "https://www.linkedin.com/learning/sql-code-challenges",
      "certs": ["CertificateOfCompletion_SQLCodeChallenges_LI.pdf"]
    },
    {
      "index": 67,
      "title": "Building Web APIs with ASP.NET Web API 2.2",
      "instructor": "Jonathan \"J.\" Tower",
      "date_completed": "2021-06-02",
      "date": [
        {
          "$date": "2021-06-02T19:00:00.000Z"
        }
      ],
      "synopsis": "Learn how to connect web and mobile applications to back-end servers and databases in your applications using ASP.NET Web API 2.2, a popular framework for building web APIs on top of the .NET Framework. In this course, join Jonathan \"J.\" Tower as he steps through how to use this framework to efficiently create RESTful services. Learn how routing works with Web API to ensure APIs work as planned and are easily consumed by remote applications. Discover how data is modeled in Web API, along with how to build business logic for your API. Plus, learn about handling errors, securing your services, and documenting and testing your APIs.",
      "objectives": [
        "Convention-based routing",
        "Binding your code to an HTTP request",
        "Validating models",
        "Using attributes to route requests",
        "Customizing attribute routes",
        "Data serialization and model binding",
        "Error handling",
        "Using exception filters and exception loggers",
        "API documentation and testing",
        "Securing your API"
      ],
      "skills": [
        "ASP.NET",
        "C#",
        "Application Programming Interfaces",
        "Back-End Web Development",
        "Entity Framework"
      ],
      "comments": "This was a really good course.<br />We used C#, and covered different ways of routing requests, including using Data Transfer Objects (DTOs) to streamline requests/responses.<br />We covered error/exception handling, a couple of different ways to implement API documentation, and authorization and securing the API. I was glad to learn about securing all or part of an API, and do have some other courses queued up about this.<br />Postman, which I had used before, was the tool we used for testing the API, and we learned some tips and tricks for that tool, of which I hadn't been aware.<br />We used the NuGet Package Manager UI in Visual Studio to install packages for JSON Web Tokens (for Authorization) and Swashbuckle/Swagger for documentation. Earlier in the course, I became aware of/familiar with the Package Manager Console, when I had to do some things to take care of the differences between the current state of Visual Studio/.NET Framework, and things as they had been when this course was created.<br /><br />I also had to troubleshoot a <pre>Could not find a part of the path '...\\bin\\roslyn\\csc.exe'</pre>error, and can pass on the simplest solution, if anyone is interested.",
      "url": "https://www.linkedin.com/learning/building-web-apis-with-asp-dot-net-web-api-2-2-2",
      "certs": [
        "CertificateOfCompletion_BuildingWebAPIsWithASP.NETWebAPI2.2_LI.pdf"
      ]
    },
    {
      "index": 66,
      "title": "Communication within Teams",
      "instructor": "Daisy Lovelace",
      "date_completed": "2021-05-28",
      "date": [
        {
          "$date": "2021-05-28T19:19:00.000Z"
        }
      ],
      "synopsis": "Communication is an integral part of strong teamwork. In this course, Duke University professor Dr. Daisy Lovelace walks you through how to cultivate the communication practices of high-performing teams. She highlights the foundations of successful teams, and explains how to craft a team charter to establish norms for how you work together as a cohesive group. Dr. Lovelace also discusses essential elements of team communication—such as establishing trust and holding teammates accountable—and shows how to best communicate with your team in different settings.",
      "objectives": [
        "Differentiate between the roles and responsibilities for team members.",
        "Describe the purpose of a RACI matrix.",
        "Identify the elements of a team charter.",
        "Determine how best to manage conflict within teams.",
        "Interpret which approaches should be used to manage virtual teams and cross-cultural team communications."
      ],
      "skills": ["Interpersonal Communication", "Teamwork"],
      "comments": "A good course on leading/participating in effective teams.",
      "url": "https://www.linkedin.com/learning/communication-within-teams",
      "certs": [
        "CertificateOfCompletion_CommunicationWithinTeams_LI.pdf",
        "CertificateOfCompletion_CommunicationWithinTeams_NASBA.pdf"
      ]
    },
    {
      "index": 65,
      "title": "Learning Java Applications",
      "instructor": "Todd Perkins",
      "date_completed": "2021-05-09",
      "date": [
        {
          "$date": "2021-05-09T19:00:00.000Z"
        }
      ],
      "synopsis": "Get a practical introduction to Java programming, focused on developing Java applications for desktop, web, and mobile platforms. In this course, Todd Perkins provides a structured guide to Java application development. He reviews the basic building blocks of the Java language: variables, functions, arrays, conditional statements, classes, and more. In chapters 3 and 4, he shows how to build a user interface with Swing, the UI toolkit for Java, and connect Swing table components to different data sources. He also covers distribution and deployment of Java applications via JAR files, server-side programming with JavaServer Pages (JSP), and the Android development workflow. By the end of the course, you should know the basics of Java and be able to create simple desktop, web, and mobile apps of your own.",
      "objectives": [
        "Installing Java",
        "Choosing an IDE",
        "Creating a Java class",
        "Java language basics",
        "Creating a UI with Swing",
        "Storing data in tables and arrays",
        "Publishing and using JAR files",
        "Creating a JPS project",
        "Writing server-side Java",
        "Developing Android apps with Java"
      ],
      "skills": ["Application Development", "Java"],
      "comments": "I wanted to take this course because, while we created \"console\" applications in the other Java courses I have taken here, this course covered graphical applications, using <i>Swing.</i> And I have an old Java program that I created back after I first learned Java, that was graphical, which I used to place instruments in a space (stage, room, etc.) for MIDI files for my synthesizer, that I want to recreate. I can't find the source code for that. (It may be on a 3.5\" floppy somewhere here). Back then we didn't have the nice Swing tools, and had to do everything from scratch in code.<br /><br />We published runnable JAR files, including with resources, and installed Apache Tomcat and ran Java code from a .jsp page in our Web browser.<br />We ended up with installing Android Studio, based on IntelliJ IDEA, and created and ran a simple Android app. That was nice for me, since I'd only learned iOS development before.<br />In the bulk of the course, we used the Eclipse IDE and I found that its Code Completion is not as \"smart\" as other IDEs, such as IntelliJ IDEA, as it completes method calls, but not variables. It does, however, also alert you and make it easy to import libraries that you use in code.",
      "url": "https://www.linkedin.com/learning/learning-java-applications-2",
      "certs": ["CertificateOfCompletion_LearningJavaApplications_LI.pdf"]
    },
    {
      "index": 64,
      "title": "JSON Processing with Java EE",
      "instructor": "Alex Theedom",
      "date_completed": "2021-05-04",
      "date": [
        {
          "$date": "2021-05-04T19:19:00.000Z"
        }
      ],
      "synopsis": "JSON is a ubiquitous and lightweight data transfer format used for the storage and interchange of information in an organized and human-readable manner. It is commonly used as the data format of choice in microservices, RESTful APIs, and NoSQL data stores. Knowing how to manipulate JSON is crucial knowledge for any developer.  In this course, discover how to use the Java Enterprise Edition (EE) JSON-Processing API. With its two programming models, JSON-Processing is one of the simplest ways to generate, query, and parse JSON data, and you'll find that implementing it in your projects is quick and easy. Join Alex Theedom as he covers an array of topics, including how to use both the object model and the streaming model, how to traverse a JSON structure, and how to parse JSON data using the extensive builder APIs. When you wrap up this course, you'll be ready to develop with this essential and powerful API.",
      "objectives": [
        "Working with JSON and Java",
        "JSON-Processing API features",
        "The Java EE JSON object model",
        "Creating a model from a JSON string",
        "Building a JSON model",
        "Traversing the JSON model",
        "Outputting the JSON model to a data stream",
        "Parsing and writing JSON data"
      ],
      "skills": ["Software Design", "JSON", "Java"],
      "comments": "A good course on processing JSON with Java, using the JSON-Processing (JSON-P) API. It is similar to other languages' processing of JSON/XML.<br />And while probably not exactly \"test-driven development,\" we did spend a lot of time writing tests to verify that our code worked (as opposed to just \"printing\" out the resultant JSON strings).<br />(We used the IntelliJ IDEA.)",
      "url": "https://www.linkedin.com/learning/json-processing-with-java-ee",
      "certs": ["CertificateOfCompletion_JSONProcessingWithJavaEE_LI.pdf"]
    },
    {
      "index": 63,
      "title": "Introducing Jupyter",
      "instructor": "Josh McQuiston",
      "date_completed": "2021-04-30",
      "date": [
        {
          "$date": "2021-04-30T19:00:00.000Z"
        }
      ],
      "synopsis": "Present your projects like a pro with a new tool, Jupyter Notebook. Jupyter Notebook is an open-source web application that allows you to create and share documents that contain live code, charts and graphics, and descriptive text. It’s ideal for machine learning, statistical modeling, and other projects that require analysis and visualization. Join instructor Josh McQuiston as he shows how to run Jupyter notebooks, streamline workflows, and use common graphs to visualize your data in uncommon ways. The lessons are illustrated with examples based in real data, so you get an accurate picture of the real-world impact Jupyter can make on your development projects.",
      "objectives": [
        "Running a Jupyter notebook",
        "Using shortcuts",
        "Line and cell commands",
        "Visualizing data with plotting",
        "Publishing Jupyter notebooks in GitHub",
        "Presenting your notebooks with the slideshow feature"
      ],
      "skills": ["Data Visualization"],
      "comments": "I used Jupyter Notebooks in prior courses that I've taken here - <i>pandas Essential Training</i> and <i>Docker for Data Scientists.</i> During the pandas Essential Training course, I explored Jupyter Notebooks on my own, to see more of how they work, and what all was available. That led me to take this course, dedicated to this topic.<br />We covered all parts of the interface, the different modes, some good keyboard shortcuts, and Line/Cell Magic Commands, which among other things, allow for loading, running, and writing/saving external Python scripts in a Notebook.<br />As in the pandas Essential Training course, we covered plotting (graphs), sometimes more in-depth.<br />Finally, we exported our Notebook in different formats - HTML, PDF, and as an HTML Slideshow.",
      "url": "https://www.linkedin.com/learning/introducing-jupyter",
      "certs": ["CertificateOfCompletion_IntroducingJupyter_LI.pdf"]
    },
    {
      "index": 62,
      "title": "pandas Essential Training",
      "instructor": "Jonathan Fernandes",
      "date_completed": "2021-04-28",
      "date": [
        {
          "$date": "2021-04-28T19:00:00.000Z"
        }
      ],
      "synopsis": "pandas is an open-source library that provides high-performance, easy-to-use data structures, and data analysis tools for Python. In this intermediate-level, hands-on course, learn how to use the pandas library and tools for data analysis and data structuring. Instructor Jonathan Fernandes dives into topics such as DataFrames, basic plotting, indexing, and groupby. To help you learn how to work with data more effectively, Jonathan takes you through a series of exercises that are based on the same large, public data set: the Olympic medal winners from 1896 to 2008.",
      "objectives": [
        "DataFrames",
        "Working with plots",
        "Boolean indexing",
        "String handling",
        "Indexing",
        "Grouping data",
        "Reshaping",
        "Creating your own colormaps"
      ],
      "skills": ["Pandas (Software)", "Data Analysis"],
      "comments": "I'd used <i>pandas</i> in the last course I took here, <i>Data Ingestion with Python</i> - that was mainly in scripts, using, for example, Visual Studio Code.<br />In this course, our vehicle was a <i>Jupyter Notebook.</i> I'd used those before, in a <i>Docker for Data Scientists</i> course here, but that was mainly just setting up a Container to use as a dev environment.<br />In our Jupyter Notebook here, we used <i>matplotlib</i> for plotting our data (results), as well as <i>Seaborn,</i> a data visualization library based on matplotlib.<br />We used a nice dataset - the Olympic medal winners from all of the Olympics from 1896 - 2008 - their countries, events, etc., which allowed us to glean various insights.",
      "url": "https://www.linkedin.com/learning/pandas-essential-training",
      "certs": ["CertificateOfCompletion_pandasEssentialTraining_LI.pdf"]
    },
    {
      "index": 61,
      "title": "Data Ingestion with Python",
      "instructor": "Miki Tebeka",
      "date_completed": "2021-04-21",
      "date": [
        {
          "$date": "2021-04-21T19:00:00.000Z"
        }
      ],
      "synopsis": "A sizable portion of a data scientist's day is often spent fetching and cleaning the data they need to train their algorithms. In this course, learn how to use Python tools and techniques to get the relevant, high-quality data you need. Instructor Miki Tebeka covers reading files, including how to work with CSV, XML, and JSON files. He also discusses calling APIs, web scraping (and why it should be a last resort), and validating and cleaning data. Plus, discover how to establish and monitor key performance indicators (KPIs) that help you monitor your data pipeline.",
      "objectives": [
        "Describe the characteristics of different data types and the work of data scientists.",
        "Describe different data serialization formats and explain how to use them in Python.",
        "Define APIs and explain how to use them with Python to make http calls, interpret JSON, and utilize message queues.",
        "Explain what web scraping is and describe ways to do it.",
        "Define what a schema is and describe characteristics of schemas and how they influence operations.",
        "Describe the characteristics of different types of databases.",
        "Categorize types of errors and explain how to correct them.",
        "Explain design criteria for data systems and describe how to monitor performance using KPIs."
      ],
      "skills": [
        "Python (Programming Language)",
        "Data Management",
        "Data Ingestion",
        "Data Cleaning"
      ],
      "comments": "I learned a lot from this course. Even though I hope to further understand what was behind all that we were doing, in the future, I did get more practice with <i>pandas</i> (a data analysis and manipulation library/tool for Python), as we used it throughout the course.<br />I also now have some nice Docker Containers - for <i>Nats,</i> a messaging system; a <i>Redis</i> key-value data store; a <i>Neo4j</i> Graph Database, for relationships; and one for an <i>ElasticSearch</i> document database.<br />I got some good experience working with CSV, JSON, and XML files, and APIs, as well as with various types of databases and a few Web scraping packages.<br /><br />The instructor spent little if any time about getting some of the environments set up, so I struggled mightily with that - sometimes for every lesson. Along with the fact that some things in the accompanying files were wrong. Fortunately, in the Q&A area, other students helped with some of these problems, and I also used the Internet at large to resolve other issues. So, if any of you take this course and need help with such issues, please feel free to hit me up...",
      "url": "https://www.linkedin.com/learning/data-ingestion-with-python",
      "certs": [
        "CertificateOfCompletion_DataIngestionWithPython_LI.pdf",
        "CertificateOfCompletion_DataIngestionWithPython_NASBA.pdf"
      ]
    },
    {
      "index": 60,
      "title": "Learning JDBC",
      "instructor": "Frank P Moley III",
      "date_completed": "2021-04-15",
      "date": [
        {
          "$date": "2021-04-15T12:00:00.000Z"
        }
      ],
      "synopsis": "Whether developers want to build mobile device apps for Android or web-based or desktop-based applications with the core Java SDK from Oracle, they must contend with the fact that many dynamic applications need to integrate data from a relational database. In this course, Frank Moley helps you get up to speed with the Java Database Connectivity (JDBC) API, showing how to use it to read and manage data from relational databases such as Postgres, Oracle Database, MySQL, and SQL Server in applications programmed with Java. Frank begins by going over key JDBC terminology, the basics of configuring a PostgreSQL database, and how to create the course project. He then provides detailed instructions on how to select and update data, work with transactions, handle exceptions, and more.",
      "objectives": [
        "Deciphering JDBC terminology",
        "Using containerized PostgreSQL",
        "Creating, reading, updating, and deleting data",
        "The Repository pattern",
        "Using stored procedures",
        "Ordering and limiting results",
        "Transactions in JDBC",
        "Handling exceptions"
      ],
      "skills": ["Java"],
      "comments": "When I first learned Java, JDBC didn't even exist yet, so I've been wanting to learn (about) it.<br />We connected to a PostgreSQL database in a Docker Container. I jumped ahead to the lesson in the PostgreSQL Essential Training course here that I have queued up about using a graphical interface, then installed pgAdmin 4 to connect to the database in the container, which made things easier than always using the Linux command line. <br />We coded the CRUD operations, implementing DAOs, including extracting/displaying data from a few table joins in a Master-Detail type of scenario.<br />We also used a stored procedure, covered transactions, and briefly covered exception handling, though not very much deeper than we used in our code.<br />The instructor briefly discussed the Java Persistence API (JPA), for which I already have a couple of courses queued up here, as well as Spring, so I guess I'll be going down more LinkedIn Learning rabbit holes...",
      "url": "https://www.linkedin.com/learning/learning-jdbc",
      "certs": ["CertificateOfCompletion_LearningJDBC_LI.pdf"]
    },
    {
      "index": 59,
      "title": "Cloud Native Development with Node.js, Docker, and Kubernetes",
      "instructor": "Chris Bailey",
      "date_completed": "2021-04-11",
      "date": [
        {
          "$date": "2021-04-11T19:00:00.000Z"
        }
      ],
      "synopsis": "While the vast majority of Node.js apps are deployed and run in the cloud, few leverage all that modern cloud computing platforms have to offer. If you're looking to take the next step in your cloud computing journey, then this course is for you. Join Chris Bailey as he shows developers how to go from merely hosting apps in the cloud to building and deploying cloud native apps. Chris begins by providing an overview of what it means to be cloud native and create Node.js apps that exploit the cloud's features. He then steps through how to take an existing Node.js app and package it with Docker, deploy the app to Kubernetes, and enhance it with cloud native capabilities, including support for self-healing and metrics.",
      "objectives": [
        "Using Node.js in the cloud",
        "Creating a Node.js app",
        "Building a production Dockerfile",
        "Deploying an app to Kubernetes using Helm",
        "Adding self-healing capabilities",
        "Building custom charts and graphs",
        "Adding support for metrics and request tracking"
      ],
      "skills": [
        "Cloud Application Development",
        "Kubernetes",
        "Node.js",
        "Docker Products"
      ],
      "comments": "I saw that a former coworker had taken this course, and I had taken Node.js and Docker courses here, and wanted to learn about Kubernetes. So this sounded like a good course for me...and it was.<br />We created Containers for a nodeserver - in dev and debug \"flavors,\" as well as a \"slim\" production Container.<br />We used Kubernetes to deploy multiple instances of our app (a simple Web site/page, in this case) for load-balancing.<br />We set up a few endpoints so that Kubernetes could check the health of our deployments, to restart as necessary, as well as for metrics.<br />We deployed Prometheus to collect those metrics, and Grafana for a nice graphical dashboard.<br />Finally, we added Zipkin and Jaeger for OpenTracing.<br /><br />As with other courses here, at times it was a bit of a struggle because of newer versions of things that are now available than were used in the course, as well as the pointed-to Web sites for acquiring the various things having changed.",
      "url": "https://www.linkedin.com/learning/cloud-native-development-with-node-js-docker-and-kubernetes/docker-vs-kubernetes",
      "certs": [
        "CertificateOfCompletion_CloudNativeDevelopmentWithNodejsDockerAndKubernetes.pdf"
      ]
    },
    {
      "index": 58,
      "title": "MySQL Essential Training",
      "instructor": "Bill Weinman",
      "date_completed": "2021-04-05",
      "date": [
        {
          "$date": "2021-04-05T19:00:00.000Z"
        }
      ],
      "synopsis": "MySQL is one of the most popular database management systems for small- to medium-sized web projects. In this course, Bill Weinman provides clear, concise tutorials that guide you through creating and maintaining a MySQL database of your own. Bill explores the basic syntax, using SQL statements to insert, update, and delete data from your tables. He also covers creating a new database from scratch, as well as working with data types, operators, and string and mathematical functions. Plus, learn about the key differences between standard SQL and SQL as implemented by MySQL.",
      "objectives": [
        "Writing queries",
        "Creating and updating databases and tables",
        "Data types in MySQL",
        "Using MySQL built-in functions",
        "Working with string and mathematical functions",
        "Differences between MySQL and standard SQL"
      ],
      "skills": [
        "Database Management System (DBMS)",
        "MySQL",
        "Database Administration"
      ],
      "comments": "I wanted to learn how MySQL differs from Standard SQL and from the other SQL flavors that I've used, and to become more familiar with how <i>MySQL Workbench</i> operates.<br />Mission Accomplished.",
      "url": "https://www.linkedin.com/learning/mysql-essential-training-2",
      "certs": ["CertificateOfCompletion_MySQLEssentialTraining_LI.pdf"]
    },
    {
      "index": 57,
      "title": "MySQL Installation and Configuration",
      "instructor": "Bill Weinman",
      "date_completed": "2021-04-03",
      "date": [
        {
          "$date": "2021-03-08T19:19:00.000Z"
        }
      ],
      "synopsis": "Whether you're a developer, a database analyst, or just someone looking to manage data for their small business, having the ability to install and configure MySQL is a professional asset. In this course, join instructor Bill Weinman as he steps through how to install and configure MySQL on various platforms. Bill shows how to install MySQL on a Mac, as well as machines running Windows and Ubuntu Linux. He demonstrates how to create user accounts, assign database access privileges, and manage passwords. Plus, he goes over the different storage engine options in MySQL, including InnoDB.",
      "objectives": [
        "Installing MySQL on macOS, Windows, and Linux",
        "Installing MySQL Workbench",
        "Importing SQL data into MySQL",
        "Creating user accounts",
        "Managing roles",
        "Implementing storage engines",
        "Creating a new database"
      ],
      "skills": ["Database Management System (DBMS)", "MySQL"],
      "comments": "I started taking this instructor's <i>MySQL Essential Training</i> course, and when we got to the part about importing the sample databases, he recommended this course, where he covers that process. (Another trip down a LinkedIn Learning rabbit hole...)<br />So I took a look,  and since I had already done the installation in another course, I zipped through that chapter.<br />I imported the data, and also learned about user accounts, access privileges and roles, and password expiration, which I hadn't before. I created some other users, so I wouldn't be logging in as <i>root,</i> as I had been.<br />We also learned about the different database engines available in MySQL.<br />Now back to the <i>MySQL Essential Training</i> course...",
      "url": "https://www.linkedin.com/learning/mysql-installation-and-configuration",
      "certs": [
        "CertificateOfCompletion_MySQLInstallationAndConfiguration_LI.pdf"
      ]
    },
    {
      "index": 56,
      "title": "Learning Bash Scripting",
      "instructor": "Scott Simpson",
      "date_completed": "2021-04-02",
      "date": [
        {
          "$date": "2021-04-02T19:19:00.000Z"
        }
      ],
      "synopsis": "Bash, or the Bourne Again Shell, is a widely popular command-line interpreter for administration and programming tasks. But Bash is different than most scripting languages. That's why Scott Simpson spends some time in this course running you through the syntax—introducing variables, numbers, and control structures—so you can start writing scripts right away. He shows you how to wrap up multiline operations in one file, implement flow control, and interact with users to get input. Plus, he offers challenges along the way that allow you to put what you've learned to the test.",
      "objectives": [
        "What is Bash?",
        "Understanding Bash script syntax",
        "Creating a basic Bash script",
        "Displaying text with \"echo\"",
        "Working with numbers, strings, and arrays",
        "Reading and writing text files",
        "Working with loops",
        "Using functions",
        "Getting user input during execution",
        "Ensuring a response"
      ],
      "skills": ["Bash", "Shell Scripting"],
      "comments": "Another refresher...<br />I was reminded of some things that I had forgotten - exact syntax, etc. - and got back up to speed.<br />Getting my development system set up, as laid out in this instructor's <i>Learning Windows Subsystem for Linux</i> course here, really helped. I was able to use VS Code on Windows, and execute on a WSL instance of Ubuntu 20.04. This allowed me to use one big script file for each chapter, remarking out each prior lesson's section as I went along. I included comments as to what we were doing and why. And once I completed the course, since I was using WSL, it was trivial to copy the directory there where I saved my scripts over to Windows, since I like saving all of the work I do in these courses here in a central location on my Windows machine.<br />And along the way, I created some command aliases that I wanted on WSL, and also looked up some common/recommended ones online, adding them to my <i>.bashrc</i> file.",
      "url": "https://www.linkedin.com/learning/learning-bash-scripting-2",
      "certs": ["CertificateOfCompletion_LearningBashScripting_LI.pdf"]
    },
    {
      "index": 55,
      "title": "Learning Windows Subsystem for Linux",
      "instructor": "Scott Simpson",
      "date_completed": "2021-03-29",
      "date": [
        {
          "$date": "2021-03-08T19:19:00.000Z"
        }
      ],
      "synopsis": "Windows Subsystem for Linux (WSL) is an optional feature of Windows 10 that provides a Linux environment for developers inside of Windows. Rather than managing your own virtual machine or relying on a remote Linux machine for development, WSL provides a Linux kernel and enables users to install various distros within their Windows environment. In this course, get up to speed with the basics of WSL and explore common tasks and procedures for developing with Linux. Instructor Scott Simpson steps through how to work in the Linux environment, explaining how to use the shell, manage services within WSL, and define automated tasks that run at predefined times. Scott also covers ways to integrate WSL into your workflow, including how to install the Remote-WSL extension to use Visual Studio Code in WSL.",
      "objectives": null,
      "skills": ["IT Service Management", "Windows 10", "Linux"],
      "comments": "OMG, what a wonderful course!<br />I started taking this instructor's Learning Bash Scripting course as a refresher, and he mentioned this course. I took a look, and saw that it covered using Visual Studio Code on Windows, with files on a WSL distribution.<br />We installed Windows Terminal, which offers tabs into PowerShell, the normal Windows Command Line, and WSL distro shells. We configured it to open to a default profile/shell, in my case to a Ubuntu 20.04 WSL instance.<br />Even though I have WSL version 2 installed, my distros were running in WSL 1 mode - we learned how to change them to running in WSL 2 mode.<br />WSL provides seamless file access between Windows and Linux environments, i.e., you have access to the files on both systems at the same time. So, for example, you can run Linux utilities, like awk and grep, etc. against the Windows filesystem.<br />The instructor had us install the Remote-WSL extension in Visual Studio Code - this gave us the ability to have a remote shell into the Linux environment, and create/edit and run scripts there, right from VS Code in Windows.<br />Now back to the Learning Bash Scripting course!",
      "url": "https://www.linkedin.com/learning/learning-windows-subsystem-for-linux",
      "certs": [
        "CertificateOfCompletion_LearningWindowsSubsystemForLinux_LI.pdf"
      ]
    },
    {
      "index": 54,
      "title": "Blockchain Basics",
      "instructor": "Jonathan Reichental, Ph.D.",
      "date_completed": "2021-03-27",
      "date": [
        {
          "$date": "2021-03-27T05:37:00.000Z"
        },
        {
          "$date": "2021-03-27T06:25:00.000Z"
        }
      ],
      "synopsis": "We're on the precipice of a radical and disruptive new way of conducting all manner of transactions over the Internet. While still in its infancy, blockchain technology demands attention. In this introductory-level course, learn what blockchain is and what it might mean to you. Jonathan Reichental—named one of the world's top 100 CIOs in 2017—dives into blockchain technology from a conceptual perspective. The course is primarily non-technical by design, intended for those working in business leadership positions, data science, and IT management.  Jonathan begins by describing some of the current challenges with the Internet, including existing risks and security problems such as identity management. Next, he describes how traditional online databases function, so that you have a basis for how the blockchain redesigns this function. He then describes how the blockchain becomes a potential solution for many of the existing limitations of online databases. Since the blockchain has its genesis in Bitcoin—the digital currency—he provides some background on that too. He also discusses how blockchain technology actually offers new capabilities beyond simply solving old problems. To wrap up the course, Jonathan shares steps you can take in your organization to understand the implications of the blockchain.",
      "objectives": [
        "Explain what Captcha does.",
        "List the core benefits of a traditional database.",
        "Assess whether Bitcoin requires any intermediaries in a transaction or not.",
        "Explain why blockchain technology is useful beyond cryptocurrency.",
        "Identify some ways to reduce the risk of blockchain innovation."
      ],
      "skills": ["Databases", "Big Data", "Blockchain"],
      "comments": "As with the IoT (Internet of Things), which I also took a course here about, I wanted to find out what THIS was all about. And this is a good introduction for that.<br />This course covers how (a) Blockchain works, its advantages and disadvantages, and presents the possibilities (far more than just cryptocurrency transactions), obstacles, and risks.<br />And as this course was from a few years ago, some of the things mentioned have already come to pass, e.g., the recent purchase of a(n) NFT for a piece of digital art.",
      "url": "https://www.linkedin.com/learning/blockchain-basics",
      "certs": [
        "CertificateOfCompletion_BlockchainBasics_LI.pdf",
        "CertificateOfCompletion_BlockchainBasics_NASBA.pdf"
      ]
    },
    {
      "index": 53,
      "title": "Designing RESTful APIs",
      "instructor": "Keith Casey",
      "date_completed": "2021-03-26",
      "date": {
        "$date": "2021-03-26T19:00:00.000Z"
      },
      "synopsis": "Having a solid understanding of how to correctly build APIs is important for any developer planning on creating websites. In this course, learn how to plan and model your own APIs, and explore the six REST design constraints that help guide your architecture. Keith Casey starts with a simple overview, including advice on identifying the users or \"participants\" of your system, and the activities they might perform with it. He discusses how to validate your design before you build it, and explores the HTTP concepts and REST constraints needed to build your API. To wrap up, Keith goes over some of the most common API design patterns you may encounter.",
      "objectives": [
        "Approaches to adding an API",
        "Modeling tips",
        "Identifying activities and breaking them into steps",
        "Mapping activities to verbs and actions",
        "Creating and grouping API methods",
        "Validating your API",
        "HTTP headers and response codes",
        "Common design challenges",
        "Versioning best practices",
        "Hypermedia and documentation approaches"
      ],
      "skills": ["REST APIs", "RESTful architecture"],
      "comments": "A LOT of good information in this course.<br />While it (necessarily) presented information (HTTP Response Codes and the six constraints for REST APIs) also covered in the Learning REST APIs course here that I recently completed, this course went deeper.<br />We spent more time on Headers, and a lot of time on the processes of planning and designing. We also got into versioning and documentation.<br />I think that the key takeaway for me was the need for constant INPUT.<br />And I was reminded again, that the more I learn, the more I find that I didn't know, and the more I need to learn...",
      "url": "https://www.linkedin.com/learning/designing-restful-apis/",
      "certs": ["CertificateOfCompletion_Designing RESTful APIs_LI.pdf"]
    },
    {
      "index": 52,
      "title": "Learning Node.js",
      "instructor": "Alex Zanfir",
      "date_completed": "2021-03-25",
      "date": {
        "$date": "2021-03-25T19:00:00.000Z"
      },
      "synopsis": "Node.js is a platform built on the Chrome JavaScript runtime that can help you build fast, scalable network applications. Node.js uses an event-driven, non-blocking I/O model that makes it lightweight and efficient—perfect for data-intensive real-time applications that run across distributed devices. In this course, learn the basics of Node.js, and discover how to build a simple application. Alexander Zanfir goes into topics such as npm, reading and writing files, and Node.js frameworks. He covers Node.js features, such as async/await, and dives into popular web development concepts. Alexander also walks through how to build a demo chat app from start to finish.",
      "objectives": [
        "Asynchronous tasks and callbacks",
        "Benefits and features of JavaScript",
        "Managing third-party packages with npm",
        "Node.js frameworks",
        "Static serving with Express",
        "Creating a browser app",
        "Exploring databases",
        "Saving data to MongoDB with Mongoose",
        "Error handling and debugging",
        "Simple tests and async tests"
      ],
      "skills": [
        "Front-end Development",
        "Node.js",
        "Back-End Web Development"
      ],
      "comments": "A great course!<br />I'd used Node.js a little, taking the <i>Polyglot Web Development</i> course here. This got much deeper into things, also explaining <i>npm</i> (originally short for Node Package Manager) and <i>package.json</i> files.<br />As in the Polyglot... course, we used the <i>Express Server.</i> We also used <i>Mongoose</i> here, to connect to a MongoDB database.<br />The instructor had us create a free (Atlas) MongoDB Cloud account. That was cool, as I also put one of my local MongoDB databases up there, to use in the future for programming learning/experimenting.<br />We made API endpoints and used them to create a simple chat app, storing the messages in a MongoDB database (for persistence), and used <i>Socket.IO</i> for two-way communication, to \"push\" the messages back.<br />We then used <i>Jasmine</i> to create testing scripts to test our API, and and finished with an intro to test-first/test-driven development.",
      "url": "https://www.linkedin.com/learning/learning-node-js-2017",
      "certs": ["CertificateOfCompletion_Learning Nodejs_LI.pdf"]
    },
    {
      "index": 51,
      "title": "Learning REST APIs",
      "instructor": "Morten Rand-Hendriksen",
      "date_completed": "2021-03-19",
      "date": {
        "$date": "2021-03-19T00:00:00.000Z"
      },
      "synopsis": "Learn the basics of REST APIs. In this course, discover what REST APIs are, why they matter, and how putting them to use can help you build faster, more efficient applications. Review how HTTP and REST APIs relate, explore the six constraints of REST, and learn about HTTP status messages. Learn how to get started with consuming REST APIs to incorporate them into data-driven applications.",
      "objectives": [
        "What is a REST API?",
        "Who or what interacts with REST APIs?",
        "Anatomy of a REST request",
        "HTTP status messages",
        "Request/response pairs",
        "GET, POST, and DELETE"
      ],
      "skills": [
        "REST APIs",
        "Front-end Development",
        "Application Programming Interfaces",
        "Back-End Web Development"
      ],
      "comments": "I've been using and writing Web APIs - this course gets into the nitty-gritty of what's going on with REST APIs, and how they work...",
      "url": "https://www.linkedin.com/learning/learning-rest-apis",
      "certs": ["CertificateOfCompletion_Learning REST APIs_LI.pdf"]
    },
    {
      "index": 50,
      "title": "Polyglot Web Development",
      "instructor": "Kirsten Hunter",
      "date_completed": "2021-03-19",
      "date": {
        "$date": "2021-03-19T00:00:00.000Z"
      },
      "synopsis": "Knowing multiple programming languages—and being able to pick up new ones quickly—makes you a more competitive and flexible web developer and freelancer. In this course, learn how to quickly pick up new web development languages and frameworks, including Node.js, Python, Perl, and Ruby. Discover the unique value each language brings, and how to build on what you already know. Plus, get hands-on practice with each language.",
      "objectives": [
        "Why become a polyglot programmer?",
        "Exploring Node.js, Python, Perl, and Ruby code",
        "Building on prior knowledge to learn new programming languages",
        "Learning API read and write functionality in Node.js, Python, Perl, and Ruby",
        "Implementing API functionality in Node.js, Python, Perl, and Ruby"
      ],
      "skills": [
        "Python (Programming Language)",
        "MongoDB",
        "Polyglot",
        "Application Programming Interfaces",
        "Node.js",
        "Back-End Web Development",
        "Perl",
        "Ruby"
      ],
      "comments": "Excellent course, where we wrote Web APIs, pulling data from a MongoDB database, in Node.js, Python, Perl, and Ruby.<br />The instructor provided a Docker Container where everything was installed, and also provided direction to install the different platforms on our own OS.<br />So I did both - installed everything on Windows, and used the Container.<br />Wanting to have a consistent platform between the Container and my own installations, I decided to use the provided Dockerfile to build my own up-to-date Docker Image to create a Container from. Since things had changed from the time that the Dockerfile was created, I had a lot to figure out to make changes to build successfully.<br />The instructor also provided a Web page (HTML file) to have an interface which used the Web APIs to add, delete and update records from the MongoDB database. So I used this as a starting point, along with updating the Ruby code we ended up with, to modify that Web page to use with one of my own databases that I have in MongoDB.",
      "url": "https://www.linkedin.com/learning/polyglot-web-development",
      "certs": ["CertificateOfCompletion_Polyglot Web Development_LI.pdf"]
    },
    {
      "index": 49,
      "title": "Python: XML, JSON, and the Web",
      "instructor": "Joe Marini",
      "date_completed": "2021-03-12",
      "synopsis": "Python is a powerful tool for working with data stored on web servers. In this course, Joe Marini demonstrates how to use Python to send, retrieve, and deliver web-based data to users. Learn how XML and JSON are used to store and exchange data, see how to use Python to retrieve XML and JSON data over the web, and find out how to parse that data using a range of different Python modules and features. Joe also shows how to fetch data from URLs and retrieve and send data via HTTP using the Python Requests library.",
      "objectives": [
        "Overview of XML and JSON",
        "Retrieving and sending data over the internet",
        "Handling errors",
        "Using the Requests library to exchange data",
        "Working with JSON data",
        "Parsing XML data",
        "XML DOM parsing"
      ],
      "skills": ["Python (Programming Language)"],
      "comments": "Good course on using Python to exchange data over the Internet, and in processing the XML or JSON data returned.<br />We connected to a Web site that had endpoints for using/testing GET, POST, etc., commands.<br />I appreciated that we were provided with a Docker command to run a Container of the site, so that the site could be used locally (i.e., disconnected from the Internet.) So I created Containers that used Port 80 and another port that didn't conflict with my IIS or Apache. And I added to the code in the Exercise Files here, so that I could switch between the live Web site and either of the two Containers.<br />We used Python's <i>urllib</i> module and also a third-party library, <i>Requests.</i><br />We used the <i>json</i> module for working with JSON data, and the <i>xml.sax</i> API (Simple API for XML) for working with XML.<br />For XML DOM processing, we used <i>xml.dom.minidom,</i> and the ElementTree API (<i>etree</i>) in the <i>lxml</i> third-party library.<br />We used the <i>pip</i> tool (pip3) to install the Requests library and the lxml library (for its ElementTree API (etree)).",
      "url": "https://www.linkedin.com/learning/python-xml-json-and-the-web",
      "certs": ["CertificateOfCompletion_Python XML JSON and the Web_LI.pdf"]
    },
    {
      "index": 48,
      "title": "JavaScript and JSON: Integration Techniques",
      "instructor": "Ray Villalobos",
      "date_completed": "2021-03-08",
      "date": {
        "$date": "2021-03-08T19:19:00.000Z"
      },
      "synopsis": "JavaScript Object Notation (JSON) has replaced XML as the core way of sharing data, especially when it comes to JavaScript, since it's so much faster, sleeker, and easier to parse. In this course, dive into working with JSON tools, designing JSON objects, and using different ways to handling JSON data. Author Ray Villalobos also shows how to use AJAX and jQuery to parse your data and feeds, and shows JavaScript and JSON in action in a real-world practical application.",
      "objectives": [
        "What is JSON?",
        "Creating simple data",
        "Debugging JavaScript objects in the browser",
        "Communicating across sites with JSONP",
        "Rotating with jQuery Cycle"
      ],
      "skills": ["Front-end Development", "JavaScript", "JSON"],
      "comments": "Another good course - a companion course to this instructor's JavaScript and AJAX: Integration Techniques course.<br /> We covered using online JSON validation tools, and debugging JavaScript objects in the browser.<br />We also covered looping through JavaScript objects and accessing objects in arrays, for processing after bringing the JSON file in as a JavaScript object.<br />We learned a cool workaround for accessing (online) JSON files, where a file from another domain can cause problems due to cross-domain policy (<a href=\"https://www.w3schools.com/js/js_json_jsonp.asp\" target=\"_blank\">JSONP</a>).<br />Finally, we finished up with a project that used the Mustache.js logicless template library, in conjunction with the jQuery Cycle library, along with CSS styling to polish it up.",
      "url": "https://www.linkedin.com/learning/javascript-and-json-integration-techniques",
      "certs": [
        "CertificateOfCompletion_JavaScript and JSON Integration Techniques_LI.pdf"
      ]
    },
    {
      "index": 47,
      "title": "JavaScript and AJAX: Integration Techniques",
      "instructor": "Ray Villalobos",
      "date_completed": "2021-03-06",
      "synopsis": "The ability to read data and communicate information asynchronously is fundamental to modern web applications. In this course, author Ray Villalobos takes a look at integrating AJAX (Asynchronous JavaScript and XML) with JavaScript and jQuery—a combination that makes it easy to work with dynamic data and reduces the number of requests to the server. The course first explains what AJAX is, and shows how to load and reload pages with pure JavaScript, update the DOM, and read and parse data in the XML and JSON formats. Next, learn how to read and write information between the server and the client with AJAX methods in jQuery, and build a dynamic search application that updates search results as you type.",
      "objectives": [
        "What is AJAX?",
        "Making requests asynchronous",
        "Updating the DOM with getElementById",
        "Reading JSON files",
        "Working with jQuery and AJAX",
        "Sending and searching JSON data",
        "Incorporating CSS transitions"
      ],
      "skills": ["AJAX", "Front-end Development", "JavaScript"],
      "comments": "Excellent course about creating dynamic Web pages using AJAX.<br />We fed data from plain text, XML and (mostly) JSON files to Web pages.<br />And we worked with jQuery, making the calls simpler.<br />We created a page with a live search (with the search results from JSON data narrowing as the user typed into a search box), finishing up with a lot of CSS to style the page and its elements, including animations and transitions.",
      "url": "https://www.linkedin.com/learning/javascript-and-ajax-integration-techniques",
      "certs": [
        "CertificateOfCompletion_JavaScript and AJAX Integration Techniques_LI.pdf"
      ]
    },
    {
      "index": 46,
      "title": "Advanced PHP: Debugging Techniques",
      "instructor": "Jon Peck",
      "date_completed": "2021-03-03",
      "synopsis": "Debug your PHP code efficiently with a variety of client and server-side tools. In this concise course for experienced PHP developers, author Jon Peck demonstrates how to leverage PHP's built-in tools, as well as the Xdebug and Firebug extensions, and FirePHP libraries to improve the quality of your code and reduce troubleshooting overhead.  This course covers installation of Xdebug on Apache as well as working with the NetBeans IDE (integrated development environment). Jon then introduces native web browser developer tools for Firefox and Chrome, and demonstrates browser independent web debugging tools. Best practices for debugging and profiling web application failures and performance issues are also covered.",
      "objectives": [
        "Configuring PHP error reporting",
        "Logging errors to file",
        "Gracefully handling fatal errors",
        "Installing Xdebug",
        "Understanding the principles of remote debugging",
        "Remote debugging with NetBeans",
        "Extending your browser with Firebug, FirePHP, or ChromePHP"
      ],
      "skills": ["Xdebug", "PHP", "Back-End Web Development"],
      "comments": "This is a very informative and helpful course, but since it is dated (2012) parts of it took some work and digging to get through it (more on that in a bit...)<br />We configured PHP (in php.ini) to report errors, logged those errors to a file and sent in email, and learned how to gracefully handle them.<br />We installed and used Xdebug (in NetBeans) - displaying variables, used step-debugging, and set up profiling.<br />Xdebug was where some of my struggle occurred - the course was made with Xdebug 2, and Xdebug 3 is the current version, and what I used. Some of the functions used in the course were no longer available (not just deprecated, but non-existent). But I did eventually realize the version difference, and found this page: <a href=\"https://xdebug.org/docs/upgrade_guide\" target=\"_blank\">Upgrading from Xdebug 2 to 3</a>.<br />That helped me with the functions, and when I struggled for quite a while getting the step-debugging connecting, I noticed the part about the port changing between versions. Well, THAT explained it! And I got it going...<br />We also covered browser extensions for PHP debugging, and I found the one for Chrome, <i>ChromePHP,</i> the most (currently) useful.<br />And, once again, I set up the Exercise Files on Apache and IIS Web Servers in Windows.",
      "url": "https://www.linkedin.com/learning/advanced-php-debugging-techniques",
      "certs": [
        "CertificateOfCompletion_Advanced PHP Debugging Techniques_LI.pdf"
      ]
    },
    {
      "index": 45,
      "title": "Docker for Data Scientists",
      "instructor": "Jonathan Fernandes",
      "date_completed": "2021-02-25",
      "synopsis": "In a field where reproducible results are essential, Docker is rapidly emerging as one of the top tools for bringing efficiency to the work that data science teams—particularly those working in machine learning (ML)—are doing. Creating and developing ML models is often messy. Seasoned data scientists know that different versions of the same software can produce different results. With Docker, you can include the right versions of each needed dependency and library, so no one ever has to do any configuration. After the Dockerfile is built, you'll have exactly what you need. In this course, Jonathan Fernandes helps data scientists get up and running with Docker, demonstrating how to build a Dockerized ML application that can easily be shared. Along the way, he shares common use cases for the tool. Upon wrapping up this course, you'll be prepared to leverage the power of containers in your other ML projects.",
      "objectives": [
        "Why Docker is gaining prominence",
        "Running a container",
        "Docker under the hood",
        "Working with Dockerfiles",
        "Uploading images to Docker Hub",
        "Common use cases for Docker"
      ],
      "skills": [
        "Python (Programming Language)",
        "Machine Learning",
        "Containerization",
        "Docker Products"
      ],
      "comments": "I did a mini-run on some more Docker, drilling in some more on Docker commands, Dockerfiles, etc.<br />We created a development environment Image with Python <i>(Miniconda), pandas, seaborn,</i> and <i>Jupyter</i> (along with data).<br />We then created Containers, exposing a port that could be connected through, and automatically running commands to open up a Jupyter notebook.",
      "url": "https://www.linkedin.com/learning/docker-for-data-scientists",
      "certs": ["CertificateOfCompletion_Docker for Data Scientists_LI.pdf"]
    },
    {
      "index": 44,
      "title": "Docker for .NET Developers with Visual Studio",
      "instructor": "Lee Brandt",
      "date_completed": "2021-02-24",
      "synopsis": " Docker—a popular software containerization platform—can streamline the development process by speeding up the setup and configuration of environments. If you're a .NET developer who wants to employ containers in your application environment, this course can help by demonstrating how to leverage Docker in your workflow. Instructor Lee Brandt begins by discussing the role of Docker in the container world, and then goes over basic concepts, including how to run a container from a Docker image, and how to list and remove containers. Lee then walks through a sample project to lend a real-world context to essential Docker tasks, including how to add a Dockerfile to a Visual Studio project, and how to build a Docker image from a Dockerfile. He wraps up the course by discussing how to work with the Docker Compose file format.",
      "objectives": [
        "Why containers?",
        "How do containers compare to virtual machines?",
        "Creating a Dockerfile",
        "Building an image from a Dockerfile",
        "Running a container from a new image",
        "Working with the Docker Compose file format",
        "Pushing images to Docker Hub"
      ],
      "skills": ["Docker Products", "Visual Studio"],
      "comments": "We created an Image and Container from a (provided) Web API Solution, creating a Dockerfile and a Docker Compose file, and pushed the Image to Docker Hub.",
      "url": "https://www.linkedin.com/learning/docker-for-dot-net-developers-with-visual-studio",
      "certs": [
        "CertificateOfCompletion_Docker for .NET Developers with Visual Studio_LI.pdf"
      ]
    },
    {
      "index": 43,
      "title": "Learning PHP",
      "instructor": "Joe Casabona",
      "date_completed": "2021-02-23",
      "synopsis": "PHP is still one most popular server-side languages used to build dynamic websites, powering everything from Facebook to Wikipedia. And although it is not especially difficult to use, nonprogrammers often find it intimidating. This introductory course was designed to change that by teaching you PHP through a series of clear, focused, and easy-to-follow lessons. After briefly explaining what PHP is, instructor Joe Casabona introduces the features of the language. He covers variables, control structures, calculations, loops, and functions, as well as includes and error handing, in a series of hands-on exercises. He then moves on to more advanced topics, including how to maintain state with sessions and cookies. Upon wrapping up this course, you'll have the skills you need to start developing and maintaining interactive websites using PHP.",
      "objectives": null,
      "skills": ["PHP", "Back-End Web Development"],
      "comments": "We covered the usual things for learning a language, such as variables, arrays, loops, functions, and objects, etc.<br />We also covered including external files and troubleshooting.<br />A LOT of time was spent on Forms - the form elements, validating for required fields, and validating and sanitizing the input.<br />We also sent email of the inputted data - Since I don't have an email server set up, I had to edit the php.ini file(s) for my Apache and IIS to use my Time Warner email account(s).<br />We finished up with reading and writing files, and using cookies and session variables.",
      "url": "https://www.linkedin.com/learning/learning-php-4",
      "certs": ["CertificateOfCompletion_Learning PHP_LI.pdf"]
    },
    {
      "index": 42,
      "title": "Advanced Java Programming",
      "instructor": "Bethan Palmer",
      "date_completed": "2021-02-18",
      "synopsis": "Want to get more out of the Java language and platform? In this platform- and framework-neutral course, instructor Bethan Palmer digs into some of the language’s more advanced features, helping you expand your programming skills as she equips you with techniques you can use when building applications anywhere Java is used: in web, mobile, and desktop applications. Bethan covers a variety of topics, including generics, working with the Collections Framework, and functional programming. Plus, learn about I/O in Java, working with files and directories, and structuring applications using the modular system available in Java.",
      "objectives": [
        "Installing the NetBeans IDE",
        "Using generic methods in Java",
        "Using wildcards in generic programming",
        "Implementing a queue with a LinkedList",
        "Functional programming in Java",
        "Multi-threading",
        "Working with I/O in Java",
        "Managing files and directories"
      ],
      "skills": ["Software Development", "Java"],
      "comments": "In this course, we used the Apache NetBeans IDE. It's OK - the instructor didn't cover its workings/capabilities at all, so I can't really compare it to IntelliJ, beyond that it also works.<br />We covered Generics, and more on Collections, such as using a LinkedHashMap (similar to a Dictionary in other languages, but linked).<br />We also covered more on Functions, including method references, streams (as opposed to I/O streams, although we covered those as well) and parallel streams.<br />We covered modular structures and working with multiple modules, along with threading and multi-threading, and finished up with files and directories.",
      "url": "https://www.linkedin.com/learning/advanced-java-programming-2",
      "certs": ["CertificateOfCompletion_Advanced Java Programming_LI.pdf"]
    },
    {
      "index": 41,
      "title": "C#: Interfaces and Generics",
      "instructor": "Joe Marini",
      "date_completed": "2021-02-10",
      "synopsis": "Take your C# coding skills to the next level by learning to use interfaces and generics in this course with programming expert Joe Marini. Interfaces provide a way of implementing common types of behaviors that can be reused across multiple classes. Interfaces keep your code nimble, compact, and efficient. Generics, on the other hand, help you work with strongly typed data collections, without having to commit to a data type ahead of time. Used in combination, these features make your C# projects easier to build and scale, with fewer bugs and performance issues along the way. Start watching to learn how to integrate interfaces and generics into your projects today.",
      "objectives": [
        "Designing and implementing an interface",
        "Implementing multiple interfaces",
        "Using .NET-defined interfaces",
        "Understanding how generics improve program reliability",
        "Exploring .NET's generic data collection classes"
      ],
      "skills": ["Object-Oriented Programming (OOP)", "C#"],
      "comments": "This course covered specifying and enforcing behavior(s) with Interfaces, both custom and the built-in .NET Interfaces.<br />It also covered Generics, as in this instructor's C#: Collections course. However, the programming challenge here was a bit more involved, as we used Delegates more so than in that course, and it involved using multiple Collection types in the same solution.",
      "url": "https://www.linkedin.com/learning/c-sharp-interfaces-and-generics",
      "certs": ["CertificateOfCompletion_C Interfaces and Generics_LI.pdf"]
    },
    {
      "index": 40,
      "title": "C#: Delegates, Events and Lambdas",
      "instructor": "Joe Marini",
      "date_completed": "2021-02-07",
      "synopsis": "C# provides function types to fit a variety of scenarios, called delegates, events, and lambda functions. In this course, Joe Marini explores these key elements, starting with delegates, which allow developers to easily separate functional pieces of a program. Joe shows how to create both anonymous and composable delegates, using a shipping costs calculator as a practical example. Next, he covers using events to broadcast and listen to messages both inside and outside a program, switching functionality on and off on demand. Finally, the course explores lambda functions: concise ways to declare small and focused or one-off functions, which keep your program code tight and efficient.  Start watching to learn how to adapt this flexible set of programming tools to your own C# programming needs.",
      "objectives": null,
      "skills": ["Object-Oriented Programming (OOP)", "C#"],
      "comments": "In the C#: Collections course I took here by this same (excellent) instructor, which covered mostly Generic Collections, we used some Lambda expressions. I was unfamiliar with them, but in that context, it was straightforward enough for me to catch on.<br />He recommended his course, C#: Interfaces and Generics, so I started that one. Towards the beginning of that course, he mentioned that if we were unfamiliar with Delegates, which I was familiar with only in passing, to take this course.<br />Seeing that this course also covered Lambdas, I was able to get a better grasp of them, along with Delegates, which are quite versatile and powerful. We also covered (raising and) handling Events, as an offshoot of Delegates, in a context outside of handling UI Events such as mouse clicks, etc.<br />Now, back to the C#: Interfaces and Generics course...",
      "url": "https://www.linkedin.com/learning/c-sharp-delegates-events-and-lambdas",
      "certs": ["CertificateOfCompletion_C Delegates Events and Lambdas_LI.pdf"]
    },
    {
      "index": 39,
      "title": "C#: Collections",
      "instructor": "Joe Marini",
      "date_completed": "2021-02-04",
      "synopsis": "Efficiently manage data with C# collection classes. In this course, join Joe Marini as he details how to maintain collections of data in C# and choose the right collection class to apply to a wide set of programming scenarios. Joe begins by covering basic concepts, including the difference between generic and non-generic collections and how to select a collection class to suit a specific programming problem. He then goes over basic collection classes, including how to use a LinkedList, and discusses specialized collections such as OrderDictionary and StringCollection.",
      "objectives": [
        "Selecting a collection class",
        "Basic list operations",
        "How stacks operate on elements",
        "Using dictionary classes",
        "Using the ListDictionary and HybridDictionary collections",
        "Using StringCollection"
      ],
      "skills": ["C#"],
      "comments": null,
      "url": "https://www.linkedin.com/learning/c-sharp-collections",
      "certs": ["CertificateOfCompletion_C Collections_LI.pdf"]
    },
    {
      "index": 38,
      "title": "Leading without Formal Authority",
      "instructor": "Lisa Earle McLeod and Elizabeth Lotardo",
      "date_completed": "2021-02-01",
      "synopsis": "Leadership isn't just a skill for managers. Demonstrating leadership is important for employees at every level of an organization. There are opportunities to lead every day, whether you hold a formal leadership position or not. In this course, leadership and personal development experts Lisa Earle McLeod and Elizabeth Lotardo outline how individual contributors or SMEs can exhibit leadership by influencing, inspiring, mentoring, and motivating others. They also help you overcome unique challenges such as how to communicate when you think your boss or team is headed in the wrong direction.",
      "objectives": [
        "Name three ways that you can add value to a meeting.",
        "Recognize the benefits of including emotional impact in your stories.",
        "Explain how developing a mindset can increase efficiency and productivity.",
        "Identify an easy way to reinforce expectations.",
        "Determine when it is necessary team to tell your boss about a mistake made by a peer.",
        "Recall the most important benefit of punctuality."
      ],
      "skills": ["Communication", "Accountability", "Leadership"],
      "comments": "I had a role for many years where I had leadership responsibility, but without formal authority. So it was nice to see that there was actually a course about this.<br />I found that I had grown into doing some things right, had \"grown\" away from doing some other things right, and learned some new things from this course.",
      "url": "https://www.linkedin.com/learning/leading-without-formal-authority",
      "certs": [
        "CertificateOfCompletion_Leading without Formal Authority_LI.pdf"
      ]
    },
    {
      "index": 37,
      "title": "Excel: Lookup Functions in Depth",
      "instructor": "Dennis Taylor",
      "date_completed": "2021-01-29",
      "synopsis": "Microsoft Excel offers a variety of powerful lookup functions that allow you to easily retrieve information across spreadsheets. In this course, Excel expert Dennis Taylor demystifies some of the most significant lookup functions. Tune in to learn how to use the new XLOOKUP function, which can handle all the capabilities of the widely used VLOOKUP and HLOOKUP functions, in addition to providing more power and flexibility. Explore uses of the MATCH function and the newer, more robust XMATCH function to match up data, and learn how to extract data using the INDEX function. Discover how to restructure the lists being searched to ensure that you're using each function efficiently, and learn about dynamic array lookup functions like UNIQUE, SORT, SORTBY, and FILTER. Along the way, Dennis shares practical examples that help you grasp how to implement these functions in your workflow.",
      "objectives": null,
      "skills": ["Data Analysis", "Microsoft Excel"],
      "comments": "The last one, for now, on my roll of Excel courses here - a good refresher, along with some good new info.<br />I'd used VLOOKUP(), HLOOKUP(), and MATCH(), etc., before, but not XLOOKUP() and XMATCH(), new for 365.<br />I have Office 2019 Pro, so to get the X Functions, I had to download a beta version of the Add-in from GitHub.<br />The X Functions mostly worked using that Add-in, but since 2019 doesn't implement Dynamic Arrays, I had to find and use workarounds in some formulas.<br />And I was unable to follow along with the last chapter (except for the very last lesson), because the functions discussed were Dynamic Array functions, so were not available for me using 2019.<br />(But I did watch them all, anyway... ;^ ) )",
      "url": "https://www.linkedin.com/learning/excel-lookup-functions-in-depth",
      "certs": [
        "CertificateOfCompletion_Excel Lookup Functions in Depth_LI.pdf"
      ]
    },
    {
      "index": 36,
      "title": "Excel: Power Pivot for Beginners",
      "instructor": "Joshua Rischin",
      "date_completed": "2021-01-27",
      "synopsis": "The Power Pivot feature in Microsoft Excel for Windows allows you to import, merge, and analyze data from many sources. Many people assume Power Pivot is a complex feature reserved for advanced users. Not so! In this short course, instructor Josh Rischin debunks myths around Power Pivot, explaining what it is and the best way to use it. Josh walks you through building a basic data model by identifying your data sources and creating data relationships. Then he shows how to analyze the data and present your results using PivotTables and PivotCharts.",
      "objectives": null,
      "skills": ["Data Management", "Data Analysis", "Microsoft Excel"],
      "comments": "Learning more about PivotTables, etc., using the Power Pivot component, which I had to add to Excel as a COM Add-in.<br />Power Pivot allows one to add a Data Model, drawing from various sources, and easily set up Relationships between the sources. Calculations and Measures can also be added.<br />This course did cover PivotCharts, including using Filters and Slicers.",
      "url": "https://www.linkedin.com/learning/excel-power-pivot-for-beginners",
      "certs": [
        "CertificateOfCompletion_Excel Power Pivot for Beginners_LI.pdf",
        "CertificateOfCompletion_Excel PivotTables for Beginners_PMI.pdf"
      ]
    },
    {
      "index": 35,
      "title": "Excel: PivotTables for Beginners",
      "instructor": "Dave Ludwig",
      "date_completed": "2021-01-26",
      "synopsis": "PivotTables don't have to be scary! This powerful Excel feature cuts the time you spend on formulas in half. In this concise course, Excel trainer Dave Ludwig demystifies PivotTables and shows you how to get started using them to analyze your data. Dave begins by explaining two PivotTable basic building blocks: value fields and row fields. Then he shows you how to adjust a PivotTable by adding fields, filters, and formatting. Finally, Dave shows you how to use special filter buttons which are known as slicers, and he also demonstrates how to use timelines. At the end, he goes over the basics of refreshing and updating a PivotTable.",
      "objectives": [
        "Describe when you would use a PivotTable.",
        "List the things you need to do prior to creating a PivotTable.",
        "Explain the benefits of creating an Excel table before creating a PivotTable.",
        "Describe a conceptual representation of the value field.",
        "Cite the reason you should periodically refresh a PivotTable."
      ],
      "skills": ["Pivot Tables", "Business Analytics", "Microsoft Excel"],
      "comments": "I knew of PivotTables, and had a boss that lived in them, but hadn't used them myself. Turns out, they are a simple-to-use, powerful feature.<br />The interface for specifying the fields is like that used in Report Builder for SQL Server Reporting Services. In the course I took for that here, we didn't do much (if any) with Column Fields, so I was able to get a little experience with those here in this course. And it's nice to see the results immediately in Excel, without the need to run a report first, as in SSRS.<br />This course did not cover PivotCharts, but there are other courses here that do, and this course was a good, quick intoduction to PivotTables.<br />In any case, I'm now getting another tool in my toolbox...",
      "url": "https://www.linkedin.com/learning/excel-pivottables-for-beginners",
      "certs": [
        "CertificateOfCompletion_Excel PivotTables for Beginners_LI.pdf",
        "CertificateOfCompletion_Excel PivotTables for Beginners_NASBA.pdf"
      ]
    },
    {
      "index": 34,
      "title": "Implementing a Data Warehouse SQL Server 2019",
      "instructor": "Adam Wilbert",
      "date_completed": "2021-01-19",
      "synopsis": "Dimensional models like data warehouses can provide a more accessible and consistent form of data storage than relational databases. You can consolidate data from multiple sources into a single repository for business intelligence, analysis, and reporting. This course explains how to create a long-term data storage solution using local SQL Server instances and Azure SQL Data Warehouse. Instructor Adam Wilbert shows how to build a data warehouse from the ground up, starting with the tables and views; establish control flow; enforce data quality; and use your data in services such as SQL Server Reporting Services and Power BI. By the end of the course, you will be able to implement a robust, custom solution to serve all your organization’s business intelligence, reporting, and analysis needs.",
      "objectives": [
        "Transactional databases vs. data warehouses",
        "Star and snowflake schemas",
        "Creating a data warehouse",
        "Designing tables and views",
        "Rebuilding columnstore indexes",
        "Creating an Azure SQL Data Warehouse",
        "Establishing control flow beyond ETL",
        "Enforcing data quality",
        "Configuring Master Data Services",
        "Consuming data from the warehouse in BI services"
      ],
      "skills": [
        "Database Design",
        "Data Warehousing",
        "Data Warehouse Architecture",
        "Microsoft SQL Server"
      ],
      "comments": "This is a great, info-filled course.<br />I was somewhat aware of data warehouses. Some coworkers had used \"reporting\" databases, but I don't know if those were built using a dimensional model, as we learned about here, or still in a (normalized) relational model.<br />Along with creating a data warehouse on a local instance of SQL Server, we also created a data warehouse on the Azure cloud, and moved the schema and data there.<br />We installed SQL Server Data Quality Services, and learned about cleansing data and creating a custom knowledge base for that. De-duping is also available with DQS.<br />We also installed and configured Master Data Services, which aims to keep data consistent throughout data sources for an organization.<br />We also used the MDS Client, and installed, configured, and used the MDS Excel add-in.",
      "url": "https://www.linkedin.com/learning/implementing-a-data-warehouse-sql-server-2019",
      "certs": [
        "CertificateOfCompletion_Implementing a Data Warehouse SQL Server 2019_LI.pdf"
      ]
    },
    {
      "index": 33,
      "title": "IoT Foundations: Fundamentals",
      "instructor": "Bruce Sinclair",
      "date_completed": "2021-01-18",
      "synopsis": "The Internet of Things (IoT) is more than just smart or connected devices. In this course, learn what IoT is, and how it works from a technical standpoint. Bruce Sinclair provides a broad overview of IoT, explaining each of its main components. He also goes into the software-defined product—the digital twin of the physical product—as well as the hardware-defined product, explaining how sensors and embedded systems help to gather data. Plus, he dives into the network fabric, and explains what external systems are and why it's important to consider them when designing an IoT product.",
      "objectives": [
        "IoT value modeling",
        "The software-defined product",
        "The hardware-defined product",
        "Embedded systems",
        "Connected sensors",
        "The network fabric",
        "OT IT and fog networks",
        "Analytics and big data",
        "Data services"
      ],
      "skills": ["Internet of Things (IoT)"],
      "comments": "With the IoT being a burgeoning area, I wanted to get an idea of what was going on.<br />And this is a good intro for that, mainly with realizing where the value comes in, as opposed to just smart or connected products.",
      "url": "https://www.linkedin.com/learning/iot-foundations-fundamentals",
      "certs": ["CertificateOfCompletion_IoT Foundations Fundamentals_LI.pdf"]
    },
    {
      "index": 32,
      "title": "SQL Server: Reporting Services",
      "instructor": "Adam Wilbert",
      "date_completed": "2021-01-18",
      "synopsis": "Discover how to build, edit, and publish interactive reports using Reporting Services in SQL Server. In this course, author Adam Wilbert shows how to create, format, and share reports that leverage a variety of data sources. First, he takes you through the setup process, followed by the step-by-step process of building a report. He covers interactive elements, formatting, charts, sorting, filtering, web viewing, and mobile viewing. Adam also shares best practices, tips, and tricks that you can use to ensure your reports are dynamic.",
      "objectives": [
        "What is SQL Server Reporting Services (SSRS)?",
        "Installing and setting up SSRS",
        "Configuring a report server",
        "Joining data tables",
        "Filtering and sorting data",
        "Grouping data in a report",
        "Working with matrixes",
        "Using aggregate functions",
        "Working with parameters",
        "Displaying charts and sparklines",
        "Creating device-specific layouts",
        "Viewing reports in the Power BI mobile app",
        "Reusing report parts"
      ],
      "skills": [
        "SQL Server Reporting Services (SSRS)",
        "Business Intelligence (BI)",
        "Microsoft SQL Server"
      ],
      "comments": "This was a very informative and even FUN course!<br />And what a great tool!<br />Years ago, when I worked at an R.O.P., I created the tables and charts used in the yearly financial presentation for the board. Then, I used Borland Quattro Pro for Windows (spreadsheet), and while it was powerful in its own right, it took a lot of manipulation to get things to look as I and my superiors were aiming for.<br />Oh, how I wish I had had a tool like this back then!<br />In this course, we installed and configured SSRS, used its Web Portal, and installed and used Report Builder and Mobile Report Publisher. Then, installing the Power BI app on my mobile devices, I was able to connect to the Report Server with them to view the Mobile Reports created.<br />I want to explore more with these Mobile Reports.<br />We also set up subscriptions to (non-mobile) reports.",
      "url": "https://www.linkedin.com/learning/sql-server-reporting-services",
      "certs": ["CertificateOfCompletion_SQL Server Reporting Services_LI.pdf"]
    },
    {
      "index": 31,
      "title": "SQL Server Integration Services",
      "instructor": "Adam Wilbert",
      "date_completed": "2021-01-15",
      "synopsis": "SQL Server Integration Services (SSIS) is one of the core add-on components to SQL Server. With SSIS, professionals can create automated workflows that streamline the process of consolidating data from a wide variety of sources. Through a process called ETL—extract, transform, and load—you can ingest and move data between systems such as other databases, flat data files, and even online repositories. In this course, Adam Wilbert helps you get up and running with SSIS. Adam shows how to work with different control flow tasks, data sources, connections, and transformations. Plus, see how to add variables to control package execution, run packages with T-SQL, and more.",
      "objectives": [
        "Managing and administering SQL with SSIS tasks",
        "Making packages dynamic with variables and parameters",
        "Creating a sequence container",
        "Extracting data from a source",
        "Handling errors",
        "Running packages with T-SQL",
        "Scheduling packages with SQL Server Agent"
      ],
      "skills": [
        "Database Administration",
        "Microsoft SQL Server",
        "SQL Server Integration Services (SSIS)"
      ],
      "comments": "Wow, Microsoft has really done a great job here!<br />I had used the old DTS Packages feature/component to periodically populate a backup internal KB database, and to schedule (using SQL Server Agent) a Full-Text Index job to run nightly so that new KB Articles could be searched/returned.<br />But now, the packages are designed in Visual Studio and deployed from there into Microsoft SQL Server Management Studio. And the Visual Studio environment for this is wonderful! And powerful!",
      "url": "https://www.linkedin.com/learning/sql-server-integration-services-2",
      "certs": [
        "CertificateOfCompletion_SQL Server Integration Services_LI.pdf"
      ]
    },
    {
      "index": 30,
      "title": "Learning MongoDB",
      "instructor": "Justin Jenkins",
      "date_completed": "2021-01-08",
      "synopsis": "Excelling in an ever-changing software development world requires true \"full stack\" experience. Knowledge of nonrelational databases in particular adds exciting new capabilities and features that make everyday development easier, more streamlined, and vastly more scalable. This course provides an introduction to using MongoDB, one of the most popular nonrelational databases. Discover how to create documents to store data, organize documents in collections, and write queries to read, update, and delete documents. Instructor Justin Jenkins also shows how to properly index data to increase performance in MongoDB, and then shows how MongoDB can be integrated with applications written in Python, Node.js, and PHP. In the final chapter, he covers basic server administration, including replication, sharding, security, and backups. Make sure to practice your newfound MongoDB skills using the challenge and solution sets issued along the way.",
      "objectives": [
        "Installing MongoDB on Windows and macOS",
        "Creating documents and collections",
        "Working with operators and arrays",
        "Writing queries to update and delete data",
        "Creating basic indexes",
        "Coding with MongoDB and PHP, Node.js, and PHP",
        "Maintaining MongoDB",
        "Implementing security",
        "Backing up and restoring MongoDB"
      ],
      "skills": ["MongoDB", "Database Development", "Full-Stack Development"],
      "comments": "I wanted to learn about a NoSQL database. MongoDB is a NoSQL database, and is a document database. (<a href=\"https://www.mongodb.com/document-databases/\" target=\"_blank\">What is a Document Database?</a>)<br />I got more experience composing and using JSON, as MongoDB stores its data as BSON (Binary JSON). (<a href=\"https://www.mongodb.com/json-and-bson\" target=\"_blank\">JSON and BSON</a>)<br />Coding with MongoDB was one of the topic areas covered - in Python, Node.js, and PHP. To do this I had to install drivers for each of my installations of those, to connect them to MongoDB.<br />MongoDB seems very cool, I really enjoyed this course, and I want to delve more into it...",
      "url": "https://www.linkedin.com/learning/learning-mongodb/modern-database-and-application-design-with-mongodb",
      "certs": ["CertificateOfCompletion_Learning MongoDB_LI.pdf"]
    },
    {
      "index": 29,
      "title": "SAP ERP Essential Training (2018)",
      "instructor": "Justin Valley",
      "date_completed": "2021-01-07",
      "synopsis": "The SAP ERP, or enterprise resource planning, platform helps large businesses streamline their processes and support each segment of their business, from sales to financial accounting. In this course, instructor Justin Valley helps you get started with SAP ERP, going over key concepts and tips that can help you use this enterprise software most effectively. Justin goes over the difference between technical modules and functional modules in SAP and explores key SAP modules, including SAP project systems (PS) and SAP human capital management (HCM). He also goes over how to navigate inside SAP as an end user, use various search methods to find data, run and export reports from SAP, and more.",
      "objectives": [
        "Differentiate between master data and transactional data.",
        "List different inventory modules in SAP.",
        "Explain general menu navigation in SAP.",
        "Describe basic report setup in SAP.",
        "Determine basic report printing in SAP."
      ],
      "skills": ["SAP ERP"],
      "comments": "Learned a bit about an ERP system that I hadn't used...",
      "url": "https://www.linkedin.com/learning/sap-erp-essential-training-2018",
      "certs": [
        "CertificateOfCompletion_SAP ERP Essential Training 2018_LI.pdf",
        "CertificateOfCompletion_SAP ERP Essential Training 2018_NASBA.pdf"
      ]
    },
    {
      "index": 28,
      "title": "HTML5: Geolocation",
      "instructor": "Bill Weinman",
      "date_completed": "2021-01-03",
      "synopsis": "This course shows how to add location tracking to a web application with a combination of JavaScript, CSS and HTML5. First, author and HTML5 expert Bill Weinman provides a thorough explanation of the geolocation API, including considerations every developer should take into account, such as data dependability, power usage, and privacy concerns. The course then covers how to detect support for geolocation, retrieve coordinates from a device (whether once or continuously), handle errors, and integrate the results with Google Maps to create a location-aware web application that will run on many mobile browsers.",
      "objectives": [
        "Understanding how geolocation works",
        "Detecting geolocation support",
        "Getting coordinates",
        "Continuous tracking with watchPosition()",
        "Integrating geolocation with Google Maps"
      ],
      "skills": ["Geographic Information Systems (GIS)", "HTML"],
      "comments": "I had to (finally) add a self-signed certificate to my IIS to get SSL working, so that the browsers (especially on my other devices) would allow for using my location.<br />      And I've started doing the same for Apache, which is a bit more of a chore...",
      "url": "https://www.linkedin.com/learning/html5-geolocation",
      "certs": ["CertificateOfCompletion_HTML5 Geolocation_LI.pdf"]
    },
    {
      "index": 27,
      "title": "Python Essential Training",
      "instructor": "Bill Weinman",
      "date_completed": "2021-01-01",
      "synopsis": "Due to its power and simplicity, Python has become the scripting language of choice for many large organizations, including Google, Yahoo, and IBM. A thorough understanding of Python 3, the latest version, will help you write more efficient and effective scripts. In this course, Bill Weinman demonstrates how to use Python 3 to create well-designed scripts and maintain existing projects. This course covers the basics of the language syntax and usage, as well as advanced features such as objects, generators, and exceptions. Learn how types and values are related to objects; how to use control statements, loops, and functions; and how to work with generators and decorators. Bill also introduces the Python module system and shows examples of Python scripting at work in a real-world application.",
      "objectives": [
        "Python anatomy",
        "Types and values",
        "Conditionals and operators",
        "Building loops",
        "Defining functions",
        "Python data structures: lists, tuples, sets, and more",
        "Creating classes",
        "Handling exceptions",
        "Working with strings",
        "File input/output (I/O)",
        "Creating modules",
        "Integrating a database with Python db-api"
      ],
      "skills": ["Python (Programming Language)"],
      "comments": "Drilling it in...",
      "url": "https://www.linkedin.com/learning/python-essential-training-2018",
      "certs": ["CertificateOfCompletion_Python Essential Training_LI.pdf"]
    },
    {
      "index": 26,
      "title": "Cloud Computing Careers and Certifications: First Steps",
      "instructor": "Lynn Langit",
      "date_completed": "2020-12-24",
      "synopsis": "Do you want to start a career in cloud computing, but don't know where to begin? Whether you’re an IT professional or a computer science student, this course can help by providing an ideal foundational mapping of the career paths and certifications that you should consider if you're interested in transitioning to cloud computing. Instructor and cloud architect Lynn Langit covers a variety of career paths, including IT pro, developer, analyst, and architect roles. Throughout the course, she focuses on the major cloud platforms—AWS, Microsoft Azure, Google, and Alibaba—discusses certifications available for each, and explores the future of cloud computing careers. Lynn discusses machine learning, virtualization, networking, scripting, and more.",
      "objectives": null,
      "skills": ["Cloud Computing", "IT Management"],
      "comments": null,
      "url": "https://www.linkedin.com/learning/cloud-computing-careers-and-certifications-first-steps-2",
      "certs": [
        "CertificateOfCompletion_Cloud Computing Careers and Certifications First Steps_LI.pdf"
      ]
    },
    {
      "index": 25,
      "title": "Visual Studio Code for Python Developers",
      "instructor": "Joe Marini",
      "date_completed": "2020-12-21",
      "synopsis": "Visual Studio (VS) Code—the optimized code editor for Windows, macOS, and Linux—provides stellar support for Python right out of the box. Even if you’re already familiar with VS Code, this course can help you speed up your development work by highlighting how to best leverage this popular code editor when developing Python apps. Instructor Joe Marini covers everything from writing and debugging Python code, to using the built-in refactoring tools to make your code easier to maintain, to maximizing your productivity with must-have extensions such as REST Client. After wrapping up this course, you’ll have the knowledge you need to make the most out of VS Code when working with Python projects.",
      "objectives": [
        "Constructing a simple Python program in VS Code",
        "Editing, formatting, and refactoring Python code",
        "Debugging Python code",
        "Setting breakpoints",
        "Using Python docstring",
        "Creating better comments for your source code",
        "Using the REST Client extension"
      ],
      "skills": [
        "Python (Programming Language)",
        "Microsoft Visual Studio Code"
      ],
      "comments": "I had taken the Learning Python course by this same instructor, and am in the middle of a long Python Essential Training course (by a different instructor). That course uses Komodo Edit, so I am following along using that, but I prefer Visual Studio Code. It can be used on Mac, Windows and Linux, and for various languages.<br /><br />So I took this course, which led us to set up VS Code for use with Python. It included setting up a Debugging configuration (along with actual debugging), and installing VS Code Extensions for auto-formatting, for documenting and commenting, and for a REST client, which can generate code (in various languages) to plug in to our own projects.<br /><br />I configured my VS Code installations on my Mac mini, Windows laptop, and 5 Hyper-V Linux VMs.",
      "url": "https://www.linkedin.com/learning/visual-studio-code-for-python-developers",
      "certs": [
        "CertificateOfCompletion_Visual Studio Code for Python Developers_LI.pdf"
      ]
    },
    {
      "index": 24,
      "title": "jQuery for Web Designers",
      "instructor": "Joe Chellman",
      "date_completed": "2020-12-19",
      "synopsis": "JavaScript is the programming language of the web. But some problems are a little difficult to solve using 100% pure JavaScript. jQuery closes most of the gaps, and does it so well that a huge number of developers now use jQuery to create some of the coolest front-end plugins around. This course will help web designers learn how to use jQuery's core library and plugins to create richer, more usable sites—faster and more efficiently than with JavaScript alone. It features real-world examples and some easily learned best practices, while covering jQuery basics such as functions, classes, event binding, and data manipulation. Author and developer Joe Chellman shows how to install and customize popular plugins and offers some compelling use cases for jQuery-based (vs. CSS-based) animation.",
      "objectives": [
        "When to use jQuery",
        "Installing jQuery",
        "Setting up functions",
        "Using jQuery classes",
        "Modifying the DOM",
        "Event binding",
        "Reading and setting values",
        "Integrating plugins",
        "Animating websites with jQuery"
      ],
      "skills": ["Front-end Development", "jQuery"],
      "comments": "Another informative course!<br />The jQuery library can make things easier to do than in Vanilla JavaScript.<br />We used it in Web Forms, and also used the Colorbox plugin (which enhances lightboxes (used for displaying images, etc.)).<br />Then we finished up with Animations, and were then provided with further sources for acquiring Plugins, and learning more about jQuery and JavaScript.",
      "url": "https://www.linkedin.com/learning/jquery-for-web-designers",
      "certs": ["CertificateOfCompletion_jQuery for Web Designers_LI.pdf"]
    },
    {
      "index": 23,
      "title": "JavaScript for Web Designers",
      "instructor": "Joe Chellman",
      "date_completed": "2020-12-13",
      "synopsis": "Web designers can improve their skill sets and job prospects by getting comfortable with JavaScript. It's the only scripting language for client-side programming—for doing things that would be impossible with HTML and CSS alone—and is increasingly popular for server-side programming, too. Learn some basic, real-world uses for JavaScript in this course with Joe Chellman. Find out how to write JavaScript in the browser and in a code editor, and then put it straight to use in a store checkout page: manipulating forms and form fields, reading data, checking input for errors, and displaying the results of shipping calculations. Plus, learn how to use JavaScript time and date functions to create features like clocks, and add interactive content through APIs like Bing Maps.",
      "objectives": [
        "What is JavaScript?",
        "Writing and debugging JavaScript",
        "Interacting with the DOM",
        "Working with forms with JavaScript",
        "Using JavaScript to track dates and times",
        "Creating maps with the free Bing Maps API",
        "Fetching data from a third-party API"
      ],
      "skills": ["Front-end Development", "JavaScript", "Web Design"],
      "comments": "Excellent course!<br />I started the course, jQuery for Web Designers, and although I had taken the Learning the JavaScript Language course by this same instructor, it was presented in a way that was application agnostic, so I paused and took this course, by the same instructor (Joe Chellman), which focuses on the Web design context. And I'm glad I did!<br />We worked on Web Forms, including validating input, and working with dates and times, including using a third-party library for their formatting.<br />We also embedded a Bing Map on a page, then went further, to creating and controlling one using the Bing Maps API.<br />We finished up by using the Ziptastic API to aid users/customers by filling in the city and state info on a form for them, given a Zip Code, and then using the Axios library to handle the JSON data returned from the Ziptastic request.<br />Now, back to the jQuery course!",
      "url": "https://www.linkedin.com/learning/javascript-for-web-designers-3",
      "certs": ["CertificateOfCompletion_JavaScript for Web Designers_LI.pdf"]
    },
    {
      "index": 22,
      "title": "SQL Tips, Tricks, & Techniques",
      "instructor": "Ben Sullins",
      "date_completed": "2020-11-28",
      "synopsis": "Get Ben Sullins's 12 must-have SQL techniques for data science pros—engineers, DevOps, data miners, programmers, and other systems specialists. Ben's tips focus on practical applications of SQL queries for data analysis. Learn how to retrieve data, join tables, calculate rolling averages and rankings, work with dates and times, use window functions, aggregate and filter data, and much more. Each tip is short, relevant, and up to date with current industry best practices—making this the perfect course for busy analysts who normally struggle to find time to build their skills.",
      "objectives": null,
      "skills": ["Big Data", "SQL"],
      "comments": "I saw that some former Kofax coworkers had taken this course, so I checked it out as a refresher.<br />It was that, and much more! He presented some very nice techniques!<br />Having maintained and extensively used a database feeding a knowledge base, I had minimal need for aggregations as presented here, but some of this would have really helped for enhancing our reporting on the activity.",
      "url": "https://www.linkedin.com/learning/sql-tips-tricks-techniques",
      "certs": ["CertificateOfCompletion_SQL Tips Tricks Techniques_LI.pdf"]
    },
    {
      "index": 21,
      "title": "Learning JavaScript Debugging",
      "instructor": "Joe Chellman",
      "date_completed": "2020-11-27",
      "synopsis": "Whether you're new to coding or an experienced developer, bugs are an inevitable part of web development. Debuggers can make the task of finding and fixing those bugs much easier. In this course, learn how to work with a debugger to efficiently locate and resolve issues in your JavaScript projects. Instructor Joe Chellman provides a language-centered guide to dealing with the complexities involved in creating for the largest distributed platform out there: the web. He covers why we need debuggers, goes over notable jargon and concepts, and steps through the basics of using a debugger. He then takes a look at debugging in practice, sharing how to debug a React application in Chrome, how to debug on iOS using Simulator, how to debug a WordPress theme in Visual Studio Code, and more.",
      "objectives": [
        "Understanding the need for a debugger",
        "Debuggers in web browsers",
        "Basic debugger concepts",
        "Debugging the use of a jQuery plugin",
        "Remote debugging on an Android device",
        "Debugging a node application in WebStorm",
        "Using a debugger as a learning tool on a live site"
      ],
      "skills": ["JavaScript"],
      "comments": "This is a very informative course - from debugging inside various Web browsers, to hooking up Visual Studio Code to automatically launch Chrome for debugging, to using the (Xcode) Simulator on iOS.<br />We went over debugging jQuery plug-ins, React apps, and a WordPress theme.<br />Since the instructor had us set up live Web sites for some of the lessons, and he used MAMP (Apache/MySQL/PHP) on a Mac, I'm glad I installed MAMP on my Mac mini in an earlier course I took here. I also set up those Web sites in Apache on Windows, in IIS there as well, and in Apache on an Ubuntu Server Hyper-V VM.",
      "url": "https://www.linkedin.com/learning/learning-javascript-debugging-2",
      "certs": ["CertificateOfCompletion_Learning JavaScript Debugging_LI.pdf"]
    },
    {
      "index": 20,
      "title": "Succeeding in Web Development: Full Stack and Front End",
      "instructor": "Ray Villalobos",
      "date_completed": "2020-11-20",
      "synopsis": "Do you want to become a web developer? Nowadays, web development isn't one job. There is a range of technologies and career options to explore. The core responsibilities are split two ways—between front-end developers who specialize in websites and applications and back-end developers who work with servers and databases—but you can also become a full-stack developer who oversees all aspects of a project. This course provides a map of the core technologies and advice about mastering them, complemented with the details you need to connect them to jobs. Senior staff author Ray Villalobos also provides tips on finding training, getting hired, and maximizing your earning potential in this lucrative and exciting field.",
      "objectives": [
        "Types of web developers",
        "The role of HTML, CSS, and JavaScript",
        "Server technologies",
        "Getting web development training",
        "Choosing the right tools",
        "Getting a job",
        "Negotiating your salary"
      ],
      "skills": ["Web Development", "Full-Stack Development"],
      "comments": null,
      "url": "https://www.linkedin.com/learning/succeeding-in-web-development-full-stack-and-front-end",
      "certs": [
        "CertificateOfCompletion_Succeeding in Web Development Full Stack and Front End_LI.pdf"
      ]
    },
    {
      "index": 19,
      "title": "Innovative Customer Service Techniques",
      "instructor": "Jeff Toister",
      "date_completed": "2020-11-20",
      "synopsis": "Help customer service teams unlock hidden potential and take customer service to new levels. In this course, designed to benefit managers and frontline employees alike, instructor Jeff Toister shares research and offers insight into what elite customer service professionals know and do, and discusses the two basic needs of every customer. Find out how social pressure can affect quality of service, learn what highly motivated customer service employees have in common, and discover ways to encourage people to work together as a team.",
      "objectives": [
        "Identifying the most important need",
        "Using positive language",
        "Making wait time more bearable",
        "Improving powers of observation",
        "Overcoming the illusion of speed",
        "Reducing the negative impact of multitasking",
        "Avoiding directed-attention fatigue"
      ],
      "skills": ["Small Business Management", "Customer Service"],
      "comments": null,
      "url": "https://www.linkedin.com/learning/innovative-customer-service-techniques",
      "certs": [
        "CertificateOfCompletion_Innovative Customer Service Techniques_LI.pdf",
        "CertificateOfCompletion_Innovative Customer Service Techniques_PMI.pdf"
      ]
    },
    {
      "index": 18,
      "title": "Learning Docker",
      "instructor": "Arthur Ulfeldt",
      "date_completed": "2020-11-20",
      "synopsis": "Docker is the next step beyond virtualization. A Docker image contains everything it needs to run, independent of the Linux server on which it lives: a copy of the operating system, a database, code, configuration files, dependencies, and so on. Images can also be packaged and shared with other Docker admins. Arthur Ulfeldt uses Docker to run complex systems with millions of users and hundreds of containers. Here, he shares his knowledge with you. He introduces the basics of Docker, including its containers, Dockerfiles (or base images), and capabilities for networking, data management, infrastructure optimization, and more. Watch and learn how to build your own containers, as well as how to network and link containers.",
      "objectives": [
        "Installing Docker on Mac, Windows, and Linux",
        "Understanding the Docker flow",
        "Running processes in containers",
        "Managing, networking, and linking containers",
        "Working with Docker images, volumes, and registries",
        "Building Dockerfiles",
        "Managing networking and namespaces with Docker",
        "Building entire systems with Docker"
      ],
      "skills": ["Cloud Computing", "Cloud Development", "Docker Products"],
      "comments": "This one took me a while, because there are slight differences in Docker between Linux, Mac, and Windows, and I wanted to be familiar with, or at least aware of, those differences. So I did several of the lessons on all of those three platforms.<br /><br />After I had created several Linux VMs a while back, I became aware of Containers. I read a little bit about them, but at the time, didn't see the purpose (for ME, anyway), nor the full capabilities. So I didn't feel like getting into them at that point.<br /><br />Then I noticed that some of my former coworkers at Kofax had taken this course, so I looked up the course and saw that it dealt with Containers, and it looked like Docker was a cool way of dealing with them.<br /><br />Containers can be used for quickly pulling up a Linux instance (Image-->Container) for testing something out, to Containers working together to accomplish something, to groups of Containers comprising a full-fledged application, or for setting up a development environment, etc.",
      "url": "https://www.linkedin.com/learning/learning-docker-2018",
      "certs": ["CertificateOfCompletion_Learning Docker_LI.pdf"]
    },
    {
      "index": 17,
      "title": "Learning GitHub",
      "instructor": "Aaron Stewart and GitHub",
      "date_completed": "2020-11-09",
      "synopsis": "GitHub is the industry-standard tool for collaborating on and sharing code. It’s popular among software developers, project managers, designers, and students for its flexibility and control. This course introduces GitHub and Git, the version control system that GitHub is built upon. Instructor Aaron Stewart, a training content specialist at GitHub, explains the benefits of version control, how to navigate GitHub and the command line, how GitHub and Git are related, and the best practices for communication and collaboration on GitHub. Aaron also reviews the most common tasks, such as branching, commits, and pull requests, and shows you how to create a simple local project and move it to GitHub to share with your team. Once you have completed the course, you should be able to immediately start using Git and GitHub to manage your own code.",
      "objectives": [
        "What is GitHub?",
        "The GitHub workflow",
        "Using the command line",
        "Creating branches",
        "Making a commit",
        "Creating and merging pull requests",
        "Working locally with GitHub Desktop",
        "Creating a new project",
        "Moving the project to GitHub",
        "Working with teams on GitHub",
        "Creating task lists",
        "Formatting text"
      ],
      "skills": ["Git", "GitHub", "Version Control"],
      "comments": "I ran across GitHub when following something about Python training which took me there. I didn't end up taking that course there (yet) but did take a Python course here on LinkedIn Learning, and am in progress on a couple more. I'll go back and check out that initial Python course on GitHub...<br /><br />And in other courses I've taken here, we obtained the Exercise Files from GitHub. The instructors provided enough info for us to do THAT, but I wasn't sure what all was going on.<br />I was also exposed to GitHub in some courses using Visual Studio Code, but only briefly.<br /><br />So I wanted to learn a bit about it, and this course did fit the bill - we learned about Git and GitHub, using the Command Line, GitHub Desktop, and the GitHub Web site.",
      "url": "https://www.linkedin.com/learning/learning-github",
      "certs": ["CertificateOfCompletion_Learning GitHub_LI.pdf"]
    },
    {
      "index": 16,
      "title": "Learning C++",
      "instructor": "Erin Colvin",
      "date_completed": "2020-11-04",
      "synopsis": "C++ is an efficient and versatile programming language. C++ powers systems software, desktop applications, and even video games, and it's the language that helped land humans on the moon. Simply put, C++ is a must-know for any modern-day programmer—and it's a great place to get started if you're programming for the first time. This course will get you up and running fast. Instructor Erin Colvin covers simple data types, including numbers and strings; flow-control features like loops and if, else, and switch statements; and functions, the code that encapsulates tasks your program performs. Dr. Colvin also covers working with files and special data structures such as classes and linked lists. Each chapter is full of practical code examples and challenges to help you practice your C++ skills.",
      "objectives": [
        "Getting set up to code",
        "Creating your first simple program with C++",
        "Variables and arrays",
        "Flow control with if statements and loops",
        "Functions",
        "Opening and editing files",
        "Data structures"
      ],
      "skills": ["C++"],
      "comments": "Another refresher...<br />We were also introduced to (and used) the Dev-C++ IDE.",
      "url": "https://www.linkedin.com/learning/learning-c-plus-plus-3",
      "certs": ["CertificateOfCompletion_Learning CPP_LI.pdf"]
    },
    {
      "index": 15,
      "title": "C# & .NET: Programming",
      "instructor": "Alexander Zanfir",
      "date_completed": "2020-10-23",
      "synopsis": "If you've programmed in C#, you've already used part of .NET. Microsoft's object-oriented language is an integral part of the framework. But there are many other features of .NET that can make your development workflow more productive and efficient. This training course will help you learn the essentials of .NET programming with C#—techniques that use .NET features to write richer, cleaner code. Alexander Zanfir explains how to use collections, make your app more responsive with async programming, assign and change class properties, optimize performance with multithreading, and inject data into strings. Plus, learn how to handle errors and manage application resources more efficiently with the using statement.",
      "objectives": [
        "What is .NET?",
        "Creating a local application vs. a web application",
        "Using collections to group objects",
        "Changing program flow with async programming",
        "Using class properties",
        "Optimizing applications with multithreading",
        "Injecting data with string interpolation",
        "Error handling",
        "Managing resources with the using statement"
      ],
      "skills": [".NET Framework", "C#"],
      "comments": "While I'd pretty much just \"picked up\" C# in Extended/Continuing Ed .NET courses (ASP, ADO, XML Web Services) I've taken, it was nice to take a dedicated course.<br />It was a good refresher, and I learned a lot of new things.<br />It was also nice to see and use the current features in Visual Studio 2019 (Community).",
      "url": "https://www.linkedin.com/learning/c-sharp-dot-net-programming",
      "certs": ["CertificateOfCompletion_C .NET Programming_LI.pdf"]
    },
    {
      "index": 14,
      "title": "Java Essential Training: Objects and APIs",
      "instructor": "David Gassner",
      "date_completed": "2020-10-20",
      "synopsis": "If you want to build applications for mobile devices, desktop computers, or the web, you need to know Java—and keep your knowledge up to date as the language evolves. Java 9 is changing quite a few important aspects of the programming workflow, particularly the handling of objects and APIs. This course is the second in the Java Essential Training series, which provides the foundation for learning Java 9. Instructor David Gassner starts by showing how to debug Java code in IntelliJ IDEA, and handle any exceptions that occur. He explains how to create custom classes and understand how Java implements inheritance, a core principle of object-oriented programming. Plus, learn how to store data in memory with the Java Collections Framework, extend Java with popular APIs, make network requests, and package your applications for deployment in JAR files.",
      "objectives": [
        "Debugging Java code",
        "Handling exceptions",
        "Creating custom classes",
        "Working with inheritance",
        "Managing data collections",
        "Using Java packages and libraries",
        "Preparing a Java application for deployment"
      ],
      "skills": ["Java"],
      "comments": "More Java refreshment... And some new things (that I knew in other languages, but hadn't done in Java).<br />And deeper into the IntelliJ IDEA - it is wonderful! Keyboard shortcuts; it signals about possible Exceptions, then can be directed to wrap statements/sections in Try/Catch blocks. Will automatically import packages when they are used. Can generate code for \"Getter\" and \"Setter\" methods in Classes. And more!",
      "url": "https://www.linkedin.com/learning/java-essential-training-objects-and-apis",
      "certs": [
        "CertificateOfCompletion_Java Essential Training Objects and APIs_LI.pdf"
      ]
    },
    {
      "index": 13,
      "title": "Learning Java",
      "instructor": "Kathryn Hodge",
      "date_completed": "2020-10-17",
      "synopsis": "Java is one of the top five programming languages, and is used for websites, embedded controllers, and Android app development. Interested in learning how to code with Java? Join instructor Kathryn Hodge as she helps you get up and running with this popular language. Kathryn covers all the basics: data types, strings, functions, and loops. She helps you control the flow and logic of your code, and debug your project to make sure it runs perfectly. Along the way, she provides real-world examples and introduces challenges that allow you to practice your new skills. This course is perfect for developers who need to get up to speed with Java fast, as well as for beginning programmers who want their first taste of this popular language.",
      "objectives": null,
      "skills": ["Software Development", "Java"],
      "comments": "I wanted a Java refresher (syntax, etc.).<br />It started out VERY basic, but did get into Classes. And we did learn a little about debugging in the IntelliJ IDEA IDE (which the instructor introduced us to).",
      "url": "https://www.linkedin.com/learning/learning-java-4",
      "certs": ["CertificateOfCompletion_Learning Java_LI.pdf"]
    },
    {
      "index": 12,
      "title": "Installing Apache, MySQL, and PHP",
      "instructor": "David Gassner",
      "date_completed": "2020-10-17",
      "synopsis": "This course describes how to install and configure Apache HTTP Server, MySQL database server, and PHP, known collectively as the AMP stack, on a local development computer. David Gassner covers different installation approaches, including installing the components separately on Windows, macOS, and Linux and installing the prepackaged WampServer and MAMP bundles. Plus, learn how to troubleshoot port conflicts and other AMP-related issues.",
      "objectives": [
        "Installing Apache on Windows",
        "Working with PHP on Windows and macOS",
        "Installing MySQL on Windows and macOS",
        "Starting and stopping Apache on macOS",
        "Installing Apache, PHP, and MySQL on Ubuntu Linux",
        "Installing and managing WampServer",
        "Defining WampServer directory aliases",
        "Installing MAMP on macOS",
        "Configuring Apache and MySQL server ports on MAMP",
        "Handling port conflicts on Windows and macOS",
        "Resetting the root admin password for MySQL"
      ],
      "skills": ["Database Development", "MySQL", "PHP", "Apache"],
      "comments": "I ended up installing and configuring the separate components (Apache, MySQL, PHP) along with MySQL Workbench on Windows 10, a MAMP bundle on a Mac, and then went back and installed MySQL Workbench there, and the separate components on a Ubuntu (Desktop) (Linux) Hyper-V VM, and on a Ubuntu Server (Linux) Hyper-V VM.",
      "url": "https://www.linkedin.com/learning/installing-apache-mysql-and-php-3",
      "certs": [
        "CertificateOfCompletion_Installing Apache MySQL and PHP_LI.pdf"
      ]
    },
    {
      "index": 11,
      "title": "Learning Regular Expressions",
      "instructor": "Kevin Skoglund",
      "date_completed": "2020-10-13",
      "synopsis": "Regular expressions, or regexes, can help you speed up tedious tasks and streamline your workflow. Regexes can be used in most modern programming languages, including Java, JavaScript, Perl, Python, ActionScript, and C#. In this course, learn how to use regexes to define complex text patterns which can be used for powerful search and replace techniques. Instructor Kevin Skoglund covers the basic syntax of regexes, shows how to create flexible matching patterns, and demonstrates how the regular expression engine parses text to find matches. Learn how to write regexes using character sets, grouping, alternation, start and end anchors, word boundaries; and more.",
      "objectives": [
        "Creating flexible patterns using character sets",
        "Achieving efficiency when using repetition",
        "Writing logical and efficient alternations",
        "Defining character sets",
        "Greedy and lazy expressions",
        "Writing regexes using start and end anchors"
      ],
      "skills": ["Pattern Matching", "Regular Expressions"],
      "comments": "Great course!<br />From minimally using grep in HP-UX at a job, to programming classes, to using grep in Linux courses, I always told myself, \"I need to learn more about Regular Expressions.\"<br />And now I have!",
      "url": "https://www.linkedin.com/learning/learning-regular-expressions-2",
      "certs": ["CertificateOfCompletion_Learning Regular Expressions_LI.pdf"]
    },
    {
      "index": 10,
      "title": "Learning the JavaScript Language",
      "instructor": "Joe Chellman",
      "date_completed": "2020-10-12",
      "synopsis": "JavaScript is the lingua franca of the web, but before using it to create dynamic websites, you need to understand how it works. In this course, Joe Chellman explores the syntax behind the JavaScript language. He shows how to \"speak\" JavaScript by gaining an understanding of variables, types, objects, arrays, operators, control structures, loops, and functions, through a series of hands-on examples that put these ideas into action. After completing this course, most developers will grasp the core syntax of JavaScript and how this scripting language works to build powerful and complex functionality on the web.",
      "objectives": [
        "Using a text editor",
        "Declaring and assigning variables",
        "Booleans and the quest for truth",
        "Working with objects and arrays",
        "Using operators and control structures",
        "Iterating with loops",
        "Objects, references, and functions",
        "Promises, async, and await"
      ],
      "skills": ["Front-end Development", "JavaScript"],
      "comments": null,
      "url": "https://www.linkedin.com/learning/learning-the-javascript-language-2",
      "certs": [
        "CertificateOfCompletion_Learning the JavaScript Language_LI.pdf"
      ]
    },
    {
      "index": 9,
      "title": "Phone-Based Customer Service",
      "instructor": "Jeff Toister",
      "date_completed": "2020-10-09",
      "synopsis": "Customer service expert Jeff Toister helps customer service specialists develop the specific skills needed to help customers over the phone. Learn how to break the ice and develop rapport with the people you serve, even when you're pressed for time. Tune out distractions and develop listening skills that are critically important to phone service. Last, learn how to express empathy, de-escalate angry callers, and stay focused throughout the day.",
      "objectives": [
        "Developing the perfect phone greeting",
        "Filling dead air",
        "Managing holds and transfers",
        "Listening",
        "Expressing empathy",
        "De-escalating angry callers"
      ],
      "skills": [
        "Communication",
        "Small Business Management",
        "Customer Service",
        "Phone Coverage"
      ],
      "comments": null,
      "url": "https://www.linkedin.com/learning/phone-based-customer-service",
      "certs": ["CertificateOfCompletion_PhoneBased Customer Service_LI.pdf"]
    },
    {
      "index": 8,
      "title": "Introduction to CSS",
      "instructor": "Carrie Dils",
      "date_completed": "2020-10-09",
      "synopsis": "Once you have learned the basics of HTML, it's time to start exploring Cascading Style Sheets (CSS), the language that makes HTML look great in the browser. This course gives you a tour of the possibilities, showing what CSS is capable of doing and the basics you need to make it work for you. Join Carrie Dils as she explains what CSS is and how it works with HTML, discusses authoring options, and covers common CSS concepts such as the CSS box model and how to work with fonts and color. Plus, she demonstrates how to structure a page with CSS, maintain CSS with version control, work with media queries, and more.",
      "objectives": [
        "What is CSS?",
        "Understanding how CSS works with HTML",
        "Applying fonts",
        "Understanding the classic box model",
        "Setting margins and padding",
        "Positioning elements",
        "Basic CSS layout concepts",
        "Media types and media queries",
        "Working with CSS frameworks and CSS grids",
        "Creating responsive layouts",
        "Tools that help you write and maintain CSS"
      ],
      "skills": [
        "Front-end Development",
        "Cascading Style Sheets (CSS)",
        "Web Standards"
      ],
      "comments": "Although billed as an \"Introduction,\" this course is PACKED with great information!",
      "url": "https://www.linkedin.com/learning/introduction-to-css",
      "certs": ["CertificateOfCompletion_Introduction to CSS_LI.pdf"]
    },
    {
      "index": 7,
      "title": "Working with Upset Customers",
      "instructor": "Jeff Toister",
      "date_completed": "2020-10-08",
      "synopsis": "More than any other topic, frontline employees ask for advice on how to serve angry and upset customers. This course reveals proven techniques for effectively neutralizing negative situations. Customer service expert Jeff Toister also shares specific actions employees can take before and after encounters with upset customers that will reduce the likelihood of problems occurring in the future.",
      "objectives": [
        "Listening with empathy",
        "Helping the customer be right",
        "Preserving the relationship",
        "Learning from angry customers",
        "Passing along complaints",
        "Replacing trigger words"
      ],
      "skills": ["Customer Communication", "Customer Service"],
      "comments": "I liked the fact that he provided a PDF with Additional Resources, that had links.<br />Good customer service!<br />I've taken other courses here that didn't do that, but just popped up links during the videos, that couldn't even be copied/pasted. So I'd have to pause the presentation, go type the link into a browser, then create a bookmark/favorite for it.",
      "url": "https://www.linkedin.com/learning/working-with-upset-customers",
      "certs": ["CertificateOfCompletion_Working with Upset Customers_LI.pdf"]
    },
    {
      "index": 6,
      "title": "Learn API Documentation with JSON and XML",
      "instructor": "Peter Gruenbaum",
      "date_completed": "2020-10-05",
      "synopsis": "Document the ins and outs of the data sent and received by web APIs so that developers can understand how to build applications that can successfully use that data. Programming and technical writing expert Peter Gruenbaum knows that APIs are becoming increasingly more important, which is why, in this course, he shows you how to document structured data using data-interchange formats to help you establish strong, foundational skills in web API documentation. Peter shares the benefits of creating good documentation, explains the differences between responses and requests, and discusses how to work with common data types and collections—from numbers and text to arrays and dictionaries. He then shows how to create and document structured data using JSON and then XML. He wraps up the course by examining the pros and cons of available documentation and collaboration tools like wikis and knowledge bases.",
      "objectives": [
        "The purpose of documentation",
        "Data types",
        "Structured data",
        "Writing JSON and XML",
        "Markdown",
        "Documenting one-level JSON responses",
        "Documenting nested JSON responses",
        "XML attributes and examples",
        "Documenting XML",
        "Structuring data documentation"
      ],
      "skills": ["Application Programming Interfaces", "JSON", "XML"],
      "comments": "I wasn't sure what this course was going to cover, and it turned out to be pretty interesting -<br />It pertains to the JSON and/or XML data used when sending requests to, and receiving responses from, Web APIs.<br />We learned how to clearly document that structured data using tables we created using Markdown (language).<br />I had just been introduced to Markdown in a course I had taken here recently, and it is a great tool - for quickly presenting formatted information (incl. links, pictures, tables, etc.), which can then be easily converted to HTML.<br />We also covered tools/systems and other resources that can be used in this endeavor.",
      "url": "https://www.linkedin.com/learning/learn-api-documentation-with-json-and-xml",
      "certs": [
        "CertificateOfCompletion_Learn API Documentation with JSON and XML_LI.pdf"
      ]
    },
    {
      "index": 5,
      "title": "Learning Python",
      "instructor": "Joe Marini",
      "date_completed": "2020-10-03",
      "synopsis": "Python—the popular and highly readable object-oriented language—is both powerful and relatively easy to learn. Whether you're new to programming or an experienced developer, this course can help you get started with Python. Joe Marini provides an overview of the installation process, basic Python syntax, and an example of how to construct and run a simple Python program. Learn to work with dates and times, read and write files, and retrieve and parse HTML, JSON, and XML data from the web.",
      "objectives": [
        "Installing Python",
        "Choosing an editor or IDE",
        "Working with variables and expressions",
        "Writing loops",
        "Using the date, time, and datetime classes",
        "Reading and writing files",
        "Fetching internet data",
        "Parsing and processing HTML"
      ],
      "skills": ["Python (Programming Language)"],
      "comments": "There was a cool lesson where we worked with JSON data from a USGS Earthquakes GeoJSON Feed page, extracting and displaying some of the data from recent earthquakes.<br />This was my first exposure to working with JSON data, and I'm thinking about seeing if I can incorporate some of that earthquake data into an iOS app. I know that there are plenty of earthquake apps around, but I think it would be a good learning experience, nonetheless...",
      "url": "https://www.linkedin.com/learning/learning-python/learning-python",
      "certs": [
        "CertificateOfCompletion_Learn API Documentation with JSON and XML_LI.pdf"
      ]
    },
    {
      "index": 4,
      "title": "Visual Studio Code for Web Developers",
      "instructor": "Joe Marini",
      "date_completed": "2020-09-30",
      "synopsis": "A great code editor is a crucial addition to any web developer's arsenal of tools. In this course, learn how to make the most of Visual Studio (VS) Code—the powerful code editor from Microsoft—when working with web-based projects.<br /><br />Joe Marini kicks off the course by taking you through the app's user interface, and showing how to work with its basic editing features. Next, Joe demonstrates how to customize VS Code by configuring preferences, setting your own keyboard shortcuts, and working with snippets. He also explains how to maximize your productivity by installing and managing extensions from the Visual Studio Marketplace. Plus, he discusses how VS Code works with folders and collections of files, helps you understand the IntelliSense feature, and dives into the app's advanced code editing features, such as automatic formatting.",
      "objectives": [
        "Installing Visual Studio Code",
        "The VS Code UI",
        "Understand how VS Code works with built-in Git integration",
        "Customizing VS Code",
        "Configuring preferences",
        "Setting keyboard shortcuts",
        "Using extensions",
        "Working with snippets",
        "Using VS Code to edit different parts of the same file",
        "Using multiple selections",
        "Understanding how VS Code works with JSON files"
      ],
      "skills": [
        "Front-end Development",
        "Back-End Web Development",
        "Visual Studio"
      ],
      "comments": null,
      "url": "https://www.linkedin.com/learning/visual-studio-code-for-web-developers",
      "certs": [
        "CertificateOfCompletion_Visual Studio Code for Web Developers_LI.pdf"
      ]
    },
    {
      "index": 3,
      "title": "Learning PowerShell",
      "instructor": "Matt Hester",
      "date_completed": "2020-09-26",
      "synopsis": "What is PowerShell? PowerShell is a powerful language used for scripting and automation for your IT Infrastructure. In this short course, author Matt Hester provides an overview of the most current release, PowerShell 5.0, including how to read the PowerShell language and scripts, get help, and use cmdlets.  Matt then dives into PowerShell's functions and What If statements, working with output, and coding in the Integrated Scripting Environment (ISE). The course wraps up with some tips on using PowerShell for both on-premises and cloud deployments involving Office 365 and Azure.",
      "objectives": [
        "Identify the purpose of a delimiter.",
        "Recognize the tools needed to build a command using the ISE.",
        "Identify the options to use when running Get-Service from a remote computer.",
        "Recognize the capabilities of four cmdlets.",
        "Explain how to transfer aliases from a file into PowerShell.",
        "Determine if a cmdlet will generate an error when executed."
      ],
      "skills": ["PowerShell", "IT Automation"],
      "comments": null,
      "url": "https://www.linkedin.com/learning/learning-powershell",
      "certs": [
        "CertificateOfCompletion_Learning PowerShell_LI.pdf",
        "CertificateOfCompletion_Learning PowerShell_NASBA.pdf"
      ]
    },
    {
      "index": 2,
      "title": "Technical Writing: Quick Start Guides",
      "instructor": "Leslie O'Flahavan",
      "date_completed": "2020-09-25",
      "synopsis": "A quickstart guide is a short, getting-started document that usually accompanies a product or software. In this course, writing instructor Leslie O'Flahavan explains the components, best writing practices, and overall strategy for creating a quickstart guide that helps readers easily find answers to their questions. Leslie shares how to base your quickstart guide on your user manual or develop your guide by using customer feedback. She also discusses how to clearly identify the overall purpose of your guide, write clear headings, and use plain language. To wrap up, she covers methods for getting feedback from subject matter experts and users to ensure that your guide is both accurate and useful.",
      "objectives": [
        "Explain the difference between a conceptual guide and a procedural guide.",
        "Determine how to address a user when writing a quickstart guide.",
        "Recall a tactic that helps avoid too many notes.",
        "Identify the benefits of using plain language.",
        "Name the most important aspect of formatting."
      ],
      "skills": ["Technical Writing"],
      "comments": null,
      "url": "https://www.linkedin.com/learning/technical-writing-quick-start-guides",
      "certs": [
        "CertificateOfCompletion_Technical Writing Quick Start Guides_LI.pdf",
        "CertificateOfCompletion_Technical Writing Quick Start Guides_PMI.pdf"
      ]
    },
    {
      "index": 1,
      "title": "Learning Linux Command Line",
      "instructor": "Scott Simpson",
      "date_completed": "2020-09-25",
      "synopsis": "Knowledge of the Linux command line is critical for anyone who uses this open-source operating system. For many tasks, it's more efficient and flexible than a graphical environment. For administrators, it plays a vital role in configuring permissions and working with files. In this course, experienced instructor Scott Simpson discusses the basics of working with the Linux command line using the Bash shell, focusing on practical Linux commands with examples that help you navigate through the file and folder structure, edit text, and set permissions. Scott also discusses some of the common command-line tools, such as grep, awk, and sed, and command-line apps such as the nano and Vim text editors. The course wraps up with a look at how to install and update software with a package manager.",
      "objectives": [
        "Recognize what the characters \"-h\" represent in the statement \"df –h/home/alice/Documents\"",
        "Explain how to recall a previous command in Bash.",
        "Identify what the command \"ls -l\" will show.",
        "Recall what is needed to use the find command to look for files by name, size, and so on.",
        "List the two modes file permissions can be set to.",
        "Recall why many command line tools are intended to be used in pipes with other commands.",
        "Explain what the command \"grep -E \"[123]\" report.txt\" will show.",
        "Identify what the \">\" symbol is often used for."
      ],
      "skills": [
        "Bash",
        "Network Administration",
        "Computer Networking",
        "Linux"
      ],
      "comments": "Excellent course! I recently created several Hyper-V VMs (in part, to learn a little about working with Hyper-V) of various Linux flavors on my laptop. And it has been several years since Connie sent the Kofax Technical Support dept. to Linux classes, so I needed a refresher. I had already (re)learned some of this by looking stuff up on the Internet, but this would have saved me some time. And this course helped me to understand why/how things are as they are.<br />And I also learned about using Linux in Windows using the WSL (Windows Subsystem for Linux).",
      "url": "https://www.linkedin.com/learning/learning-linux-command-line-2",
      "certs": [
        "CertificateOfCompletion_Learning Linux Command Line_LI.pdf",
        "CertificateOfCompletion_Learning Linux Command Line_NASBA.pdf",
        "CertificateOfCompletion_Learning Linux Command Line_CompTIA.pdf"
      ]
    }
  ]
}
